{"title":"Encyclopedia of the American Constitution","uid":6485297,"size":21848068,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00a7a08f3edfe48207f732f8ae00ef28bc87f8e2&amp;dn=Encyclopedia+of+the+American+Constitution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1308685651,"description":"Encyclopedia of the American Constitution (6 Volume Set) \nPublisher: Gacl | ISBN: 0028648803 | edition 2000 | PDF | 3309 pages | 20.8 mb\n\nThis new edition admirably continues the standard set in 1986 of providing high-quality, insightful, and thorough essays by leading constitutional scholars, law school professors, judges, historians, and political scientists on practical and theoretical topics dealing with every aspect of constitutional law in the U.S., from the Constitutional Convention in 1787 to the Clinton impeachment. The first edition won the 1987 Dartmouth Medal awarded by ALA's Reference and User Services Association and was designated as one of four core reference sources for a &quot;Bicentennial Bookshelf&quot; by the National Endowment for the Humanities. In 1992, a one-volume supplement was published, covering major constitutional developments and decisions since 1985 as well as topics omitted from the original set. When it came time to consider publishing a second supplementary volume, the editors wisely decided that it would be too unwieldy for users to have to consult the main volume plus two supplements to obtain thorough coverage of a topic. Instead, the editors opted to produce one new set, which would not only update many existing articles and cover new topics of importance but also include the original content of the first edition and its supplement.","torrent":{"xt":"urn:btih:00a7a08f3edfe48207f732f8ae00ef28bc87f8e2","amp;dn":"Encyclopedia+of+the+American+Constitution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00a7a08f3edfe48207f732f8ae00ef28bc87f8e2","infoHashBuffer":{"type":"Buffer","data":[0,167,160,143,62,223,228,130,7,247,50,248,174,0,239,40,188,135,248,226]},"announce":[],"urlList":[]}}