{"title":"Smart Composite Coatings and Membranes - M.F. Montemor","uid":15372083,"size":37786553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:022866297d1bacbe3485c549c81ef630f1c91f02&amp;dn=Smart+Composite+Coatings+and+Membranes+-+M.F.+Montemor&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469146814,"description":"Smart Composite Coatings and Membranes - M.F. Montemor (WP, 2016).pdf\r\n\r\nSmart Composite Coatings and Membranes: Transport, Structural, Environmental and Energy Applications provides the latest information on the increase in demand for new smart materials for a wide array of different technological applications.\r\n\r\nThe book comprehensively reviews the latest developments in smart composite materials used as membranes, barriers, and coatings, with a special focus on corrosion protection, transportation, structure, and the wide range of applications.\r\n\r\nPart one examines the properties, processing, and manufacture of smart composite materials, along with techniques for modeling the behavior of these materials, while other sections review the use of smart composite coatings in aerospace, marine, and metal structural applications, examine the protective properties and applications of smart composite coatings, and introduce specific low environmental impact and energy efficient applications, such as energy generation and storage, water management, and stone conservation.\r\n\r\n\r\n\r\nExplores the use of smart composite materials for coatings, barriers and membranes\r\nComprehensively reviews the latest developments in smart composite materials, with a special focus on corrosion protection, transportation, structure, and the wide range of applications\r\nExamines the properties, processing, manufacture and behavior modeling of smart composite materials\r\nFocuses on applications that have an impact on more effective energy savings and efficiency, green-house emissions, and environmental protection","torrent":{"xt":"urn:btih:022866297d1bacbe3485c549c81ef630f1c91f02","amp;dn":"Smart+Composite+Coatings+and+Membranes+-+M.F.+Montemor","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"022866297d1bacbe3485c549c81ef630f1c91f02","infoHashBuffer":{"type":"Buffer","data":[2,40,102,41,125,27,172,190,52,133,197,73,200,30,246,48,241,201,31,2]},"announce":[],"urlList":[]}}