{"title":"Andy LaVerne -  Play Jazz Piano Standards DVD5 ","uid":9378618,"size":4480444416,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:02689ff180e731951577b1ae96dd5dcd2761b430&amp;dn=Andy+LaVerne+-++Play+Jazz+Piano+Standards+DVD5+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pizzaslice","files":-1,"time":1387670184,"description":"Andy LaVerne - Learn to Play Jazz Piano Standards (Homespun Tapes) [2006, Piano, Jazz, DVD5, ENG] (Training Videos, Video Tutorial)\n\n\nAndy LaVerne - Learn to Play Jazz Piano Standards (Homespun Tapes)\n\nCountry : USA Subject : Piano, Jazz Distributed by type of material : Video Training, Video Tutorial Length : 1:39:23 Year : 2006 Language : English Translation : None Description : English \n\n\n\nA challenging and rewarding learning Experience for All proficient Jazz Pianists WHO want to broaden Their Vocabulary and improvise more Creatively, based around six stunning standards. Andy LaVerne illuminates the chord Changes, voicings, embellishments and improvisational ideas That make the standards Come to Life. You'll begin by learning the basic changes, before moving into more complex renditions, demonstrated at half-speed so that you won't miss a note. Each song is dissected Harmonically, Opening up Huge Potentials in reharmonisation and Substitution, as well as providing A Solid guide for your own improvised melodies. Explore six beautiful Jazz standards and learn chord Changes, voicings, embellishments and Other essential tools to broaden your Jazz Vocabulary . Andy teaches both basic and complex versions of each song while recording it on the Yamaha Disklavier. As he replays the disk at half-speed, he gives a detailed explanation of the music. Andy's reharmonization (a different chordal structure under the melody) and contrafacts (a new melody composed over the original chord structure) for each tune complete this in-depth lesson from a master of improvisation. Russian leading jazz pianist Andy LaVerne (Andy LaVerne) for example, six samples of excellent shows and explains in detail the principles of construction and chord changes, regarmonizatsiyu, embellishing melodies options and shares improvisational ideas, helps to bring real music standards, expand vocabulary and technique of jazz students. Starting with simple changes, you gradually proceed to the study of more complex material, which will be shown at half speed, so that you can make out all the author's comments. Each song is presented in detail analyzes that will help you in writing your own improvised melodies. Recording and playback of unique musical phrases Andy piano Yamaha Disklavier used tool. Songs : Just Friends, My Romance, How Deep is the Ocean, Night and Day, and Body Soul, Like Someone in Love. \n\n\nQuality : DVD5 Format : DVD video Video codec : MPEG2 Audio codec : AC3 Video : MPEG2, NTSC 4:3 (720x480), 29.970 fps, 5456 Kbps Audio : AC-3, 2 channels, 48.0 KHz, 224 Kbps ","torrent":{"xt":"urn:btih:02689ff180e731951577b1ae96dd5dcd2761b430","amp;dn":"Andy+LaVerne+-++Play+Jazz+Piano+Standards+DVD5+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02689ff180e731951577b1ae96dd5dcd2761b430","infoHashBuffer":{"type":"Buffer","data":[2,104,159,241,128,231,49,149,21,119,177,174,150,221,93,205,39,97,180,48]},"announce":[],"urlList":[]}}