{"title":"Lexcycle Stanza Desktop 1.0 Beta 18","uid":8802356,"size":54788591,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:03992b671543c73a7bab87dc19849e9f998bf8fd&amp;dn=Lexcycle+Stanza+Desktop+1.0+Beta+18&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"6kirara9","files":1,"time":1376240655,"description":"Language:  English\nOS:        Windows 7\nVersion:   1.0 Beta 18\n\nDescription\n=========\nThere's no doubt that eBooks are the future and one day, there could be reader wars in much the same way as the browser wars that take place on the Internet.\nStanza is an early entrant into this market, featuring a clean, well-organized interface that's designed for reading all kinds of digital publications, including electronic books, newspapers, PDFs, and general web content. It's elegant because it's been designed specifically for the Mac, and puts an emphasis on highlighting hyphenation, columns, automatic text scrolling and user-friendly page and chapter navigation.\n\nThis is done to make reading long texts easier on the eye and brain, which can soon get tired from reading lengthy data on an electronic screen. Stanza supports HTML, PDF, Microsoft Word, and Rich Text Format reading, as well as all the major eBook standards. It's also a very open reader - developers can add new formats to the programs API meaning it will always be able to handle the latest releases.\n\nStanza is a fully functional reader that's a little bloated in places but it could be well positioned to be one of the front runners when eBooks and digital publishing really takes off.\n\nNotes\n=========\nThis is the first beta release of Stanza for Windows. There are a number of features that are not yet implemented and there are some areas where Stanza is rough around the edges. Please be patient and understanding with us as we work to improve our Windows support.\nSpecifically, the following known issues exist:\nCopying to the clipboard does not yet work. \nExporting to an Audio Book is not supported. \nOnly one layout (vertical) is currently available.","torrent":{"xt":"urn:btih:03992b671543c73a7bab87dc19849e9f998bf8fd","amp;dn":"Lexcycle+Stanza+Desktop+1.0+Beta+18","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03992b671543c73a7bab87dc19849e9f998bf8fd","infoHashBuffer":{"type":"Buffer","data":[3,153,43,103,21,67,199,58,123,171,135,220,25,132,158,159,153,139,248,253]},"announce":[],"urlList":[]}}