{"title":"Agnes and the Hitman - Jennifer Crusie &amp; Bob Mayer","uid":11931448,"size":369324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03aab09f5534d99ffdeb4c460bd976e5317fba51&amp;dn=Agnes+and+the+Hitman+-+Jennifer+Crusie+%26amp%3B+Bob+Mayer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Mohammad_AT","files":3,"time":1431811970,"description":"Take one food writer named Cranky Agnes, add a hitman named Shane, mix them together with a Southern mob wedding, a missing necklace, two annoyed flamingos, and a dog named Rhett and you've got a recipe for a sexy, hilarious novel about the disastrous side of true love...\n\nAgnes Crandall's life goes awry when a dognapper invades her kitchen one night, seriously hampering her attempts to put on a wedding that she's staked her entire net worth on. Then a hero climbs through her bedroom window. His name is Shane, no last name, just Shane, and he has his own problems: he's got a big hit scheduled, a rival trying to take him out, and an ex-mobster uncle asking him to protect some little kid named Agnes. When he finds out that Agnes isn't so little, his uncle has forgotten to mention a missing five million bucks he might have lost in Agnes's house, and his last hit was a miss, Shane's life isn't looking so good, either. Then a bunch of lowlifes come looking for the money, a string of hit men show up for Agnes, and some wedding guests gather with intent to throw more than rice. Agnes and Shane have their hands full with greed, florists, treachery, flamingos, mayhem, mothers of the bride, and--most dangerous of all--each other. Agnes and the Hitman is the perfect combination of sugar and spice, sweet and salty--a novel of delicious proportions","torrent":{"xt":"urn:btih:03aab09f5534d99ffdeb4c460bd976e5317fba51","amp;dn":"Agnes+and+the+Hitman+-+Jennifer+Crusie+%26amp%3B+Bob+Mayer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03aab09f5534d99ffdeb4c460bd976e5317fba51","infoHashBuffer":{"type":"Buffer","data":[3,170,176,159,85,52,217,159,253,235,76,70,11,217,118,229,49,127,186,81]},"announce":[],"urlList":[]}}