{"title":"[2014] Trans-Pacific Partnership - Environment Chapter.pdf","uid":9494321,"size":335974,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:043d3fb51fcbba4ada783ded2bcf3d48fedd883e&amp;dn=%5B2014%5D+Trans-Pacific+Partnership+-+Environment+Chapter.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seering","files":1,"time":1390061845,"description":"This is the confidential draft treaty chapter from the Environment Working Group of the Trans-Pacific Partnership (TPP) talks between the United States, Japan, Mexico, Canada, Australia, Malaysia, Chile, Singapore, Peru, Vietnam, New Zealand and Brunei Darussalam. The treaty is being negotiated in secret by delegations from each of the 12 countries, who together account for 40% of global GDP. The chapter, covering proposed international obligations and enforcement mechanisms for protection of the \nenvironment, was drafted by the Chairs of the TPP Environment Working Group, at request from the TPP Ministers and at the Chairs' own responsibility, and is an attempt at a &quot;landing zone&quot; document to quickly move the text along and identify outliers. The document demonstrates the state of the text at the end of the Brunei round, as well as all discussions that have occurred in each negotiating round that the Chairs have participated in since, up to the date of drafting. The text dates from the end of the Salt Lake City meetings, and before the December Singapore TPP Ministerial Meeting. The text endeavours to present a package from the Chairs that considers the interests of all Parties and encompasses compromises across all issues, attempting to resolve tensions within the working group, which are then further detailed in the corresponding Chairs' report","torrent":{"xt":"urn:btih:043d3fb51fcbba4ada783ded2bcf3d48fedd883e","amp;dn":"%5B2014%5D+Trans-Pacific+Partnership+-+Environment+Chapter.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"043d3fb51fcbba4ada783ded2bcf3d48fedd883e","infoHashBuffer":{"type":"Buffer","data":[4,61,63,181,31,203,186,74,218,120,61,237,43,207,61,72,254,221,136,62]},"announce":[],"urlList":[]}}