{"title":"The Fugitive S02E03 F.A.R.T. 1964 Version Man On A String DivX","uid":4479031,"size":525502588,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:049886b97021a13a8ff4a569f215ab64c81925d3&amp;dn=The+Fugitive+S02E03+F.A.R.T.+1964+Version+Man+On+A+String+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Raktajino","files":-1,"time":1225476103,"description":"From the Fugitive Audio Restoration Team (F.A.R.T.) comes this excellent quality video with the original soundtrack restored! As you probably know, the DVD's of season two of The Fugitive were released with a completely new, synthesized music score which destroyed much of the show's drama. Now, thanks to the Fugitive Audio Restoration Team, you can enjoy the show in top quality as it was originally intended to be experienced.\n\nThe Fugitive Season 2 (1964)\nS02E03 Man on a String\nFirst aired: 9/29/1964\n\nWhile walking on the road late at night, Kimble comes to the aid of Lucey Russell after her car has broken down. As gratitude, she provides him with a place to stay for the night. But the next morning, the police find the dead body of Lars Adams, a married man who Lucey had been having an affair with, only a few feet from where her car broke down. As a result, Lucey is arrested for Lars' murder. Lars' wife, Amy, realizes that her husband was killed accidentally, but after learning of his philandering with Lucey, Amy decides that Lucey should take the rap. Kimble realizes that he can prove Lucey's innocence, but testifying for her could jeopardize his own freedom. Sydney Pollack directs this episode, Lois Nettleton guest stars.\n\nCast: David Janssen as Dr. Richard Kimble, Barry Morse as Lt. Philip Gerard, Bill Raisch as Fred Johnson (The One-Armed Man), Diane Brewster (flashbacks) as Helen Kimble, J.D.Cannon as Lloyd Chandler, William Conrad as Narrator (voice)\n\nGuest cast: Lois Nettleton (Lucey Russell), John Larch (George Duncan), Patricia Smith (Amy Adams), Malcolm Atterbury (Sheriff Mead), Cyril Delevanti (Old Timer), Russell Collins (Doc Phillips)\nWriter: Barbara Merlin, Milton Merlin, Harry Kronman\nDirector: Sydney Pollack\n\n(synopsis by jeans2nd)\n\n\nAs always, leave a comment if you want to see more!","torrent":{"xt":"urn:btih:049886b97021a13a8ff4a569f215ab64c81925d3","amp;dn":"The+Fugitive+S02E03+F.A.R.T.+1964+Version+Man+On+A+String+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"049886b97021a13a8ff4a569f215ab64c81925d3","infoHashBuffer":{"type":"Buffer","data":[4,152,134,185,112,33,161,58,143,244,165,105,242,21,171,100,200,25,37,211]},"announce":[],"urlList":[]}}