{"title":"Star Trek The Next Generation Before Dishonor by Peter David ePu","uid":10639928,"size":426560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04ab7d1afbd6911c68ef8b8a568faa6acb8dd270&amp;dn=Star+Trek+The+Next+Generation+Before+Dishonor+by+Peter+David+ePu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jedi.jesse","files":-1,"time":1406439161,"description":"An enemy so intractable that it cannot be reasoned with. The entire race thinks with one mind and strives toward one purpose: to add our biological distinctiveness to their own and wipe out individuality, to make every living thing Borg. \n\nIn over two centuries, the Federation has never encountered a greater threat. Twice Starfleet assembled and threw countless starships to stand against them. The Borg were stopped, the price paid in blood. Humanity breathed a sigh of relief, assuming it was safe. And with the destruction of the transwarp conduits, the Federation believed that the killing blow had finally been struck against the Borg. \n\nDriven to the point of extinction, the Borg continue to fight for their very existence, for their culture. They will not be denied. They must not be stopped. The old rules and assumptions regarding how the Collective should act have been dismissed. Now the Borg kill first, assimilate later. \n\nWhen the Enterprise manages to thwart them once again, the Borg turn inward. The dark places that even the drones never realized existed are turned outward against the enemy they have never been able to defeat. What is revealed is the thing that no one believed the Borg could do.\n\n\n\nAfter being unable to find a well-formatted version of this book, I took it upon myself to edit and fix the punctuation in this book.","torrent":{"xt":"urn:btih:04ab7d1afbd6911c68ef8b8a568faa6acb8dd270","amp;dn":"Star+Trek+The+Next+Generation+Before+Dishonor+by+Peter+David+ePu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04ab7d1afbd6911c68ef8b8a568faa6acb8dd270","infoHashBuffer":{"type":"Buffer","data":[4,171,125,26,251,214,145,28,104,239,139,138,86,143,170,106,203,141,210,112]},"announce":[],"urlList":[]}}