{"title":"TTC - Story of Human Language - John McWhorter","uid":4653882,"size":265311444,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:05acf2fedb36663c07c098eecff13d248543ed89&amp;dn=TTC+-+Story+of+Human+Language+-+John+McWhorter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kukamonga","files":37,"time":1232140196,"description":"Linguistics expert John McWhorter is a Senior Fellow at the Manhattan Institute whose academic speciality is language change and language contact. In The Story Of Human Language, Professor McWhorter presents 36 thirty minute lectures captures in a six DVD format series organized into 3 plastic storage cases of two discs each. This fully developed seminar begins with an exploration and explanation of what constitutes language, how languages changes and evolves, the classification of language into &quot;families&quot;, &quot;The Case Against the World's First Language&quot; and &quot;The Case For the World's First Language&quot;. Professor McWhorter then goes on to cover dialects, language mixture, offers a new perspective on the developmental history of English. Then addressing the question of wether culture drives language change, Professor McWhorter ably addresses how language &quot;starts over&quot; using Creole as an illustration. Concluding with lectures on Black English, &quot;language death&quot;, and artificial languages, Professor McWhorter ends with his lecture series with &quot;Finale--Master Class&quot;. Professor McWhorter's lectures are hallmarked with an engaging, informative, and even entertaining presentation style that proves easily accessible to the non-specialist general viewer, and yet is detailed and scholastically rigorous to serve the needs of the student seeking academic credits. This DVD lecture series is accompanied by three paperbacks (The Story of Human Language: Parts 1, 2 &amp; 3) that provide a published version of all of the lectures. The Story Of Human Language is strongly recommended for college and university library collections, and would make an excellent curriculum for individual advanced student and high-school &quot;Honors Class&quot; studies in the development of &lt;b&gt;language&lt;/b&gt;.","torrent":{"xt":"urn:btih:05acf2fedb36663c07c098eecff13d248543ed89","amp;dn":"TTC+-+Story+of+Human+Language+-+John+McWhorter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05acf2fedb36663c07c098eecff13d248543ed89","infoHashBuffer":{"type":"Buffer","data":[5,172,242,254,219,54,102,60,7,192,152,238,207,241,61,36,133,67,237,137]},"announce":[],"urlList":[]}}