{"title":"Run-D.M.C. - Run-D.M.C + Tougher Than Leather@320","uid":4109113,"size":251916266,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:06bc71915ccf4b94843f2da6116f5300bbbbed95&amp;dn=Run-D.M.C.+-+Run-D.M.C+%2B+Tougher+Than+Leather%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":34,"time":1206921773,"description":"1. Run-D.M.C. - Run-D.M.C\n\n\nYears after the release of Run-D.M.C.&amp;#039;s eponymous 1984 debut, the group generally was acknowledged to be hip-hop&amp;#039;s Beatles -- a sentiment that makes a lot of sense, even if Run-D.M.C. isn&amp;#039;t quite the equivalent of a rap Please Please Me. Run-D.M.C. were the Beatles of rap because they signaled a cultural and musical change for the music, ushering it into its accepted form; neither group originated the music, but they gave it the shape known today. But, no matter how true and useful the comparison is, it is also a little misleading, because it implies that Run-D.M.C. also were a melodic, accessible group, bringing in elements from all different strands of popular music. No, Run-D.M.C.&amp;#039;s expanded their music by making it tough and spare, primarily by adapting the sound and attitude of hard rock to hip-hop. Prior to this, rap felt like a block party -- the beats were funky and elastic, all about the groove. Run-D.M.C. hit hard. The production is tough and minimal, built on relentless drum machines and Jam Master Jay&amp;#039;s furious scratching, mixing in a guitar riff or a keyboard hit on occasion. It is brutal urban music, and Run and D.M.C.&amp;#039;s forceful, muscular rhymes match the music. Where other MCs sounded cheerful, Run and D.M.C. prowl and taunt the listener, sounding as if they were a street gang. And while much of the record is devoted to braggadocio, boasting, and block parties, Run-D.M.C. also addressed grittier realities of urban life, giving this record both context and thematic weight. All of this -- the music, the attitude, the words, the themes -- marked a turning point for rap, and it&amp;#039;s impossible to calculate Run-D.M.C.&amp;#039;s influence on all that came afterward. Years later, some of the production may sound a bit of its time, but the music itself does not because music this powerful and original always retains its impact and force as music.\n\n\n\n1.Hard Times\n2.Rock Box\n3.Jam-Master Jay\n4.Hollis Crew (Krush-Groove 2)\n5.Sucker M.C.&amp;#039;s (Krush-Groove 1)\n6.It&amp;#039;s Like That\n7.Wake Up\n8.30 Days\n9.Jay&amp;#039;s Game\n10.Rock Box - (B-Boy mix, previously unreleased)\n11.Here We Go - (live, at The Funhouse)\n12.Sucker M.C.&amp;#039;s - (previously unreleased, live)\n13.Russell &amp; Larry Running At The Mouth / Jay&amp;#039;s Game - (previously unreleased)\n\n\n\nRun-DMC: Joseph &quot;Run&quot; Simmons, Darryl &quot;DMC&quot; McDaniels (rap vocals); Jason &quot;Jam Master Jay&quot; Mizell (scratches). \nAdditional personnel: Davy DMX (guitar, drum programming); Eddie Martinez (guitar); Larry Smith (keyboards, bass guitar, drum programming); Steve Loeb (keyboards). \nRecording information: Green Street Recording, New York, New York (1984). \nCo-producer - Roddey Hui\nProducer - Larry Smith , Russel Simmons\nLabel  Arista / Profile\nOrig Year  1984\n\n\n\n\n\n2. Run-D.M.C. - Tougher Than Leather\n\n\nAt the end of 1986, Raising Hell was rap&amp;#039;s best-selling album up to that point, though it would soon be outsold by the Beastie Boys&amp;#039; Licensed to Ill. Profile Records hoped that Run-D.M.C.&amp;#039;s fourth album, Tougher Than Leather, would exceed the Beastie Boys&amp;#039; quintuple-platinum status, but unfortunately, the group&amp;#039;s popularity had decreased by 1988. One of Run-D.M.C.&amp;#039;s strong points -- its love of rock &amp; roll -- was also its undoing in hip-hop circles. Any type of crossover success tends to be viewed suspiciously in the hood, and hardcore hip-hoppers weren&amp;#039;t overly receptive to &quot;Miss Elaine,&quot; &quot;Papa Crazy,&quot; &quot;Mary, Mary,&quot; and other rap-rock delights found on the album. Thanks largely to rock fans, this album did go platinum for sales exceeding one million copies -- which ironically, Profile considered a disappointment. But the fact is that while Tougher Than Leather isn&amp;#039;t quite as strong as Run-D.M.C.&amp;#039;s first three albums, it was one of 1988&amp;#039;s best rap releases.\n\n\n01. Run&amp;#039;s House                                                                                                         \n02. Mary Mary                                                                                                           \n03. They Call Us Run-Dmc                                                                                                \n04. Beats To The Rhyme                                                                                                  \n05. Radio Station                                                                                                       \n06. Papa Crazy                                                                                                          \n07. Tougher Than Leather                                                                                                \n08. I&amp;#039;m Not Going Out Like That                                                                                         \n09. How&amp;#039;d Ya Do It Dee                                                                                                  \n10. Miss Elaine                                                                                                         \n11. Soul To Rock And Roll                                                                                               \n12. Ragtime     \n\n\n\nRun-DMC: Joseph &quot;Run&quot; Simmons, Darryl &quot;DMC&quot; McDaniels (rap vocals); Jason &quot;Jam Master Jay&quot; Mizell (scratches).\nAdditional personnel: Jon Sierra (guitar, piano); Davy D. (guitar, bass); Andreas Straub (guitar); Vincent Hammond, The Uptown Horns (horns); Daniel Shulman (bass); Bobby &quot;Afro&quot; Walker (drums).\n\nEngineers: Roey Shamir, Steve Ett, Barbara Milne.\nRecording information: Unique Recording Studios, New York, New York; Electric Lady, New York, New York; Green Street Recording, New York, New York; Chung King House Of Metal, New York, New York (1988).\nProducer: Run-DMC; Davy D.; Rick Rubin\nLabel: Arista / Profile\nOrig Year: 1988\n\n\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\nP.S.: The first Album is NOT my rip!\nMany thanks to original uploader!\n\n\n\n\nEnjoy,Seed and Share\t\n\n","torrent":{"xt":"urn:btih:06bc71915ccf4b94843f2da6116f5300bbbbed95","amp;dn":"Run-D.M.C.+-+Run-D.M.C+%2B+Tougher+Than+Leather%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06bc71915ccf4b94843f2da6116f5300bbbbed95","infoHashBuffer":{"type":"Buffer","data":[6,188,113,145,92,207,75,148,132,63,45,166,17,111,83,0,187,187,237,149]},"announce":[],"urlList":[]}}