{"title":"Burnout Paradise Vanity Pack  1.5","uid":6084406,"size":246401773,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0829e021474a804e8b1fee0e56d7bc22fefc4773&amp;dn=Burnout+Paradise+Vanity+Pack++1.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Coolguy33","files":-1,"time":1294257923,"description":"Welcome to Vanity Pack\n----------------------\n\nThis pack adds some vanity to your Burnout Paradise experience.\n\nBe sure to read the disclaimer fully. You'd be wise to make backups\nof game folder and savegame, just in case. Remember: Backups are\nyour friend.\n\n\nIncluded Features\n-----------------\n- 27 Community finishes\n  Watson Burnout Roadster - Burnout Hints Roadster by Mr_bingley\n  Hunter Citizen - Dutch Police mod by Mr_bingley\n  Kitano Hydros Custom - Subaru mod by Mr_bingley             \n  Carson Inferno Van - DHL Van mod by Mr_bingley              \n  Carson Inferno BRT Van - A-Team Van mod by Mr_bingley       \n  Hunter Racing Oval Champ - Party mod by Mr_bingley\n  Kitano Touge Criterion - Vanity Pack mod by Mr_bingley\n  Krieger PCPD Special - Carbon mod by Hellcopa\n  Hunter Extreme HotRod - Carbon mod by Hellcopa               \n  Hunter Citizen - FBI mod by LeMansRacer                     \n  Kitano Hydros Techno - Drivers Ed mod by LeMansRacer         \n  Rossolini Tempesta GT - Tempesta Dream GT mod by S-J        \n  Hunter Civilian - Ubuntu mod by Jordanwb                    \n  Hunter Olympus - No Vinyl mod by Rich0G007\n  Carson GT Concept - Punisher mod by RichOG007\n  Hunter Reliable Custom - No Vinyl mod by RichOG007\n  Carson Annihilator - Demo Car mod by eLOs\n  Hunter Civilian - Microsoft mod by hazard96\n  Nakamura Ikusa Samurai - HKS mod by kaese88\n  Jansen P12 - All Your P12 Are Belong To Us mod by slashcammas\n  Carson Annihilator - Muscle mod by ouerbacker\n  Carson Annihilator Phoenix - General Lee mod by ouerbacker\n  Carson Fastback Special - Sporty mod by ouerbacker\n  Hunter Oval Champ 69 - Hunter mod by ouerbacker            \n  Jansen Toy P12 - Ribbit mod by smilingfrog\n  Carson Toy GT Concept - Toy GT Flame mod by smilingfrog      \n  Jansen P12 - mod by udreamibuild\n- Not included\n  Hunter Civilian - Taxi mod by RichOG007\n\n- Pedestrian Vehicles\n  Selectable while online, even in races! (The Swedish Racing Mod)\n\n  A selection of the following is available:\n  Trucks\n  Trailers\n  Buses\n  Vans\n  Pickups\n  Taxis\n  SUVs\n  Minivan\n  Station Wagon\n  Saloons\n  Civic\n  Limo\n\n- Custom Pedestrian Vehicle Names &amp; Information\n\n- Sponsor Vehicles\n  Now for the PC!\n\n  A selection of the following is available:\n  Jansen P12 Diamond\n  Kitano Micromania Custom\n  Nakamura B'z Ikusa GT\n  Kitano Gamestop Sport\n  Hunter BestBuy Oval Champ\n  Carson Circuit City Hot Rod\n  Krieger Walmart WTR\n  Carson &quot;Steel Wheels&quot; GT\n \n- Non-paintable Bikes Unlock\n  This unlocks bikes that could not be repaired or painted. If\n  you could not select all country variations of the Nakamura\n  Firehawk GP Competition then you've run into this defect in\n  the original game. This patch unlocks those bikes.\n\n- Customized Menu Graphics\n  Not much here but some branding.\n\n- Customized Paradise City Graphics\n  Spiced up surroundings including:\n  Burnout Hints billboard by Mr. Yeah\n  Billboards\n  Road Signs\n\n- Horns\n  Use this one wisely! Don't be a pest.\n\n- Flames and Hovering\n  Add flames to your vehicle, or all vehicles. A few vehicles can\n  also hover, including:\n   Hunter Takedown 4x4 Toy Car\n   Carson GT Nighthawk\n   Nakamura Firehawk GP Competition Toy Bike\n\n- Off-road Mode (experimental)\n  That's right! You can now drive off-road in pretty much any spot\n  that you can reach by jumping or by showtiming. Beware of water,\n  though!\n  Is this the closest thing to Big Surf Island on the PC?\n  (i.e. driving pretty much anywhere off-road)\n\n- Stealth Mode (experimental) and Takedown Battles\n  A stealth mode has been added. Using this mode you will be able to\n  turn off player names above vehicles and map markers. It can be used\n  together with the new Takedown Battle custom challenges to make a\n  new game mode. The new challenges are:\n\n   2 Player Freeroam Challenge 49: Billboard Top 10\n                                   INDIVIDUAL: Smash 10 Burnout Billboards.\n       Vanity Pack: Takedown Battle\n                    As a team get 10 Takedowns in Downtown Paradise.\n                    Who will be crowned the takedown king?\n\n   3 Player Freeroam Challenge  2: Driver Destruction\n                                   INDIVIDUAL: Smash 1 Burnout Billboard.\n      Vanity Pack: Takedown Battle\n                   As a team get 20 Takedowns in Palm Bay Heights.\n                   Who will be crowned the takedown king?\n\n   4 Player Freeroam Challenge 14: Billboard Intro\n                                   INDIVIDUAL: Smash 1 Burnout Billboard.\n      Vanity Pack: Takedown Battle\n                   As a team get 40 Takedowns in Downtown Paradise.\n                   Who will be crowned the takedown king?\n\n   5 Player Freeroam Challenge 24: Smashing!\n                                   INDIVIDUAL: Smash 2 Burnout Billboards.\n      Vanity Pack: Takedown Battle\n                   As a team get 60 Takedowns in Palm Bay Heights.\n                   Who will be crowned the takedown king?\n\n   6 Player Freeroam Challenge 47: Billboard Hunt\n                                   INDIVIDUAL: Smash 5 Burnout Billboards.\n      Vanity Pack: Takedown Battle\n                   As a team get 80 Takedowns in Downtown Paradise.\n                   Who will be crowned the takedown king?\n\n   7 Player Freeroam Challenge 50: 4 Billboards\n                                   INDIVIDUAL: Smash 4 Burnout Billboards.\n      Vanity Pack: Takedown Battle\n                   As a team get 90 Takedowns in Palm Bay Heights.\n                   Who will be crowned the takedown king?\n\n   8 Player Freeroam Challenge 32: Billboards... Go!\n                                   INDIVIDUAL: Smash 5 Burnout Billboards.\n      Vanity Pack: Takedown Battle\n                   As a team get 100 Takedowns in Downtown Paradise.\n                   Who will be crowned the takedown king?\n\n- Automatic Backup of Savegame\n  Vanity Pack makes a backup of your current savegame with every run.\n  If you don't want this, start it with a &quot;/n&quot; switch and no backup\n  will be made.\n\n- Steam Support\n  As far as we know, Vanity Pack is now compatible with Steam.\n\n\nCompetition\n-----------\n\nA competition was launched with the initial release of Vanity Pack.\n\nSee the &quot;Burnout Paradise the ultimate box for pc&quot; or Burnout Hints\nforums for more information. The competition ended on March 5, 2010.\n\nThe winner was Ouerbacker who found all ten objects.\n\n\nHow To Install\n--------------\n\nUnpack the installer archive to a folder outside of the game folders and run\nVanityPack.exe. If you need to re-run the full installation for some reason,\nfirst remove any vanity.yaml file next to VanityPack.exe. This file holds some\ninstaller preferences that speed up future runs. You will lose any vehicle\neditor preferences, however.\n\n\nHow To Use\n----------\n\nVanityPack.exe has to be run before starting the game executable every time\nthe game is played if you desire some of the dynamically added features. The\ngame is still playable if you don't run VanityPack.exe but you simply won't\nhave access to all its features. It is recommended to quit VanityPack before\nyou quit the game at the end of your gaming sessions.\n\nWhere are the new vehicles?\n* Sponsor vehicles are found at the end of the regular Paradise Cars list\n* Community vehicles are found with their respective vehicle in Paradise Cars,\n  Online Cars and Boost Specials lists\n* Pedestrian vehicles are found in the Online Cars list when you are online\n\nHow to use fusion in the Vanity Pack vehicle editor?\n* Browse a vehicle in the junk yard (Finish 1 is not eligible unless the vehicle\n  has only one finish)\n* Activate fusion selection in the vehicle editor\n* Select a second vehicle to fuse with in the vehicle editor\n* Browse another finish of the vehicle\n* Browse the original finish that was the target of fusion\n* Select the vehicle, colors and play the game\n\nNOTE: Before you try fusion, it is recommended you make a backup of your\n      save game. Restoring a save game backup can break the fusion if you\n      can't get the method described below to work.\nNOTE: The vehicle finish that was the target of fusion will show up under the\n      other vehicle the next time you browse vehicles in the junk yard. E.g.\n      if Finish 3 of the Cavalry was fused with the Extreme Hot Rod then Finish\n      3 of the Cavalry will show up as a second finish under the Extreme Hot Rod.\nNOTE: It can happen that if you change fusion sources around that all finishes\n      of the target vehicle become unselectable in the junk yard. If this happens\n      you will have to redo the fusion and then break the fusion by browsing the\n      fused vehicle in the junk yard, browse another finish under the same vehicle\n      and while doing so change the fusion target back to the original value\n      before browsing another finish or vehicle.\nNOTE: Not much testing has been done on bikes or on fusing cars and bikes, so\n      tread carefully.\n\n\nKnown Issues\n------------\n\n- Vanity Pack requires UAC to be enabled. If you run the executable but don't\n  see an installer GUI, please activate UAC before trying again. There have\n  been reports of the process not being able to be killed. If this happens,\n  restart Windows and try again after having activated UAC.\n\n- Running the game after installing Vanity Pack might trigger Anti-Virus\n  software to question the executable. The changes therein are limited to\n  modding the game startup logo, a custom road name and horns activation.\n  The game executable can be replaced with the original executable after\n  installation if you so choose. You will only lose out on the above\n  features for now.\n\n- If the boost flames setting is changed from All Vehicles while the current\n  vehicle is in hover mode then the vehicle might get stuck in hover mode and\n  its wheels start wobbling. Hey, nice feature! ;-)\n\n- Only the vehicles mentioned in the features section above support hovering.\n  For other vehicles you will just see the camera move.\n\n- If you land in water in off-road mode, your screen will go black. Turn off\n  off-road mode to respawn normally. The same can be done to get out of off-road\n  areas that you can't showtime your way out of. If you land upside down in\n  off-road mode you can turn off off-road mode to get back on your wheels, or\n  in the worst case start a showtime session.\n\n- If you enter a junk yard with off-road mode turned on, you could end up\n  inside the junk yard with no way to get out. Showtime or crashing might\n  get you out, if you're lucky. Alternatively you could use the WTR with\n  zero gravity to get you out.\n\n- It takes a while to toggle stealth mode. The player names above vehicles\n  appear/disappear right away, but the patching to map marker graphics can\n  take a few seconds. When completed the vehicle editor will show &quot;Off!&quot; or\n  &quot;On!&quot; instead of the normal &quot;Off&quot; or &quot;On&quot;. Depending on your graphics card\n  you might have to ALT+TAB out of the game and back into the game for the\n  map markers to pick up the change. Some testers have reported that the\n  map markers never disappear.\n\n- The new takedown battle challenges has a few known side effects.\n\n  If the host does not have the Vanity Pack, Vanity Pack players will be able\n  to complete their part of the host's billboard smashing challenge by\n  performing a single takedown in the area mentioned in the takedown challenge,\n  i.e. Palm Bay Heights or Downtown Paradise.\n\n  If the host does have the Vanity Pack, players without the Vanity Pack\n  might not be able to complete their part of the host's takedown challenge\n  regardless if they smash billboards or get takedowns in or outside of the\n  area mentioned in the takedown challenge.\n\n  There is currently no automatic syncing of stealth mode setting between\n  players. Please follow the host's direction on whether or not to turn\n  stealth mode and/or traffic on or off in order to make the game play fair\n  to everyone.\n\n- If you drive the Hydros Micromania Custom, or even display it in the junk\n  yard, while in an online room the game might crash for people who doesn't\n  have Vanity Pack installed. Please don't abuse this.\n  An obvious solution is to have all your friends install Vanity Pack.\n  A workaround solution is to quickly scroll past the Micromania icon in the\n  junk yard without letting it drop down for display.\n\n- If you have a non-ASCII character in your Windows user name, such that the\n  path to your savegame folder contains it, Vanity Pack might not play nice.\n  A possible, untested, solution could be to use junction.exe from Microsoft\n  to create a junction to the savegame folder and use that path in Vanity Pack.\n\n- If you close the game before Vanity Pack at the end of your gaming session,\n  you might get an error message output in the vanity.log file. This is normal.\n\n\nVersion Log\n-----------\n\n1.0 (Ant) - Initial release\n\n1.1 (Ant) - Windows XP installation fix\n            More robust dynamic vehicle list lookup\n            Improved Steam support\n            Minor defect fixes\n\n1.2 (Ant) - Fixed defect in Bike patch (it should be working properly now)\n            Added four new community finishes\n             * Hunter Racing Oval Champ - Party mod by Mr_bingley\n             * Hunter Civilian - Taxi mod by RichOG007\n             * Carson GT Concept - Punisher mod by RichOG007\n             * Hunter Reliable Custom - No Vinyl mod by RichOG007\n            Updated junk yard ratings and boost types for pedestrian vehicles\n            Enhanced wheel/color/boost/fusion editor (still in beta testing)\n            Restored original game graphics\n            Minor defect fixes\n\n1.3 (Ant) - Enhanced vehicle editor UI\n            Enhanced vehicle editor with additional features\n            Created contact sheet with all wheels\n            Added new community finishes\n             * Hunter Oval Champ 69 - Hunter mod by ouerbacker            \n             * Hunter Civilian - Microsoft mod by hazard96 (replacing Taxi mod by RichOG007)\n             * Carson Annihilator - Muscle mod by ouerbacker\n             * Carson Fastback Special - Sporty mod by ouerbacker\n             * Jansen P12 - mod by udreamibuild\n             * Kitano Touge Criterion - Vanity Pack mod by Mr_bingley\n            The Vanity Pack now creates a backup of the savegame on every run\n            Reduced new Vanity Pack size by almost half using patching\n            Added error trapping and logging to aid bug fixing\n            Minor defect fixes\n\n1.4 (Ant) - Added new community finish\n           * Watson Burnout Roadster - Burnout Hints mod by Mr_bingley\n           Flames and Hovering\n           Minor defect fixes\n\n1.5 (Ant) - Offroad Mode (experimental)\n            Stealth Mode (experimental)\n            Takedown Battle Freeburn Challenges\n            Improved Steam support\n            Added new community finish\n            * Carson Annihilator Phoenix - General Lee mod by ouerbacker\n","torrent":{"xt":"urn:btih:0829e021474a804e8b1fee0e56d7bc22fefc4773","amp;dn":"Burnout+Paradise+Vanity+Pack++1.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0829e021474a804e8b1fee0e56d7bc22fefc4773","infoHashBuffer":{"type":"Buffer","data":[8,41,224,33,71,74,128,78,139,31,238,14,86,215,188,34,254,252,71,115]},"announce":[],"urlList":[]}}