{"title":"Sea Patrol - 2x12 - Friends Close Enemies Closer","uid":4256054,"size":366604347,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:09b9900af0cdec0285fe7c9f38d371455ac9ec86&amp;dn=Sea+Patrol+-+2x12+-+Friends+Close+Enemies+Closer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":2,"time":1214248895,"description":"This is in English.\n\nIf you love this show as much as me, please give it a great rateing on Internet Movie Database &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0879688/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0879688/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://us.vdc.imdb.com/title/tt1058684/usercomments&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://us.vdc.imdb.com/title/tt1058684/usercomments&lt;/a&gt;\n\nTwenty-four sailors from every walk of life, of every age and temperament, living literally cheek-by-jowl for week after week, away from family and friends sometimes for months at a time. All crammed in an elderly 40 metre metal hulled boat - in seas of all conditions with temperatures often in the 30&amp;#039;s.\n\nSea Patrol is about adventures that forge deep and lasting friendships. Blue skies, white sands, throbbing motors and star filled nights. The smell of diesel in the morning and the splash of trailing dolphins or whales.\n\n\nAn Australian navy ship does a sea patrol of Australian waters in order to find problems and terrors in the 21st century. The ships crew is mainly populated by young-ish white Australian looking men.\n\nThe series was a very refreshing fish out of water when it first appeared on Australian television in July 2007. After decades of police dramas, hospital dramas, soap operas and TV movies about crime, at last we were getting something that felt more important...and we all knew it was more expensive! Long before that July episode aired, Sea Patrol was a big talking point in the Oz media. Before that first episode aired, we all knew that about 100 countries had bought the series. That was big news. The navy talk is partly what made it a fish out of water...all the yes sir, no sir stuff was very formal for 2007 Australian television. But being formal is not a bad thing, in fact, maybe Australia needs it? The opening episode TV ratings seem to suggest we do need it.\n\nOver the decades Australians have watched many movies/TV shows about the military, my personal favourite is 35 years of Voyage to the Bottom of the Sea re-runs, but seeing an Aussie navy show is another thing all together. The most striking image of episode one was when a large Aussie flag blows in the wind on the deck of the ship. Any true Aussie must have felt good when looking at that. Am I wrong?\n\nMy second favourite moment was when seaman Spider goes off-shore to the island and comes across some true blue Aussies. At that point in the episode we needed some Aussie-ness as all that came before it was a bit too formal. Episode one was a bit too busy for its own good. As all first episodes do, it was trying so hard to sell everything about the series to everybody. Thankfully, episode two calms down a bit and we get into the guts of the series. The crew. And what a great crew they are. The casting is first class. However, one viewer compained that the crew were all white Australians and that this is not a true image of Australia in 2007. You can make of that what you will?\n\nOther viewers have complained that series is not by the book navy enough. I guess this might be an issue to some? However, I have already stated that TVs Voyage to the Bottom of the Sea is my favourite screen view of the military. If you are old enough to know Voyage to the Bottom of the Sea, you will know that not going by the book can be more fun to watch...bring on the explosions! It is early days yet, and this positive review is being done at a time when the series is still so very new to me, maybe being so new is partly what makes it so good, then again, maybe this is the start of a really special Australian series. Thank you.","torrent":{"xt":"urn:btih:09b9900af0cdec0285fe7c9f38d371455ac9ec86","amp;dn":"Sea+Patrol+-+2x12+-+Friends+Close+Enemies+Closer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09b9900af0cdec0285fe7c9f38d371455ac9ec86","infoHashBuffer":{"type":"Buffer","data":[9,185,144,10,240,205,236,2,133,254,124,159,56,211,113,69,90,201,236,134]},"announce":[],"urlList":[]}}