{"title":"Redout","uid":15800891,"size":5931570740,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0ab2bc40e042784b0a3e8ec3c95b5b2d5539fe8b&amp;dn=Redout&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AtoWolf","files":3,"time":1473501407,"description":"NEXT GENERATION AG RACING IS HERE! \r\nRedout is a tribute to the old racing monsters such as F-Zero, WipeOut, Rollcage, and POD. It is designed to be an uncompromising, fast, tough and satisfying driving experience, soaked in that vertigo that stands at the core of the arcade racing genre. The floating system and driving models are based on physics: each turn, slope, hard braking, acceleration, each turn and twist of the track will apply a unique force to the ship. A sharp low-polygon style blends meshes and terrains with the latest state-of-the-art shading and lighting effects provided by the Unreal Engine 4, creating beautiful and instantly recognisable aesthetics. Breezy coastlines, eerie frozen landscapes, vast desert plains: the melancholic, dystopian atmosphere of a semi abandoned Earth is the background for the most high-speed, tense and beautiful futuristic racing clashes.\r\nFeatures\r\nOnline multiplayer - match against 12 players around the world for a real challenge \r\nOptional VR Support - Oculus Rift, HTC Vive or OSVR. \r\nCareer mode - 75+ events to race, experience, level up and upgrade your ship \r\nA Diverse World - 20 tracks scattered around 4 locations on a post-apocalyptic Earth, plus boss circuits \r\nNever bored - 7 event types, from classic Race to innovative Arena Race and Score-Based Endurance \r\nCreate your story - 6 racing teams, each requiring a different driving approach, and 4 increasingly fast racing classes \r\nPowerup - 10+ racing-focused, upgradable powerups: additional turbo, shields, self-repair drone, advanced grip system, slipstream enhancers, and more \r\nMusic for your ears - full 5.1 support and a dynamic soundtrack that will drop sicker and sicker beats the faster you go!\r\nSistema operativo: Windows 7 \r\nProcessore: i3 2.6Ghz \r\nMemoria: 4 GB di RAM \r\nScheda video: GTX 560 or equivalent \r\nDirectX: Versione 11 \r\nMemoria: 6 GB di spazio disponibile\r\nCONSIGLIATI: \r\nSistema operativo: Windows 10 \r\nProcessore: i5 2.6Ghz \r\nMemoria: 8 GB di RAM \r\nScheda video: GTX 960 or equivalent \r\nDirectX: Versione 11 \r\nMemoria: 6 GB di spazio disponibile","torrent":{"xt":"urn:btih:0ab2bc40e042784b0a3e8ec3c95b5b2d5539fe8b","amp;dn":"Redout","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ab2bc40e042784b0a3e8ec3c95b5b2d5539fe8b","infoHashBuffer":{"type":"Buffer","data":[10,178,188,64,224,66,120,75,10,62,142,195,201,91,91,45,85,57,254,139]},"announce":[],"urlList":[]}}