{"title":"Directory Lister","uid":4406068,"size":514489,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0aeb328a679a61587c8dc7433162cce5226931f5&amp;dn=Directory+Lister&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xCabbiex","files":4,"time":1221954842,"description":"Have you ever wanted to get a track listing from a music folder for a torrent description?, did you have to type it all in by hand?\n\nWell, here&amp;#039;s the solution...........\n     \nDirectory Lister allows you to print file list, that is to create and then save, print or send via e-mail listings of files from selected folders on hard disks, cd-roms, dvd-roms, floppys, USB storages and network shares. Listing can be in HTML, text or CSV format (for easy import to Excel).\n\nWhat columns you can include when you print a files list?\n\nWhen you print a file list, you can include standard file information like file name, extension, type, owner and attributes as well as executable file information (EXE, DLL, OCX) like file version, description, company.\nAlso multimedia properties (MP3, AVI, WAV, JPG, GIF, BMP) like track, title, artist, album, genre, video format, bits per pixel, frames per second, audio format, bits per channel can be listed.\nAnother set of columns you can print is for Microsoft Office files (DOC, XLS, PPT) so you can see document title, author, keywords etc. without opening these files one after another.\nFor each file it is also possible to obtain its CRC32, MD5 and SHA-1 hash number so you can verify the file has not been modified.\n\n\nPrint files in folder - further customization\n\nExtensive number of options allows you to completely customize the visual look of the output, so you can change sorting, column order, display format, create links to files and change HTML styles.\nYou can limit the list file by applying a filter for filename, date, size or attributes.\nDirectory Lister can also be integrated into the context menu of Windows Explorer so you don&amp;#039;t even need to open the application to generate listings.\nCommand line interface is supported for automated listings that can be run from Windows Task Scheduler.\n\nLanguages\n\nChinese (PRC)\nDeutsch\nEnglish\nEspanol\nFrancais\nHungarian\nItaliano\nNederlands\nPolski\nPortugese (Brasil)\nRusski\nSvenska\nTurkce\n\nSystem requirements\n\nDirectory Lister works on Windows 95, Windows 98, Windows ME, Windows NT, Windows 2000, Windows XP and Windows Vista operating systems.\n","torrent":{"xt":"urn:btih:0aeb328a679a61587c8dc7433162cce5226931f5","amp;dn":"Directory+Lister","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aeb328a679a61587c8dc7433162cce5226931f5","infoHashBuffer":{"type":"Buffer","data":[10,235,50,138,103,154,97,88,124,141,199,67,49,98,204,229,34,105,49,245]},"announce":[],"urlList":[]}}