{"title":"Black Cat The (Boris Karloff, Bela Lugos) [1943] !@ .avi","uid":4743737,"size":429996740,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0bc176b410c59456b1af6bc4cf28bf9c4d327dbb&amp;dn=Black+Cat+The+%28Boris+Karloff%2C+Bela+Lugos%29+%5B1943%5D+%21%40+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":1,"time":1235693717,"description":"Boris Karloff\t ... \tHjalmar Poelzig (as Karloff)\n\n\tBela Lugosi\t... \tDr. Vitus Werdegast\n\tDavid Manners\t... \tPeter Alison\n\tJulie Bishop\t... \tJoan Alison (as Jacqueline Wells)\n\tEgon Brecher\t... \tThe Majordomo\n\tHarry Cording\t... \tThamal, Werdegast's Servant\n\nhe Black Cat is, quite simply, a horror masterpiece. Almost everything about this film is perfect. I'm not going to go into detail on the story, because if you haven't seen it, you should.\n\nThe acting is some of the best you'll ever see in a horror film. Lugosi is at the top of his game. His portrayal of Ygor in Son of Frankenstein may be Lugosi's only better performance. Karloff is wonderfully creepy and mysterious (and has some of the most bizarre hair I've ever seen). Seeing the two work together in The Black Cat is a real pleasure. Although Karloff gets top billing, this is Lugosi's film and he makes the most of it. David Manners and the rest of the cast are more than adequate.\n\nThe futuristic house in which the film is set is a departure from the more Gothic, Victorian settings of most of the Universal films. And it works. Thanks to some terrific set design, lighting, and cinematography, the modern house exudes as much atmosphere as any old castle, dungeon, tower, etc.\n\nThe Black Cat contains some of the most unsettling scenes of any classic Universal horror film. It is, IMO, the darkest of any of these films. I just wonder how it was viewed by audiences in 1934. Two scenes that immediately come to mind are the black mass performed by Karloff and the torture scene at the end of the film. These scenes are not typical of the Universal classics. They have the power to stick with you long after the movie is over.\n\nBut what I really like is the way the story unfolds. At the beginning, you know nothing of what's really going on. Bit by bit, the story unfolds. Many of the plot points are revealed by Lugosi. In fact, if it weren't for Lugosi's monologues, I wonder if anyone would have any idea of what was taking place. ","torrent":{"xt":"urn:btih:0bc176b410c59456b1af6bc4cf28bf9c4d327dbb","amp;dn":"Black+Cat+The+%28Boris+Karloff%2C+Bela+Lugos%29+%5B1943%5D+%21%40+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bc176b410c59456b1af6bc4cf28bf9c4d327dbb","infoHashBuffer":{"type":"Buffer","data":[11,193,118,180,16,197,148,86,177,175,107,196,207,40,191,156,77,50,125,187]},"announce":[],"urlList":[]}}