{"title":"Clockwerx 01-02","uid":8866103,"size":298262876,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0db69e6c85afe7569886f7c166e474b4de86b666&amp;dn=Clockwerx+01-02&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1377910361,"description":"London, 1899. A series of mysterious deaths on the shipping docks have an ex-Scotland Yard officer on the hunt for clues. What he uncovers is a war between a huge corporation and a renegade group of individuals, with both parties fighting for a powerful new energy source.\n\nWriters Jason Henderson and Tony Salvaggio &amp; Izu and artist Jean-Baptiste Hostache, set Clockerwerx in a turn of the century London where the steampunk technology is only in the hands of the wealthiest and is kept hidden from the common man. The technology has been developed into giant mecha, of clocks which are being used to dig for a rare substance known as Lucifernium which holds the potential for great good, or limitless evil. That kind of power, in the hands of just a few individuals, is what drove Molly Vane and her crew of clock pilots to step in and try to keep the it away from those who would use it for their own nefarious plans. Vane is joined by disgraced Scotland Yard detective, Matt Thurow, who has his own vendetta against the mysterious Lord Oak and his power cabal, the Golden Shell.\n\nThe political machinations and the interpersonal relationships drive the Clockwerx story forward. It plays out in an enjoyable, Mission Impossible style scenario where the team of all that is right and good (but operating against the wishes of those in power) goes up against a scheming mastermind who seeks to upend the world and come out on top. This scenario could play out in almost any era and any genre, but Clockwerx is a steampunk tale, and that means clunky, shiny technology!\n\nAs enjoyable as the plotting and scheming is, nothing can hold a candle to the thrill that runs down the spine the first time the clocks are revealed in their full glory. Like a cross between an early dive suit and a futuristic Japanese mecha, Hostaches design for the clocks is stunning. I was stopped in my tracks the first time I saw them, and found myself returning to them time and time again as I looked through the book.\n\nWhat makes them even more special is that they are used so infrequently. They show up in only a few pages, making them more formidable and intimidating by their absence. They must be something special if they are only to be used in the most desperate of times.\n\nIt is easy for writers and artists to focus on the technology when creating a steampunk graphic novel. The writers desperately want to prove that their steampunk world is eve more awesome than the one which the last writer created. And artists love to create intricate brass nozzles, pipes, and gauges and attach them to almost everything. That is why it is so refreshing to read a book where the people are the focus of the story, and the technology is used sparingly, but to great effect.\n\nHostaches line work is commendable, particularly in his settings and backdrops. His lines are tight and fine, allowing for striking detail. This is especially apparent in the backmatter section of the book which shows examples of his un-colored pencils, as well as some of his designs for characters and locations.\n\nThere are a few problems with Clockwerx. There is a bit of a plot hole in the early part of the book where it is never fully explained why a giant clock is used in a relatively mundane manner. It does give the reader a sense of the power and destruction of which they are capable, but it was like using a canon when a fly-swatter would do.\n\nAlso, Hostache appeared to have difficulties keeping his faces consistent. There were a couple of characters in Vanes crew who were particularly difficult to make out as their faces kept on shifting from panel to panel. And, given that Henderson, Salvaggio, and Izu were giving so much information for the reader to keep track of, it quickly became almost impossible to make heads or tails of many of the secondary characters.\n\nBut that is all peripheral stuff. The core of the book is solid. The main characters are well-rounded, the plot is engrossing, and the art is fantastic.\n\nClockwerx rewards multiple readings. There is a lot of information given, names dropped, and relations hinted at, which are not fully explained until much later in the book. Once the full story has been told, it is good to go back again and pick up all the details which were missed along the way.\n\nThe book ends unresolved in much the same way that the great spy capers end with a question mark. Is that really the end of the threat? Did the heroes truly save the day? There is no indication if there is a second installment of Clockwerx on the way. However, given the strength of the story and the power of the visuals, we can only hope that Molly Vane and her crew will return soon.\n\ncbr format\n\n","torrent":{"xt":"urn:btih:0db69e6c85afe7569886f7c166e474b4de86b666","amp;dn":"Clockwerx+01-02","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0db69e6c85afe7569886f7c166e474b4de86b666","infoHashBuffer":{"type":"Buffer","data":[13,182,158,108,133,175,231,86,152,134,247,193,102,228,116,180,222,134,182,102]},"announce":[],"urlList":[]}}