{"title":"UpdateStar Password Finder v7.0.0.21","uid":15447605,"size":4733974,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0fd543d48f83681502613002ccb67715589cfb80&amp;dn=UpdateStar+Password+Finder+v7.0.0.21&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LxByte","files":1,"time":1469907777,"description":"UpdateStar Password Finder v7.0.0.21\r\n\r\nRecover hidden passwords for software programs\r\nWhy UpdateStar Password Finder? Because losing passwords is an annoying experience!\r\n \r\nSupports user name and password recovery and backup for more than one hundred software programs. Scans local and network computers without installation.\r\n\r\nWhy you should try Password Finder\r\nPassword Finder helps you to search and find passwords, user names and other related information stored and hidden on your local computers or remote network computers. Because losing passwords is a very annoying experience, Password Finder finds and exports this important information for you. Password Finder supports scanning of local computers as well as remote network computers and allows you to scan multiple computers at the same time. You can export or print the information from within Password Finder and store it in a safe place for backup reasons. Password Finder is typically being used by home users as well as corporate admins.\r\n\r\nNo more wasted time trying to find password information manually \r\n\r\nNo more frustrations caused by lost password information\r\n\r\nNo more need to become a computer expert to find hidden passwords on your computer \r\n\r\nNo need to reconfigure software products\r\nSearch and find password information the smart way\r\nUpdateStar Password Finder analyzes your computer and searches for stored passwords. Our database currently supports 108 vendors and software products. It detects which passwords and related information is hidden on your computer and collects that information. Thanks to Password Finder you can export and backup this valuable information.\r\nTop reasons why our users use Password Finder\r\nEasy to use interface scans, collects, displays and exports password and related information\r\n\r\nAccurately searches for password information on your local computer and network computers\r\n\r\nNEW! The database now supports 108 software vendors and products including web-browsers, instant messengers, email clients, FTP clients, etc.\r\n\r\nNEW! Scan multiple remote computers at the same time\r\n\r\nDatabase gets updated frequently and additional password definitions are being added\r\n\r\nOfficial Website: http://client.updatestar.com/en/passwordfinder/overview/","torrent":{"xt":"urn:btih:0fd543d48f83681502613002ccb67715589cfb80","amp;dn":"UpdateStar+Password+Finder+v7.0.0.21","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fd543d48f83681502613002ccb67715589cfb80","infoHashBuffer":{"type":"Buffer","data":[15,213,67,212,143,131,104,21,2,97,48,2,204,182,119,21,88,156,251,128]},"announce":[],"urlList":[]}}