{"title":"Archer and Armstrong V1 ","uid":7565364,"size":71648797,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0fe3cb0a81f66f5b47afc52fae29499a61f247c1&amp;dn=Archer+and+Armstrong+V1+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1345848172,"description":"Issues 00-12 of 'Archer &amp; Armstrong' Vol 1\nValiant Comics, 1992-199? (Early 90s)\n\nPeople involved include, but are not limited to: Jim Shooter, Barry Windsor-Smith, Rodney Ramos, Bob Layton, Bernard Chang, John Floyd and more\n\n\nArcher &amp; Armstrong are the title characters of the popular comic book series published by Valiant Comics.\n\nAmong the most commercially and critically acclaimed buddy comedies in comics, Archer &amp; Armstrong featured writing and art by comic legend Barry Windsor-Smith. After Acclaim Entertainment purchased the rights to the Valiant Character Catalog for $65 million in 1994, the characters continued to appear in many Valiant titles, most prominently in the Eternal Warriors series. Acclaim rebooted the Archer &amp; Armstrong characters to make them more easily adaptable to video games as they are a video game developer and distributor. Valiant Entertainment is the current owner of the Valiant catalog (including Archer &amp; Armstrong). Archer &amp; Armstrong is one of the best selling Valiant titles with total sales in all languages of over 4 million comics and counting.\n\nArcher &amp; Armstrong has been called &quot;The best buddy team book of all time.&quot; by Ain't It Cool News, and &quot;Superhero buddy book of the decade&quot; by Wizard Magazine. Ain't It Cool News also said that &quot;Not since Batman &amp; Robin has a more important duo hit the comic world.&quot;\n\nIn 2008, Valiant released a deluxe hardcover of the Archer &amp; Armstrong origin story, entitled Archer &amp; Armstrong: First Impressions. The hardcover was later named one of the top ten graphic novels of 2008 by Diamond Comic Distributors and one of the best of 2008 by Ain't It Cool News.\n\nValiant Entertainment has confirmed that Archer &amp; Armstrong will star in a new ongoing comic series written by Fred Van Lente and illustrated by Clayton Henry in August 2012.\n\n----------------------------------------------------------------------------\n\nIssue 1 of the Valiant re-boot can be found right here...\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7514903/ARCHER_AND_ARMSTRONG___01&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7514903/ARCHER_AND_ARMSTRONG___01&lt;/a&gt;","torrent":{"xt":"urn:btih:0fe3cb0a81f66f5b47afc52fae29499a61f247c1","amp;dn":"Archer+and+Armstrong+V1+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fe3cb0a81f66f5b47afc52fae29499a61f247c1","infoHashBuffer":{"type":"Buffer","data":[15,227,203,10,129,246,111,91,71,175,197,47,174,41,73,154,97,242,71,193]},"announce":[],"urlList":[]}}