{"title":"Ashanti - Good Good","uid":4372793,"size":134166532,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:111b0497868b79ed137f162ee757ee896a665d87&amp;dn=Ashanti+-+Good+Good&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1220248162,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\nBy mistake I deleted the torrent of Ashanti - Good Good that I uploaded yesterday so this is a new upload of the same video.\n\n\n&quot;Good Good&quot; is the second single for American singer Ashanti&amp;#039;s album &quot;The Declaration&quot;.\n\nThe music video was premiered in Yahoo Music and BET in July 17. It was directed by Melina. The video features an appearance by the rapper Nelly palying one of the leading roles as Ashanti&amp;#039;s man in the video. Ashanti described the video as &quot;reality vs. fantasy vs. pin up. It&amp;#039;s basically just saying that to keep your man, you know, you got the good-good, you look sexy, and your still cleaning the house with your high-heels and your shades and your diamonds! (Laughs)&quot; \n\nThe video starts with some scenes shows an ice-cream, a cake, a milk&amp;#039;s bottle and a drink. Then Ashanti is seen and subsequently there are still scenes shows some Cookbooks, a beer and finally appears Nelly, in a courtyard of an house. In the courtyard Ashanti before takes the milk and then she greets Nelly. On the background of the video, also appear some writings that show sometimes the words &quot;Good Good&quot;, or &quot;Wooooooooooh&quot; and also &quot;Ahhh&quot; and &quot;Uhhh&quot;. Two times also appears the word &quot;Right Here&quot; with an arrows. In the video Ashanti playing her alter egos. Before she is a wife (the Nelly&amp;#039;s wife), then she is a messy cook and cleaner, then she is an idle housewife. The end of the video develops it in a food, where Ashanti shops. The video ends with Ashanti kisses Nelly.\n\nThe song debuted at #9 on BET&amp;#039;s 106 &amp; Park then jumped 2 spots to # 7 it&amp;#039;s second day and has so far peaked at #5. The official Universal video to &quot;Good Good&quot; received 1,000,000 views on YouTube in its first Two weeks. The video has so far peaked at #4 on i-Tunes Top R&amp;B Music Video chart.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:111b0497868b79ed137f162ee757ee896a665d87","amp;dn":"Ashanti+-+Good+Good","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"111b0497868b79ed137f162ee757ee896a665d87","infoHashBuffer":{"type":"Buffer","data":[17,27,4,151,134,139,121,237,19,127,22,46,231,87,238,137,106,102,93,135]},"announce":[],"urlList":[]}}