{"title":"ExploitedCollegeGirls Christy 720p","uid":14040886,"size":2312367724,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:1120a561ca8d09c6f11177453d7f926fe237e1d6&amp;dn=ExploitedCollegeGirls+Christy+720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"distinc","files":1,"time":1459019864,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=4767895727\r\n \nhttp://imagedisco.net/?g=6239078669\r\n\r\n\r\n\r\nDescription:\r\n\r\nChristy   \r\nAge: 18\r\nHeight: 5'6&quot;\r\nFigure:32B-24-34\r\nEyes: Brown\r\nLikes: Working out, Party games.\r\n\r\nABOUT\r\n\r\nBlonde, slim Christy is the perfect Ex Co Gi first timer. She's cute, shy, just turned 18 and loves sex. She starts off a little nervous, but she quickly gets into things and when Jay starts paying attention to her bod, she manages to orgasm over and over. Of course she also manages to orgasm so quietly that Jay could have shot this in a public library. That aside, she's got a fantastic, fit little body with surprisingly perky tits for a skinny girl and is a bit of a freak in the sheets.\r\n\r\nDuring the interview Christy is definitely a little nervous, but what 18 year old wouldn't be while prepping for her very first porn shoot? Now she may be new to porn but she's certainly not new to sex and shares a number of risque stories with Jay as she gets settled in. From lesbian games of truth or dare to banging her dude in a hospital room (doesn't really seem that sexy, but who would turn down an 18 year old nympho?) she's tried a little bit of everything in her short sex life.\r\n\r\nAfter Christy strips, Jay gets down to business with his fingers and a pair of vibrators. She definitely has some experience with vibrators and in no time at all she lays back into a quiet, intense orgasm that she and Jay work together on. Jay directs her to the floor and she demonstrates surprisingly advanced beej skills for an 18 year old, really laying on both the tongue action, the hand motion and the eye contact.\r\n\r\nAfter fucking Christy in every position he can think of and leading her through several more quiet orgasms in doggy and from the side, Jay directs her back to the floor to unleash a huge, gooey load on her face. Which, oddly, takes her totally by surprise. As a self confessed porn watcher, we really feel like Christy should know how these things tend to end, but maybe that's what happens when all of your bookmarks are girl on girl action","torrent":{"xt":"urn:btih:1120a561ca8d09c6f11177453d7f926fe237e1d6","amp;dn":"ExploitedCollegeGirls+Christy+720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1120a561ca8d09c6f11177453d7f926fe237e1d6","infoHashBuffer":{"type":"Buffer","data":[17,32,165,97,202,141,9,198,241,17,119,69,61,127,146,111,226,55,225,214]},"announce":[],"urlList":[]}}