{"title":"blah blah blah What to do when words don't work Dan Roam","uid":7528758,"size":7597457,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:11875661cc8d2effa6efbaa465eb2baac386a152&amp;dn=blah+blah+blah+What+to+do+when+words+don%27t+work+Dan+Roam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"whichevernonanonymous","files":1,"time":1344868306,"description":"Ever been to so many meetings that you couldn't get your work done? Ever fallen asleep during a bulletpoint presentation? Ever watched the news and ended up knowing less? Welcome to the land of Blah Blah Blah.\n\nThe Problem: We talk so much that we don't think very well. Powerful as words are, we fool ourselves when we think our words alone can detect, describe, and defuse the multifaceted problems of today. They can't-and that's bad, because words have become our default thinking tool.\n\nThe Solution: This book offers a way out of blah-blah-blah. It's called &quot;Vivid Thinking.&quot;\n\nIn Dan Roam's first acclaimed book, The Back of the Napkin, he taught readers how to solve problems and sell ideas by drawing simple pictures. Now he proves that Vivid Thinking is even more powerful. This technique combines our verbal and visual minds so that we can think and learn more quickly, teach and inspire our colleagues, and enjoy and share ideas in a whole new way.\n\nThe Destination: No more blah-blah-blah. Through Vivid Thinking, we can make the most complicated subjects suddenly crystal clear. Whether trying to understand a Harvard Business School class, or what went down in the Conan versus Leno battle for late-night TV, or what Einstein thought about relativity, Vivid Thinking provides a way to clarify anything.\n\nThrough dozens of guided examples, Roam proves that anyone can apply this systematic approach, from leftbrain types who hate to draw to right-brainers who hate to write. This isn't just a book about improving communications, presentations, and ideation; it's about removing the blah-blah- blah from your life for good.\n","torrent":{"xt":"urn:btih:11875661cc8d2effa6efbaa465eb2baac386a152","amp;dn":"blah+blah+blah+What+to+do+when+words+don%27t+work+Dan+Roam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11875661cc8d2effa6efbaa465eb2baac386a152","infoHashBuffer":{"type":"Buffer","data":[17,135,86,97,204,141,46,255,166,239,186,164,101,235,43,170,195,134,161,82]},"announce":[],"urlList":[]}}