{"title":"Columbo - Seasons 11 and 12","uid":14563889,"size":6979164007,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1194b68d433e860cf28b4540e44629b8fe47cc23&amp;dn=Columbo+-+Seasons+11+and+12&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"POtHS11","files":24,"time":1462754195,"description":"Columbo - Seasons 11 and 12\r\n\r\n[image=Xmg2REBlnw]\r\n\r\n\r\nDeath Hits the Jackpot\r\nFreddy, a down-on-his-luck photographer in the final stages of a divorce, wins $30 million in the lottery. In order to not share it with his wife before the divorce is finalized, he arranges for his uncle Leon to cash in the ticket and give Freddy the money after the divorce. But Uncle Leon has ideas of his own...\r\nOn Disc \r\nat Amazon\r\n \r\n No Time to Die S11, Ep2\r\n15 Mar. 1992 No Time to Die\r\nColumbo attends the wedding of his nephew, who is also with the LAPD. Suddenly it turns out that the bride is missing, possibly kidnapped. Columbo sets up the investigation to figure out what happened.\r\nOn Disc \r\nat Amazon\r\n \r\n A Bird in the Hand... S11, Ep3\r\n22 Nov. 1992 A Bird in the Hand...\r\nHarold likes to gamble, but as a rule he loses and he is heavily in debt. His uncle is the famous Big Fred who is the owner of a football team and he is a millionaire. But Harold can't get a dime from him. So Harold decides to kill his uncle by a pipe bomb under his car. He is not surprised when he is told Big Fred is dead. He is surprised however that the death is due to a road accident. He rushes to his uncle's house and he finds Lt. Columbo getting excited about the car with the bomb...\r\n\r\nIt's All in the Game\r\nLauren Staton and Lisa Martin kill their two-timing lover Nick Franco. Lauren's the one who pulled the trigger and they've made it look like Franco was killed by a burglar in his apartment. They've prepared well with both having solid alibis. Lt. Colombo is in charge of the case and is very much attracted to the beautiful Lauren. She uses that to her advantage and is soon buying him gifts and giving him the odd kiss. Colombo is flattered but begins to see anomalies in some of the physical evidence. He becomes certain that Laura is involved in Franco's death but ...\r\nOn Disc \r\nat Amazon\r\n \r\n Butterfly in Shades of Grey S12, Ep2\r\n10 Jan. 1994 Butterfly in Shades of Grey\r\nL.A. radio moderator Chase kills Jerry Winters, a member of his staff who tried to help Chase's daughter Victoria (also a staff member) to leave her father and become a novelist in New York. Chase presents a fine alibi: Winters was shot dead while speaking to him on the phone, even the shooting was recorded on his answering machine. Everything seems perfect, but will Lt. Columbo really believe this story?\r\nOn Disc \r\nat Amazon\r\n \r\n Undercover S12, Ep3\r\n2 May 1994 Undercover\r\nLt Columbo investigates men and women who are being killed over pieces of a photo they have, that shows where 4 million dollars in stolen money is hidden","torrent":{"xt":"urn:btih:1194b68d433e860cf28b4540e44629b8fe47cc23","amp;dn":"Columbo+-+Seasons+11+and+12","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1194b68d433e860cf28b4540e44629b8fe47cc23","infoHashBuffer":{"type":"Buffer","data":[17,148,182,141,67,62,134,12,242,139,69,64,228,70,41,184,254,71,204,35]},"announce":[],"urlList":[]}}