{"title":"Confronting the Internet's Dark Side - Raphael Cohen-Almagor","uid":12093496,"size":826563,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11e2d0ed4c4c9bab11bc1331cecf1f0310088ad8&amp;dn=Confronting+the+Internet%27s+Dark+Side+-+Raphael+Cohen-Almagor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1436108802,"description":"Terrorism, cyberbullying, child pornography, hate speech, cybercrime: along with unprecedented advancements in productivity and engagement, the Internet has ushered in a space for violent, hateful, and antisocial behavior. How do we, as individuals and as a society, protect against dangerous expressions online? Confronting the Internet's Dark Side is the first book on social responsibility on the Internet. It aims to strike a balance between the free speech principle and the responsibilities of the individual, corporation, state, and the international community. This book brings a global perspective to the analysis of some of the most troubling uses of the Internet. It urges net users, ISPs, and liberal democracies to weigh freedom and security, finding the golden mean between unlimited license and moral responsibility. This judgment is necessary to uphold the very liberal democratic values that gave rise to the Internet and that are threatened by an unbridled use of technology","torrent":{"xt":"urn:btih:11e2d0ed4c4c9bab11bc1331cecf1f0310088ad8","amp;dn":"Confronting+the+Internet%27s+Dark+Side+-+Raphael+Cohen-Almagor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11e2d0ed4c4c9bab11bc1331cecf1f0310088ad8","infoHashBuffer":{"type":"Buffer","data":[17,226,208,237,76,76,155,171,17,188,19,49,206,207,31,3,16,8,138,216]},"announce":[],"urlList":[]}}