{"title":"BBC.At.Home.with.the.Georgians.2of3.A.Womans.Touch.x264.AC3..mkv","uid":7022641,"size":733420774,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:12952c1e553530c76e2d77d36ca74ed085a9df49&amp;dn=BBC.At.Home.with.the.Georgians.2of3.A.Womans.Touch.x264.AC3..mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":-1,"time":1328897217,"description":"BBC - At Home with the Georgians (2011)\n\n\n\nInformation\nAt Home with the Georgians\nPrize winning author Professor Amanda Vickery sets her sights on the golden age of homemaking - the Georgian era. Through dramatic reconstruction she traces the story of the unique relationship Britons enjoy with their homes, arguing that the Georgians' preoccupation with decor helped to redefine the part played by men and women in British society. Characters from all walks of life including gentlewomen in their stately mansions and servants with only a locking box to call their own, are brought to life as Amanda reveals the artefacts, letters and diaries of the age where the modern notion of a 'home' was born.\n\nPart 1: A Mans Place\nIn this three-part series, historian Amanda Vickery explores how the great British obsession with our homes began 300 years ago. Using the intimate diaries and letters of Georgian men and women, previously lost to history, she explores how the desire for a home revolutionised relationships between men and women. She uncovers some surprising truths: about the lives of spinsters and bachelors; about how the home became crucial to the success or otherwise of a marriage; and, perhaps the biggest surprise of all, that setting up home in the 18th century was not driven by women (as you might expect) but by men.\n\n\nPart 2: A Womans Touch\nThe British obsession with beautifying our homes is not a new phenomenon - it began with a vengeance in the Georgian era. In this second programme of the series historian Amanda Vickery - on a journey from stately home to pauper's attic - reveals how 'taste' became the buzzword of the age 300 years ago and gave women a new outlet for their creativity, raising their status in the home as a consequence. But with it came new anxieties about getting it right.\n\n\nPart 3: Safe as Houses\nIn this third part of the series about how the British obsession with our homes began 300 years ago, historian Amanda Vickery uses sources, from intimate diaries to Old Bailey records, to reveal how the 18th century home was constantly under threat from theft, fire, divorce, poverty, illness, old age and death. Georgian houses may seem like sanctuaries of calm elegance to us today, but at the time they were noisy chaotic places bursting with extended families, servants and lodgers and threatened by the lawlessness of Georgian streets. How did the Georgians make their houses havens of safety and security? How did the Englishman fight to make his home his castle?\n\n\nTechnical Specs\nVideo Codec: x264 CABAC\nVideo Bitrate: 1579 Kbps\nVideo Aspect Ratio: 1.778:1\nVideo Resolution: 832x464 (16.9)\nAudio Codec: AC3\nAudio Bitrate: 128 Kbps CBR 48KHz\nAudio Channels: 2\nRun-Time: 59mins\nFramerate: 25FPS\nNumber of Parts: 3\nPart Size: 700 MB\nSource: DVD\nEncoded by: Harry65","torrent":{"xt":"urn:btih:12952c1e553530c76e2d77d36ca74ed085a9df49","amp;dn":"BBC.At.Home.with.the.Georgians.2of3.A.Womans.Touch.x264.AC3..mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12952c1e553530c76e2d77d36ca74ed085a9df49","infoHashBuffer":{"type":"Buffer","data":[18,149,44,30,85,53,48,199,110,45,119,211,108,167,78,208,133,169,223,73]},"announce":[],"urlList":[]}}