{"title":"Kate Kray - The Twins. Men of Violence (Mobi + Epub)","uid":8215347,"size":1879657,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12d0dcb4f67d910160dd1f1c5744a8d3085fd5f2&amp;dn=Kate+Kray+-+The+Twins.+Men+of+Violence+%28Mobi+%2B+Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kevinkray","files":-1,"time":1362330325,"description":"Ron and Reg. Violent men who brought a code of honour to the streets that is still observed today. Their deaths bring to an end the golden era of gangsters whose word was law and whose ferocity maintained the order of the streets...Nobody knew the twins like Kate Kray. Married to Ron before his death, she was granted unique access into the shadowy world they inhabited, and was entrusted with some of the darkest secrets they possessed - secrets that could never be revealed until they were both dead. Now, with the help of thoughts and anecdotes from the people who knew the twins best, Kate has documented once and for all the life of the world's most famous gangsters, and filled in the gaps with the facts that could not be revealed until now. Gangsters, actors, East End faces - everyone who is anyone in the Firm is here, thanks to Kate's unique access and influence. And in this remarkable book, the Krays' chief torturer, the man who was with them on the night they were arrested, has broken his silence for the very first time.","torrent":{"xt":"urn:btih:12d0dcb4f67d910160dd1f1c5744a8d3085fd5f2","amp;dn":"Kate+Kray+-+The+Twins.+Men+of+Violence+%28Mobi+%2B+Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12d0dcb4f67d910160dd1f1c5744a8d3085fd5f2","infoHashBuffer":{"type":"Buffer","data":[18,208,220,180,246,125,145,1,96,221,31,28,87,68,168,211,8,95,213,242]},"announce":[],"urlList":[]}}