{"title":"Norman Crane - Iris (epub, mobi)","uid":10135610,"size":616003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13a8714412a44a85c9a14e6b8955d35f7d5f6b1f&amp;dn=Norman+Crane+-+Iris+%28epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1399941371,"description":"Iris is an epic science fiction book about love. It's not written by a best-selling author and it hasn't topped any sales charts. But the reason for that is simple: this torrent page doesn't exist yet.\n\nIf you can read this do not hit F5.\n\nListen to me. The next decade is going to be an exciting and hopeful time. You'll witness the birth of the eighth billion human on Earth and live through the revelation of Kurt Schwaller's theory of everything. It's important that you enjoy it, because in 2025 everything will change. I know. I lived through it. My friend Bakshi likes to say that we're locked into a single future. Iris used to say that no one can take away the past. I wish I knew what you looked like. I wish I knew then what I know now. But if Bakshi's right, at least you'll be prepared. You still have time. Between now and March 27, 2025, they'll try to tell you that a hundred different things are the most important. They'll be wrong. Live, love and imagine. And if you happen to meet Iris, go ahead and ask her about the theory. She'll blow your mind, too.\n\nHit F5.\n\nHit F5.\n\nHit F5.","torrent":{"xt":"urn:btih:13a8714412a44a85c9a14e6b8955d35f7d5f6b1f","amp;dn":"Norman+Crane+-+Iris+%28epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13a8714412a44a85c9a14e6b8955d35f7d5f6b1f","infoHashBuffer":{"type":"Buffer","data":[19,168,113,68,18,164,74,133,201,161,78,107,137,85,211,95,125,95,107,31]},"announce":[],"urlList":[]}}