{"title":"Mark R Levin - Men In Black","uid":9248307,"size":271420748,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:15e3ce47c533b351a3f40d619a3b7a1c4c7bf51a&amp;dn=Mark+R+Levin+-+Men+In+Black&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Hiecpo","files":-1,"time":1385414073,"description":"Mark R. Levin: Men in Black, How the Supreme Court Is Destroying America\n\n(2005) 167 files, 259MB, 64kbps, 7:58:08\n\nUnabridged Audio Book\n \nMark Levin throws the book at our own judicial system-in particular, American judges who ignore the Constitution and dismantle the rights of American citizens in everyday court proceedings. He shares jaw-dropping examples of judicial power grabs and liberal power plays by judges. \nThe Supreme Court Endorses Terrorists' Rights, Flag Burning, and Importing Foreign Law. \nIs that in the Constitution? \nYou're right: It's not. But these days the Constitution is no restraint on our out-of-control Supreme Court. The Court imperiously strikes down laws and imposes new ones purely on its own arbitrary whims. Even though liberals like John Kerry are repeatedly defeated at the polls, the majority on the allegedly &quot;conservative&quot; Supreme Court reflects their views and wields absolute power. There's a word for this: tyranny. In Men in Black, radio talk show host and legal scholar Mark R. Levin dissects the judicial tyranny that is robbing us of our freedoms and stuffing the ballot box in favor of liberal policies. If you've ever wondered why-no matter who holds political power-American society always seems to drift to the left, Mark Levin has the answer: the black-robed justices of the Supreme Court, subverting democracy in favor of their own liberal agenda. \n","torrent":{"xt":"urn:btih:15e3ce47c533b351a3f40d619a3b7a1c4c7bf51a","amp;dn":"Mark+R+Levin+-+Men+In+Black","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15e3ce47c533b351a3f40d619a3b7a1c4c7bf51a","infoHashBuffer":{"type":"Buffer","data":[21,227,206,71,197,51,179,81,163,244,13,97,154,59,122,28,76,123,245,26]},"announce":[],"urlList":[]}}