{"title":"Cattle King 1963 DvdRip MP4 Lee1001","uid":9828914,"size":761845368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:16369dbaff6246c7097ddc8864da78e096ece102&amp;dn=Cattle+King+1963+DvdRip+MP4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xultfoad","files":2,"time":1395809873,"description":"Cattle King 1963 DvdRip MP4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0056914/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0056914/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Cattle_King&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Cattle_King&lt;/a&gt;\nCattle King is an American western first released on 31st July 1963, directed by Tay Garnett. The film stars Robert Taylor, Robert Loggia, Joan Caulfield, Robert Middleton and Larry Gates. It has also been released under the title: Guns of Wyoming.\n\nRobert Taylor made his last stand at MGM in 1963 when he starred in Cattle King, a low-budget Western about an honest cattleman fighting to protect his land from the free grazing movement. Taylor had already gone off the studio's contract rolls in 1959, after more than 25 years there. He'd been there so long, in fact, that he was one of the few MGM actors ever to qualify for a studio pension (Clark Gable and Lewis Stone were two others#. By the '60s, he was better known as the star of television's The Detectives, but his name could still draw film audiences in smaller theatres, where Cattle King turned a tidy profit.\n \nHelping tremendously was the presence of a team of Western veterans behind the cameras. Producer Nat Holt had gotten his start in the genre in 1946 with RKO's Badman's Territory, then had moved into television with such series as Tales of Wells Fargo and Overland Trail. Writer and associate producer Thomas Thompson had worked primarily on television Westerns, scripting episodes for such acclaimed series as Rawhide, Bonanza and The Virginian. He would go on to pen best selling novels #Celebrity) and true-crime books (Serpentine#. Director Tay Garnett had helped Taylor give one of his best performances, in the World War II epic Bataan #1943#. Although he had done few big screen Westerns -- he was best known for the classic film noir The Postman Always Rings Twice #1946# -- television's inroads on movie production had sent him to the small screen. There he was a fixture on some of the series Thompson had penned.\n \nJoining Taylor on screen were a strong cast of veterans and some talented newcomers. His leading lady, Joan Caulfield, had been one of the top box office stars of the '40s in films like Blue Skies #1946) before turning to low-budget Westerns like this in a futile effort to build a new career as a character actress. She's probably best known, however, for the fact that the marquee for her film Dear Ruth (1947#, in which she co-starred with William Holden, gave J.D. Salinger the name for the protagonist of Catcher in the Rye, Holden Caulfield. Corpulent villain Robert Middleton had cornered the market on evil as the demented killer in The Desperate Hours #1955) and a murderous knight in The Court Jester (1956#. Larry Gates, who pretty much stole the film as President Chester A. Arthur, was a stage veteran who would go on to win a Daytime Emmy as oil magnate H.B. Lewis on Guiding Light.\n \nContemporary audiences may focus more on three cast members destined for bigger things. Middleton's violent henchman, Robert Loggia, would go on to become one of Hollywood's top character actors after winning an OscarÂ® nomination for Jagged Edge in 1985. William Windom, cast as Caulfield's drunken brother, was destined for television stardom on such series as The Farmer's Daughter and My World and Welcome to It. Most recognizable, however, is rancher's wife Virginia Christine, soon to achieve stardom as the Swedish-accented Mrs. Olson in a series of coffee commercials.\n \nUsing the same economy they had developed for their television work, Holt and Garnett shot Cattle King in just three weeks. Much of the filming was done on the Walker Ranch and Western Street in Kernville, Calif. The popular film location had figured in films since the silent days, most notably in John Ford's classic Stagecoach #1939). Most recently, it was used in the 2001 Kevin Spacey drama K-PAX.\n\nVIDEO\nSize.... 726mb\nDuration.... 01:24:05\nCodec....... H264\nFrame Width.... 720\nFrame Height.... 406\nData Rate.... 1042kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 160kbps\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:16369dbaff6246c7097ddc8864da78e096ece102","amp;dn":"Cattle+King+1963+DvdRip+MP4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16369dbaff6246c7097ddc8864da78e096ece102","infoHashBuffer":{"type":"Buffer","data":[22,54,157,186,255,98,70,199,9,125,220,136,100,218,120,224,150,236,225,2]},"announce":[],"urlList":[]}}