{"title":"Coast to Coast Am June 09, 2013 - The Last Battle","uid":8586554,"size":58735822,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1827ae6c19369cac5f14b40472225dd69ce3aa2d&amp;dn=Coast+to+Coast+Am+June+09%2C+2013+-+The+Last+Battle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1371545701,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-09-13\nHost:\nIan Punnett\nGuests:\nStephen  Harding,             Margaret  Barker,                   Howard  Bloom\nIan Punnett was joined by journalist specializing in military affairs, Stephen Harding, for a discussion on how U.S. and German soldiers joined forces in the waning hours of World War II. He explained that this unlikely collaboration was forged in an effort to save high value French prisoners that were being held captive by the Nazis in an Austrian castle. Originally to be used as hostages or pawns by the Nazis, by May of 1945 these prisoners were slated to be executed since Germany had lost the war. However, before the orders could be carried out, the plans were thwarted thanks to a sympathetic German army major named Josef Gangl and an American army lieutenant by the name of Jack Lee.  \nAccording to Harding, Lee's unit was stationed in Austria awaiting word that the war with Germany had officially ended. During that time, he was approached by a surrendering Gangl, who told Lee about the French prisoners' potentially dire fate and asked him for help in setting them free. Harding speculated that Lee, having thrived as the leader of a tank battalion, was likely saddened that the war was about to end and relished the chance to have one last showdown with the Nazis. He attributed Gangl's heroics to the fact that he was a principled &quot;professional soldier&quot; that had been in the Germany army before the Nazis rose to power and, thus, had no allegiances to their agenda.  \nAfter getting the approval of U.S. commanders, Lee's unit combined with Gangl's forces to comprise a group consisting of roughly two dozen soldiers fighting to capture the castle containing the French prisoners. The battle became particularly harrowing as Nazi forces also arrived outside the castle and outnumbered the rescuers by a six to one margin and possessed vastly superior firepower. Ultimately, thanks to reinforcements from the Americans as well as aid from the Austrian resistance movement, the castle was captured and the French prisoners set free. Looking at this unique alliance between German and American soldiers that had previously been battling each other, Harding marveled that it &quot;really shows just how out of the ordinary and downright unusual the reality of warfare can be.&quot; \nGovernment Spying\nIn the first hour, author Howard Bloom talked about the recent government spying revelations as well as a White House petition calling for the release of whistleblower Bradley Manning. While Bloom conceded that he is &quot;extremely aware of the need for national security,&quot; he warned that government spying has grown into such a massive industry that it is now nearly impossible to stop it. Regarding Manning, Bloom lamented that his trial will receive far more media coverage than the &quot;most relevant trial of all&quot; which is the debate over how to balance national security with personal privacy. \nJordan Codices Update\nAlso in the first hour, theology expert Margaret Barker provided an update on the Jordan Codices. She cited metallurgical tests on the lead books suggest that they are &quot;certainly too old to be described as modern fakes&quot; and likely date back to around the early Christian era. That said, Barker was fearful that the Jordan Codices will suffer the same fate as the Dead Sea Scrolls, where scholars' access to the artifacts was severely limited for decades. As such, she stressed patience in proving the veracity of the books and acknowledged that the academic sphere works slower than the expectations of the media and the public. \nWebsite(s):\n facebook..LastBattleinEurope\n historynet.com\n margaretbarker.com\n HowardBloom.net\nBook(s):\n The Last Battle\n Voyage to Oblivion\n Temple Theology\n Temple Mysticism\n Global Brain: The Evolution of Mass Mind from the Big Bang to the 21st Century\n","torrent":{"xt":"urn:btih:1827ae6c19369cac5f14b40472225dd69ce3aa2d","amp;dn":"Coast+to+Coast+Am+June+09%2C+2013+-+The+Last+Battle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1827ae6c19369cac5f14b40472225dd69ce3aa2d","infoHashBuffer":{"type":"Buffer","data":[24,39,174,108,25,54,156,172,95,20,180,4,114,34,93,214,156,227,170,45]},"announce":[],"urlList":[]}}