{"title":"Tasogare Otome x Amnesia Complete 1-12 [UTW-Underwater] [720p]","uid":7391031,"size":4356334229,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:19206373ad51e6036fb3709f8e332ea42152727e&amp;dn=Tasogare+Otome+x+Amnesia+Complete+1-12+%5BUTW-Underwater%5D+%5B720p%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cgcatcher","files":12,"time":1340779713,"description":"None of these belong to me. I simply put them all together for an easier download. I hope everybody enjoys the anime and please seed afterwards.\n\n\nThe story takes place in Seikyou Private School. A facility that consists of multiple buildings that connect together to accommodate both junior and senior high school students. Sixty years of ongoing renovations and expansions have meant most of the old inner structures have been sealed and abandoned. Classrooms turned into storage rooms, staircases no longer in use, hallways like dark alleys. With the existence of such a maze-like building, it is only natural that rumours of the paranormal would appear.\n\nOne day first-year middle school student Teiichi Niiya gets lost in this maze and by chance arrives at an old storage room. This is where he meets Yuuko Kanoe, a mysterious girl with raven black, long silky hair and a tall and slender figure, who introduces herself as the ghost of the old school building. For some unexplainable reason Niiya is the only one able to see this spirit and she herself does not have any recollection of the reasons or time of her death, nor any lingering feelings about life itself. Curious about the circumstances of her death the two create a paranormal investigation club and seek to find out the truth about it and the many other mysteries surrounding the school.\n\n(Source: AniDB)","torrent":{"xt":"urn:btih:19206373ad51e6036fb3709f8e332ea42152727e","amp;dn":"Tasogare+Otome+x+Amnesia+Complete+1-12+%5BUTW-Underwater%5D+%5B720p%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19206373ad51e6036fb3709f8e332ea42152727e","infoHashBuffer":{"type":"Buffer","data":[25,32,99,115,173,81,230,3,111,179,112,159,142,51,46,164,33,82,114,126]},"announce":[],"urlList":[]}}