{"title":"Pollutant Diseases, Remediation and Recycling","uid":15104570,"size":12147436,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:193b6834b10785a91d3c214f5d49707edeb3c324&amp;dn=Pollutant+Diseases%2C+Remediation+and+Recycling&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466974483,"description":"Pollutant Diseases, Remediation and Recycling - Eric Lichtfouse et al. (Springer, 2013).pdf\r\n\r\nISBN 978-3-319-02386-1\r\n\r\nPollution has no borders. This popular 70’s saying from early ecologists is surprisingly still true nowadays despite overwhelming scientific evidence and public awareness of the occurrence of artificial toxic substances in water, food, air, living organisms and the environment. This book presents advanced reviews on pollutant occurrence, transfer, toxicity and remediation. The chapter on school air quality by Dambruoso et al. highlights the overlooked health issue of airborne pollutants in buildings. Children are particularly threatened because they spend 90% of their time indoors, even in summer. The chapter on industrial wastewater pollutants by Dsikowitzky and Schwarzbauer reviews pollutants from textile, petrochemical, paper, tire, chemical and pharmaceutical plants. The authors describe advanced analytical methods and ecotoxicity tests. Industrial pollutants include dioxins and furans that are also reviewed in the chapter by Mudhoo et al. The chapter on fly ash by Gianoncelli et al. presents many techniques to treat fly ash and, in turn, decrease pollutant concentrations. The authors also explain that fly ash can be recycled in agriculture, buildings and geopolymers. The chapter on antifouling paints used for ship protection, by Sousa et al., highlights the occurrence of toxic organotins in human organs such as heart, liver and breast milk. The chapter on surfactants by Rebello et al. focuses on safety concerns for humans and the ecosystems. Remediation techniques and green surfactants are presented. The chapters on toxic metals by Nava-Ruíz and Méndez-Armenta, Abarikwu and Ristić et al. describe sources, monitoring and diseases induced by lead, mercury, cadmium and thallium. The chapter on carcinogenic nitrosamines by Li et al. presents techniques and materials such as zeolites to remediate liquids and smoke containing nitrosamines","torrent":{"xt":"urn:btih:193b6834b10785a91d3c214f5d49707edeb3c324","amp;dn":"Pollutant+Diseases%2C+Remediation+and+Recycling","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"193b6834b10785a91d3c214f5d49707edeb3c324","infoHashBuffer":{"type":"Buffer","data":[25,59,104,52,177,7,133,169,29,60,33,79,93,73,112,126,222,179,195,36]},"announce":[],"urlList":[]}}