{"title":"Coast to Coast AM January 18 2013","uid":8040498,"size":54789457,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:197f5b7d0b5fa9c6a99aa2b4e5d147e5adbed1e0&amp;dn=Coast+to+Coast+AM+January+18+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1358618187,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-18-13\nHost: \tGeorge Noory\nGuests: \tOpen Lines, Maria D'Andrea\n\nGeorge Noory hosted a night of Open Lines, featuring a special hotline for callers who wanted to share their own 'near death' stories. Jeff in Columbus, Ohio, recounted when he was four years old and got a utensil lodged in his forehead after running and tripping on a rug. Jeff said he was dead when the paramedics arrived. He had another brush with death at fifteen when the car he was driving slid off the road, hit a post, and flipped into a field. Chris from Mississippi recalled the time he and a friend were driving back from the city of Tupelo and he sensed that he should immediately begin to pray. He recalled lifting up his eyes just in time to watch as the car veered off the road and flipped eleven times. Chris credited the prayer (and whomever or whatever prompted him) for surviving the horrific crash.\n\nThe close call 'near death' accident stories continued with Gary in Boston, Massachusetts, who remembered the day when he was riding a fast production motorcycle over a blind hill at a hundred miles an hour and accidentally struck a car. Gary described how everything felt like slow motion after the impact, as he flew through the air and hit the ground on his hands and knees. A voice promptly warned him about the falling bike which gave him a chance to roll out of the way before it smashed into the ground, Gary revealed. Without the warning Gary believes he would have been crushed. A Coast listener named James, who had phoned in a few years ago to share his story of going totally blind from cataracts, gave an update on his situation. Since that time an anonymous benefactor stepped in to cover all related surgical expenses and James can now see again. James said they also helped him fix up his neglected house.\n\nSome other interesting calls came into the program. Truck driving in New Mexico, Jeff told George about an entity that had been following him ever since he was a child. According to Jeff, the mysterious unseen force had recently begun spilling drinks, knocking things off of counters, and even touching him late at night. Jeff thinks these latest mischievous episodes are because his band did not include a song about the entity on their latest album. George, a professional mover from Gainesville, Florida, detailed the time he picked up and delivered some rather weird objects, such as six foot tall candle holders. At the client's house, George said he saw a large sculpture of the world with an angel on top and a demon on the bottom, a mirror on the wall of a hallway with a devil's face reflecting back at him, and a room with a sheep skin rug that he conjectured may have been for sacrifices. Creepier still, the client appeared to him in a dream that night threatening to break his arm, George disclosed.\nIntuitive Abilities\n\nIn the first hour, internationally known psychic Maria D'Andrea discussed how we can tap into our own intuitive abilities and empower ourselves to manifest our goals. Humans have had intuition since ancient times as a survival mechanism, D'Andrea said, pointing out that it can also be used for more mundane situations such as business negotiations. Despite that our intuitive senses are triggered by everyday situations, many people chose to ignore them, D'Andrea said. &quot;When you get that first feeling, you need to trust it one hundred percent because it is accurate for you,&quot; she added, noting how relying on emotions or logic is only 50/50. D'Andrea also spoke briefly on the occult and synchronicity.\nWebsite(s):\n\n    mariadandrea.com\n\nBook(s):\n\n    Secret Magical Elixirs Of Life\n    How To Eliminate Stress And Anxiety Through The Occult\n    Curses And Their Reversals\n\n","torrent":{"xt":"urn:btih:197f5b7d0b5fa9c6a99aa2b4e5d147e5adbed1e0","amp;dn":"Coast+to+Coast+AM+January+18+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"197f5b7d0b5fa9c6a99aa2b4e5d147e5adbed1e0","infoHashBuffer":{"type":"Buffer","data":[25,127,91,125,11,95,169,198,169,154,162,180,229,209,71,229,173,190,209,224]},"announce":[],"urlList":[]}}