{"title":"Heads Hands &amp; Feet-Tracks (1972)","uid":5473843,"size":73515885,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:19e9bd2462039d767f357d1ad79fca1c4b4af430&amp;dn=Heads+Hands+%26+Feet-Tracks+%281972%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"artpepper","files":-1,"time":1270034458,"description":"Heads Hands &amp; Feet - 'Tracks' (1972)  \n\n Although the core personnel had been together in a variety of incarnations since the mid-'60s, most notable of which was the brilliant and criminally short-lived Poet &amp; the One Man Band, Tracks (1972) was only the second long player from Heads Hands &amp; Feet. \n\nThe U.K. quintet of Pete Gavin (drums/vocals), Albert Lee (guitar/keyboards/vocals), Ray Smith (bass/guitar/vocals), Charles &quot;Chas&quot; Hodges (bass/guitar/violin/vocals), and front man Tony Colton (vocals) had gained significant notice stateside during a week-long residency at the Troubadour in Los Angeles after the release of their self-titled double-LP debut Heads Hands &amp; Feet (1971).\n\nFor their second outing, Tracks, they continue their quest for exceptionally crafted country-flavored material. They waste precious little time, as the fiery &quot;Let's Get This Show on the Road&quot; is a high-energy, good-time ode to the rigors and foibles of live performing and concert touring as exemplified in the chorus &quot;Maybe I'll see Margo/Down in Chicago/And I've got a dancer down in New Orleans.&quot; Lee's multi-tasking musicianship is particularly noteworthy as his rollicking keyboard work on both acoustic piano and Hammond organ, coupled with the catchy, if not slightly twangy lead electric guitar lines, rhythmically tie the verses to the chorus. \n\n&quot;Roadshow&quot; demonstrates quite a different side to the band, examining Lee's capacity for emotive singer/songwriter balladry. His temperate vocals and melodic piano runs recall that of Jackson Browne or early folksy Tom Waits. Further demonstrating Heads Hands &amp; Feet's wide-ranging musicality is &quot;Hot Property.&quot; Remarkably, the combo fuses an energetic bluegrass-inspired instrumental introduction to a funk-driven melody that would not have been too out of place coming from southern rockers Lynyrd Skynyrd. Of equal (if not arguably greater) prowess is the downhome, organic &quot;Jack Daniels,&quot; which returns the sound to a loose groove mirroring the Band's rural rockers &quot;Up on Cripple Creek&quot; or &quot;Life Is a Carnival&quot;.\n\n\n\n\nTracklist:\n\n\n01 - Lets Get This Show On The Road 03:49\n\n02 - Safety In Numbers 03:31\n\n03 - Roadshow 03:11\n\n04 - Harlequin 04:22\n\n05 - Dancer 03:19\n\n06 - Hot Property 04:52\n\n07 - Jack Daniels (Old No. 7) 03:25\n\n08 - Rhyme &amp; Time 02:36\n\n09 - Paper Chase 03:49\n\n10 - Song &amp; Dance 05:22 ","torrent":{"xt":"urn:btih:19e9bd2462039d767f357d1ad79fca1c4b4af430","amp;dn":"Heads+Hands+%26+Feet-Tracks+%281972%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19e9bd2462039d767f357d1ad79fca1c4b4af430","infoHashBuffer":{"type":"Buffer","data":[25,233,189,36,98,3,157,118,127,53,125,26,215,159,202,28,75,74,244,48]},"announce":[],"urlList":[]}}