{"title":"FemDom Ass Worship 12 XXX DVDRiP By bobiras2009","uid":7558714,"size":1461524480,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1a08ec3d850e0ceb98c77fddd68dd51079b84802&amp;dn=FemDom+Ass+Worship+12+XXX+DVDRiP+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"bobiras2009","files":-1,"time":1345684766,"description":"                                  By bobiras2009\t\n\n\nCategory\tFetish Movies, FemDom, Smothering, Evil Angel's Femdom Ass Worship Series\n \nDirector\tGlenn King\nStarring\tAurora Snow, Kyle Stone, Mackenzee Pierce, Sydnee Capri, Nikki Delano, Ryan McLane, Jeremy Conway, Eric Jover\n\n\n\nFemdom Ass Worship porn Director Glenn King's MeanBitch Productions caters to guys who are psychologically helpless against a heartless, dominant, big-assed broad. In 'FemDom Ass Worship 12,' uncaring and perverse Mistresses take pleasure from male weaklings, but give back only humiliation! It's another butt fetish specialty from Evil Angel's obsessive Buttman Magazine Choice video line. Femdom Ass Worship DVD video Glenn's cold femmes fatale destroy their hapless victims via their smothering asses and degrading emotional brutality. Femdom Ass Worship movie Each vignette begins with its fearsome star talking to the camera, taunting you with her big butt and evil intentions. Femdom Ass Worship adult DVD The first intimidator is blonde, sassy, huge-assed Nikki Delano. Femdom Ass Worship buy\n\nThis busty executive turns the tables on the scumbag who's blackmailing her. Nikki orders him to tongue-clean her nether regions; she sits her giant, soft ass on his face and tramples it with her bare feet. Next, bitchy TV newscaster Mackenzee Pierce makes her diminutive co-anchor eat her snatch, rim her asshole and worship her sweaty soles. Private investigator Aurora Snow interrupts the extracurricular activities of submissive pervert Eric Jover, threatening to tell his wife; to save his marriage, Eric's got to slurp Aurora's toes, grovel beneath her ass and submit to her every whim.\n\n\nInfo:\n\nRls.Date: 25/12/11 Codec: XviD\nDVD.Date: 22/12/11 Res: 576 x 320\nStudio: Evil Angel FPS: 29.970\nLength: 180min Bitrate: 943 kbps\nSize: 2CD (49x15MB) Audio: VBR MP3 128kb/s\n\n\t\n\n\nScreens:\n\nCD1:\n\n\nCD2:\n\n\n\n\n                                  By bobiras2009\t\t","torrent":{"xt":"urn:btih:1a08ec3d850e0ceb98c77fddd68dd51079b84802","amp;dn":"FemDom+Ass+Worship+12+XXX+DVDRiP+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a08ec3d850e0ceb98c77fddd68dd51079b84802","infoHashBuffer":{"type":"Buffer","data":[26,8,236,61,133,14,12,235,152,199,127,221,214,141,213,16,121,184,72,2]},"announce":[],"urlList":[]}}