{"title":"Organomagnesium Methods in Organic Synthesis","uid":15383091,"size":8815035,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a338e78fd7347f70e544e3cddcfa826837a5e4c&amp;dn=Organomagnesium+Methods+in+Organic+Synthesis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469251406,"description":"Organomagnesium Methods in Organic Synthesis - Basil J. Wakefield (AP, 1995).pdf\r\n\r\nThe book opens with a general overview of the constitution and reactivity of organomagnesium compounds, followed by information on handling them and on their detection and estimation. Throughout, practical aspects aswell as principles are emphasized.\r\nThe chapters on the synthesis of organomagnesium compounds cover the preparation of special forms of metallic magnesium and the reaction of magnesium with substrates such as dienes, as well as the traditional preparation of Grignard reagents. Preparations by metallation and metal-halogen exchanges are also included, as are newer methods such as hydromagnesiation of alkenes and alkynes.\r\nSystematic coverage is provided on synthetically useful reactions of organomagnesium compounds. Of fundamental importance in organic synthesis are carbon-carbon bond forming reactions; additions to carbon-carbon, carbon-nitrogen, carbon-oxygen, and carbon-sulfur multiple bonds; and nucleophilic substitution at carbon. The formation of carbon-heteroatom bonds in organic compounds is described, where the heteroatom is hydrogen, nitrogen, oxygen, sulfur, or halogen. Finally, the use of organomagnesium compounds in preparing other organometalloid and organometallic compounds is outlined.\r\nRepresentative experimental procedures are included throughout the book, and tables with references to well-described examples are provided. \r\n\r\nKey Features\r\n* Presents a general overview of the constitution and reactivity of organomagnesium compounds\r\n* Provides coverage on the detection and estimation of organomagnesium compounds\r\n* Emphasizes practical aspects as well as principles\r\n* Covers the preparation of special forms of metallic magnesium and the reaction of magnesium with substrates such as dienes\r\n* Includes preparations by metallation and metal-halogen exchanges\r\n* Reviews new preparation methods such as hydromagnesiation of alkenes and alkynes\r\n* Outlines information on synthetically useful reactions of organomagnesium compounds\r\n* Describes the formation of carbon-heteroatom bonds in organic compounds\r\n* Addresses the use of organomagnesium compounds in preparing other organometalloid and organometallic compounds\r\n* Includes representative procedures and tables with references to well-described examples","torrent":{"xt":"urn:btih:1a338e78fd7347f70e544e3cddcfa826837a5e4c","amp;dn":"Organomagnesium+Methods+in+Organic+Synthesis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a338e78fd7347f70e544e3cddcfa826837a5e4c","infoHashBuffer":{"type":"Buffer","data":[26,51,142,120,253,115,71,247,14,84,78,60,221,207,168,38,131,122,94,76]},"announce":[],"urlList":[]}}