{"title":"Sister Janet Mead ~ A Rock Mass ~ 3 albums (FLAC, 1974~1983)","uid":9366070,"size":735524026,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1a58a59e6d41dc0d8a71a520454fb5fa230ccbec&amp;dn=Sister+Janet+Mead+%7E+A+Rock+Mass+%7E+3+albums+%28FLAC%2C+1974%7E1983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cockymountainoyster","files":-1,"time":1387414513,"description":"Sister Janet Mead ~ A Rock Mass ~ Time To Sing (FLAC, 1974~1983)\n &lt;a href=&quot;\nhttp://www.sisterjanetmead.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sisterjanetmead.com&lt;/a&gt;\n\n&quot;Each person has a right to be loved and cared for equally with everyone else. What we need is peace - not paralyzed passivity, but an active selfless, creative peace. It means feeling passionately for the rest of the world and it brings with it great pain - misunderstanding, misinterpretation of motives - but it must be chosen because our spirit knows it to be good. This happiness or peace does not care about our own narrow pleasure nor does it look for rewards. It is not true that love makes all things easy: it makes us choose what is difficult.\n\nWith the preoccupation with the accumulation of knowledge, the real knowledge necessary is how to transform violence and hatred into compassion, how to stop the chain of aggression against the weak, how to stop the greed and fear. The worry is that big business, politicians and the media are giving people values that power and money are what should be striven for and that might is right. We must have strong convictions and fight against these promoted ideas that we must be happy and comfortable in the physical sense.\n\nTrue happiness can only be achieved by reaching out to others honestly, trustingly with compassion. Our society is being taught to fear and be suspicious - not a recipe for peace but for disaster. This creates forgotten vulnerable groups of people who feel helpless to improve their way of life. We must all strive to find out the truth of events and about people. For the most part, this necessity is being denied us and this results in insurmountable barriers between us all, isolation and mistrust.\n\nThe need for active compassion is greater than ever in our world, our nation, our state. Attitudes to our destitute, refugees, mentally ill, Aborigines or any other vulnerable people have hardened because of government policy, media hype, talkback radio and spiritual poverty of the heart. &quot;Mercy is justice in tears&quot;. The most important thing life teaches us is the necessity of seeing ourselves as part of a living, growing community of people with the common goal of serving others, standing strong with the poor and having the courage to stand up for the oppressed. St Augustine said, &quot;Hope has two beautiful daughters - anger and courage: anger to confront the wrongs of the world and courage to redress them.&quot;\n\nI believe that life is a unity and therefore not divided into compartments. That means that worship, music, recreation, work and all other 'little boxes' of our lives are really inseparable and this is why I believe that people should be given the opportunity to worship God with the language and music that is part of their ordinary life. The words of the songs on this record almost all come from books of the Bible, which so richly expresses the longings of our heart, our loneliness, our joy, our dependence on God, our desire to love our fellow man and to live in peace. We all recognize these yearnings --- they are ours and are common to each of our lives.\n\nIn the 'Lord's Prayer' there is a phrase which expresses what I believe is Christ's ideal. It says, &quot;Thy Kingdom come, thy will be done, on earth as it is in heaven&quot;. That is what I think Christ tried to bring about. He kept talking about initiating the kingdom of heaven on earth. What I think he meant was that he wanted us to share in His vision of drawing people together in happiness, joy and peace. Music has all the qualities to help in this --- it breaks down barriers, unites, makes us forget ourselves, makes us aware of others and is totally involving.\n\nIn my life I have had the great happiness of seeing many people work together for good. My parents who first taught me to love, the community of nuns in which I work, the students in my school in Adelaide, my very numerous friends, the young people who have devoted their time to preparing each week for hours for their Youth Masses and now the record company with which I have worked to make this record. If I, one person, have seen so many people of goodwill in a comparatively short life, surely it is innately in us all to work together in our own small way for the unity of humankind.&quot; ~ J.C. Mead (Sister of Mercy)\n\nWith You I Am (1974)\n\n1. Hold On\n2. The Earth is Filled\n3. Gloria\n4. Father I Put My Life in Your Hands\n5. Take My Hand\n6. The Ten Commandments\n7. With You I Am\n8. Keep Me Safe\n9. Lamb Of God\n10. God My God\n11. He Is King\n12. The Lord's Prayer (Original Version)\n\nbut I Am Smaller Than My Song (1975)\n\n1. Happy The Man\n2. Lord Have Mercy\n3. Waterfall Song\n4. Glory To The Word Of God\n5. Wailing Song\n6. Holy, Holy Lord\n7. Our Death\n8. The Lord's Prayer (New Version)\n9. Lamb of God\n10. Communion Song\n11. The Heavens Unfold\n12. Thank You Lord\n13. Sermon on the Mount\n14. I Will Raise Him Up\n\nA Time to Sing (1983)\n\n1. The Lord's Prayer (Choral Version)\n2. The Sound of Silence\n3. The Lord Our God Is King\n4. The Lord Is My Shepherd\n5. Turn Turn Turn\n6. The Times They Are A Changin'\n7. The Rose\n8. Morning Has Broken\n9. Sabbath Prayer\n10. Babylon\n11. Day By Day/Prepare Ye The Way Of The Lord\n12. Hosanna\n13. Amen\n14. Brand New World\n15. Turn On The Sun\n16. Music of The World A Turnin'\n\nPlease Seed this, Merci beaucoup!\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/cockymountainoyster&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/cockymountainoyster&lt;/a&gt;","torrent":{"xt":"urn:btih:1a58a59e6d41dc0d8a71a520454fb5fa230ccbec","amp;dn":"Sister+Janet+Mead+%7E+A+Rock+Mass+%7E+3+albums+%28FLAC%2C+1974%7E1983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a58a59e6d41dc0d8a71a520454fb5fa230ccbec","infoHashBuffer":{"type":"Buffer","data":[26,88,165,158,109,65,220,13,138,113,165,32,69,79,181,250,35,12,203,236]},"announce":[],"urlList":[]}}