{"title":"IronMaiden-SomewhereBackInTime2008","uid":4518705,"size":1465640960,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1af3ec3324a101ec0db97acb45b9edc73f2228a3&amp;dn=IronMaiden-SomewhereBackInTime2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Sindakit","files":1,"time":1227076004,"description":"Iron Maiden - Somewhere Back In Time 2008\n\nLive at Porto Alegre - Brazil 2008-05-03\n\nTracklist:\n\n01.Intro - Churchill's Speech\n02.Aces High\n03.2 Minutes To Midnight\n04.Revelations\n05.The Trooper\n06.Wasted Years\n07.The Number Of The Beast\n08.Can I Play With Madness\n09.Rime Of The Ancient Mariner\n10.Powerslave\n11.Heaven Can Wait\n12.Run To The Hills\n13.Fear Of The Dark\n14.Iron Maiden\n15.Moonchild\n16.The Clairvoyant\n17.Hallowed Be Thy Name\n\n\n\n\nQuote:\nThis first leg of Iron Maiden's 'SOMEWHERE BACK IN TIME' World Tour will open in Mumbai India on Feb 1st, and continue through Australia, Japan, Los Angeles and Mexico, followed by the band's first ever concerts in Costa Rica and Columbia, and then on to Brazil, Argentina, Chile, Puerto Rica and New York, before finishing in Toronto, Canada, on March 16th. Over the 45 day period it is anticipated that Maiden will play to well over 400,000 fans in 21 cities in 10 countries, flying close to 50,000 miles in the specially refitted plane (full schedule below).\n\nComments Bruce Dickinson, &quot;I have been flying commercial passenger jets for Astraeus Airlines for a few years now and we are commissioning an Astraeus Boeing 757. It will go in for overhaul, painting and conversion in November which will then give us time to ensure we have all the necessary safety documentation, especially with regard to fire safety. It also means it could possibly be flying commercial air routes decked out in Maiden colours for a couple of months before we start!\n\n&quot;Looking at the list of places we would like to play we have always had problems joining up the dots. With sea containers in various places it slows down the whole touring process, which is fine if you want a holiday but not if you want to play. It's great to see places but we don't want to sit around for a week waiting for gear to get from, say, Australia to South America, so this way we can get to more fans in more places en route in the same time period&quot;\n\nTo tie in with forthcoming 2008 releases on DVD of the classic 'LIVE AFTER DEATH' concert video (full details coming soon) this tour, aptly entitled 'SOMEWHERE BACK IN TIME', will revisit the band's history by focusing almost entirely on the 80's in both choice of songs played and the stage set, which will be based around the legendary Egyptian Production of the 1984-85 'Powerslave Tour'. This will arguably be the most elaborate and spectacular show the band have ever presented, and will include some key elements of their Somewhere In Time tour of 1986/7, such as the Cyborg Eddie.\n\nSteve Harris comments &quot;l always loved the Powerslave show which I think was arguably our most spectacular ever, so taking it out again is really going to be a lot of fun. Taking our own 757 really makes it a lot more flexible for us and we intend to ram into the specially constructed cargo holds as much of the show as we possibly can. The schedule we have been able to put together due to this flexibility l think is very exciting, taking us to some places we haven't been in a long while like Australia and some we have never been to like Columbia and Costa Rica. It is always refreshing going to new places and we hear the fans there are incredible! It's a lot of flying but will be well worth it.","torrent":{"xt":"urn:btih:1af3ec3324a101ec0db97acb45b9edc73f2228a3","amp;dn":"IronMaiden-SomewhereBackInTime2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1af3ec3324a101ec0db97acb45b9edc73f2228a3","infoHashBuffer":{"type":"Buffer","data":[26,243,236,51,36,161,1,236,13,185,122,203,69,185,237,199,63,34,40,163]},"announce":[],"urlList":[]}}