{"title":"Swift - (Waging War) (2002)","uid":3701048,"size":73382442,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1c18fa84e3d3e492133d117f8f0295a684a268f6&amp;dn=Swift+-+%28Waging+War%29+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Marco A. Vieira","files":14,"time":1180551028,"description":"Review\tby Jason D. Taylor\n\nThose who have grown to adore the fledgling emo-core style that spawned Thursday, Thrice, Poison the Well, and a slew of others should be enamored by North Carolina&amp;#039;s Swift, who mark their full-length debut with (Waging War). Crafting silky-smooth, melodic crooning with rather abrasive hardcore screams works exceptionally well for these young men, as the album on the whole has a very fluid flow, never stumbling on over-used guitar work or repetitive choruses. While (Waging War) does have an obvious hardcore slant, the commercial viability shown on this release provides the listener with a glimpse of what the future holds for Swift -- these songs would make for beautiful radio hits and major labels surely must notice this. Gary Forsyth&amp;#039;s voice is deliciously addictive, and he seemingly knows exactly when to accent certain words to achieve the most emotional effect on the listener. Drummer Jamie King pulls double duty. also having produced this effort, and his dedication shines here. For an independent release, (Waging War) sounds wonderfully clean and proves that King&amp;#039;s skills extend far beyond his capable drumming prowess (he has, in fact, produced albums from Lifeforce Records alumni Between the Buried and Me and Solid State recording artists Beloved, to name two). Although a Deftones influence can be detected on certain songs (the vocal shyness on &quot;The Guatemalan&quot; is similar to that of Chino Moreno&amp;#039;s, for example), overall this is a superb release from a band who has definite potential in a mainstream market. \n &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:hifyxq9aldae&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:hifyxq9aldae&lt;/a&gt;\n\nRating: 4 Stars","torrent":{"xt":"urn:btih:1c18fa84e3d3e492133d117f8f0295a684a268f6","amp;dn":"Swift+-+%28Waging+War%29+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c18fa84e3d3e492133d117f8f0295a684a268f6","infoHashBuffer":{"type":"Buffer","data":[28,24,250,132,227,211,228,146,19,61,17,127,143,2,149,166,132,162,104,246]},"announce":[],"urlList":[]}}