{"title":"Bobby Brown - Every Little Step  (2nafish)","uid":5577271,"size":138977284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1c54177b4bb212d109defa8d145687266a6ea020&amp;dn=Bobby+Brown+-+Every+Little+Step++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1274424509,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Every Little Step&quot; is a single released by R&amp;B singer Bobby Brown in 1989 on the MCA  label. The video featured Brown twisting, turning, and spinning, creating a new era for dancers from the local clubs to the school dances. The video also featured Brown's stair step haircut that became the norm for urban blacks across the country.\n\nReleased as the fourth single on his second album Don't Be Cruel, it reached #3 on the Billboard Hot 100, #1 on the Hot Black Singles chart, and #6 on the UK Singles Chart. Brown also raps on the song in the video version. This version is available on The Remix Album Dance!...Ya Know It!.\n\nDon't Be Cruel is the second album by American  R&amp;B singer Bobby Brown, released in 1988 on MCA Records. It includes the hit singles &quot;Don't Be Cruel&quot; and &quot;My Prerogative&quot;, Brown's only number-one hit on the Billboard Hot 100. Don't Be Cruel was the best-selling album in 1989, eventually going eight times Platinum. This was the best selling &quot;New Jack Swing&quot; album at the time until Michael Jackson's 1991 album &quot;Dangerous&quot; was released. Bobby Brown won the grammy for Best Male R&amp;B Vocal Performance in 1990. Brown followed the release of his album with a 120-date world tour.\n\n&quot;Don't Be Cruel&quot; appeared in popular video game Grand Theft Auto: San Andreas, playing on fictional New Jack Swing radio station CSR 103.9. My Prerogative was later covered by Britney Spears in 2004 on her Greatest Hits: My Prerogative album, and released as a single.\n\nRobert Barisford &quot;Bobby&quot; Brown (born February 5, 1969) is an American  R&amp;B singer-songwriter, occasional rapper, and dancer. After success in pop group New Edition, Brown began his solo career in 1987 and had a string of Top 10 Billboard hits, culminating in a Grammy Award. He was a pioneer of New Jack Swing music, a fusion of hip hop and R&amp;B. His second album, Don't Be Cruel, included popular songs such as &quot;My Prerogative&quot;. Brown is the ex-husband of R&amp;B singer Whitney Houston and starred in the reality show Being Bobby Brown.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:1c54177b4bb212d109defa8d145687266a6ea020","amp;dn":"Bobby+Brown+-+Every+Little+Step++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c54177b4bb212d109defa8d145687266a6ea020","infoHashBuffer":{"type":"Buffer","data":[28,84,23,123,75,178,18,209,9,222,250,141,20,86,135,38,106,110,160,32]},"announce":[],"urlList":[]}}