{"title":"Mario Kart DS [volpebianca].rar","uid":4643130,"size":15391218,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:1e513fedba77515b85b146aed1fb131a23c4a71b&amp;dn=Mario+Kart+DS+%5Bvolpebianca%5D.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lore46","files":-1,"time":1231787302,"description":"a classe non ÃƒÂ¨ acqua...\nSono davvero rari i videogiocatori che non hanno mai sentito parlare di Mario Kart o che non hanno mai giocato, almeno in un periodo videoludico della loro vita, ad un episodio della celebre saga nata su SNES e poi tramandata di generazione in generazione sulle altre Console made in Nintendo. Chi di voi sventurati appartenesse a questa infausta categoria, sappia che fondamentalmente Mario Kart DS non fa che riproporre un concept che anche altri hanno tentato di percorrere in questi ultimi anni, ovvero un racing game con protagonisti tratti dal bagaglio culturale di questa o quella software house, ad esempio &quot;Crash Nitro Kart&quot; (PS2). Tuttavia, la serie Nintendo ÃƒÂ¨ sempre stata anni luce avanti alla concorrenza in fatto di stile, fantasia e divertimento, fosse solo per il fatto che il primo titolo ad inaugurare il genere del &quot;character racing game&quot; - passatemi la definizione - fu proprio Super Mario Kart nel 1992... e da lÃƒÂ¬ in avanti Kyoto, come troppo spesso accade, ha dettato gli standards e gli altri si sono adeguati. Detto ciÃƒÂ², non resta che vedere se questo ulteriore sequel sia o meno all'altezza dei suoi predecessori.\n\nUn passo indietro?\nConcettualmente l'impostazione di gioco ÃƒÂ¨ molto piÃƒÂ¹ simile agli episodi visti su Super Nintendo e N64 che non al &quot;Double Dash!!&quot; uscito su Cubo un paio di anni fa, dove - vi ricorderete sicuramente - la formula pilot + gunner faceva la sua prima comparsa dividendo pubblico e critica in entusiasti della trovata e scettici riguardo alla stessa (me tra questi). Adesso si torna a gareggiare in solitaria, un passo indietro rispetto allo slogan in due ci si diverte il doppio quindi? Ma neanche per idea, perchÃƒÂ© Mario Kart DS offre per la prima volta nella storia della saga la possibilitÃƒÂ  di coinvolgere OnLine fino a 4 giocatori sfruttando il wi-fire della Console! E non c'ÃƒÂ¨ neanche bisogno di dire quante siano giÃƒÂ  le comunitÃƒÂ  web che si sono date appuntamento sui connettori al silicio di &quot;Mario Kart DS&quot;. Per quanto non sia esente da difetti o da mancanze piÃƒÂ¹ o meno visibili (come l'impossibilitÃƒÂ  di chattare con gli amici che si invitano alla gara o, di contro, la possibilitÃƒÂ  per i lamers di evitare la giusta umiliazione disconnettendosi all'ultimo giro) questo primo esperimento di OnLine rappresenta uno dei passi avanti piÃƒÂ¹ importanti mai fatti dalla Nintendo in questi anni. Se si dispone di un Wireless Access Point, andare OnLine con il DS puÃƒÂ² essere una cosa tanto semplice quanto breve, giusto il tempo di connettersi ad uno dei Wireless Router supportati da Nintendo e digitare il vostro PIN tramite touch screen. Altrimenti, grazie al connettore WI-FI USB da poco rilasciato, vi basterÃƒÂ  visitare il vostro Local Hotspot e configurare un pÃƒÂ² di robetta sul PC (firewalls e altre amenitÃƒÂ  microsoftiane). In ogni caso, il sito nintendowifi.com linkato in alto a destra in questa pagina, potrÃƒÂ  venirvi in aiuto.\n\nStar Road to Heaven!\nLa modalitÃƒÂ  di gioco principale prevede come sempre una serie di gare organizzate in Grand Prix, piÃƒÂ¹ precisamente 8 campionati composti da 4 contest l'uno, per un totale di ben 32 piste. Oltre al numero elevato, ciÃƒÂ² che stupisce veramente dei tracciati di gara ÃƒÂ¨ che non ne troverete mai due uguali, sono tutti diversi, metÃƒÂ  dei quali valide riproposizioni di circuiti classici giÃƒÂ  apparsi negli altri excursus della saga, e l'altra metÃƒÂ  completamente inediti. Ovviamente non saranno tutti giocabili fin da subito, dovrete prima sbloccarli vincendo man mano tutti i GP, che vi ricordo sono suddivisi nelle solite 3 categorie: 50cc, 100cc e 150cc. La difficoltÃƒÂ  non aumenta solo in relazione alla cilindrata, ma anche alla scaltrezza degli avversari, che non di rado riveleranno un sadismo di fondo non indifferente. Lo stesso discorso vale per i kart e i personaggi selezionabili, all'inizio solo 8 con 2 kart ciascuno; accumulando vittorie ne sbloccherete degli altri utilizzabili anche in chiave multiplayer, ma di questo ci occuperemo dopo. Non poteva mancare la modalitÃƒÂ  battaglia - balloon battle mode - che al solito vi vedrÃƒÂ  impegnati in scontri a tutto campo fino all'ultimo palloncino. Oltre alle due precedenti modalitÃƒÂ  di gioco, troviamo anche una inedita modalitÃƒÂ  a missioni basata sul completamento di sfide a tempo a difficoltÃƒÂ  crescente, come collezionare monete o passare nel giusto ordine numerico attraverso porte disposte sul tracciato. Si parla in tutto di 54 missioni divise in 6 gruppi da 9, e ciascun gruppo alla fine termina con un boss da sconfiggere per passare al successivo. Combattere contro i boss non sarÃƒÂ  la solita minestra riscaldata, ognuno di essi richiede un approccio diverso per essere sconfitto, come usare turbo boost per scaraventarlo giÃƒÂ¹ da una piattaforma, colpirlo nel punto debole a suon di gusci verdi o semplicemente batterlo in un testa a testa. Questa new entry nelle modalitÃƒÂ  di gioco non solo influenza in modo positivo la longevitÃƒÂ  del titolo, ma ci offre anche l'opportunitÃƒÂ  di migliorare le nostre abilitÃƒÂ  di guida in vista delle gare, e si dimostra utile a tal fine piÃƒÂ¹ di quanto lo sia mai stato il semplice time trial. Difatti, benchÃƒÂ© la curva di apprendimento sia ben calibrata e il sistema di controllo piuttosto intuitivo, ci sono una serie di tecniche avanzate che si possono imparare solo giocando, giocando e ancora giocando... e per vincere tutto il possibile dovrete inevitabilmente farle vostre. Insomma, in Mario Kart DS, come in ogni altro Mario Kart che ÃƒÂ¨ stato, non basta saper guidare, bisogna anche - e soprattutto - saper combattere ed usare i trick in game; trick presenti da una vita, come l'entrata in curva in derapata o il turbo boost alla partenza, ma anche trick inediti, come muovere rapidamente il D pad a destra e sinistra per guadagnare mini boost (chi ha detto FZeroGX?) o sfruttare l'effetto scia stando incollati a chi vi precede. A dare una punticina di simulazione (mi perdonino i cultori del termine) ad un titolo prettamente arcade, concorrono diversi fattori che effettivamente differenziano un kart dall'altro, ovvero la velocitÃƒÂ  massima, l'accelerazione, il peso della vettura, la tenuta di strada, la reattivitÃƒÂ  in frenata e l'entrata in derapata; differenze che noterete sin dalle prime curve.\n\nNot only shells...\nNon esiste Mario Kart che non faccia dei power ups il suo punto di forza, e questo titolo per DS non ÃƒÂ¨ da meno, anzi, oltre ai canonici gusci Koopa (nelle tre varianti verde, rosso e giallo spinoso) e, piÃƒÂ¹ in generale, in aggiunta a tutti gli items importati dai precedenti capitoli della serie, troviamo una triade di outsiders che in poco tempo impareremo ad amare (&quot;Bullet Bill&quot;, &quot;Blooper&quot; e &quot;Bob-omb&quot;). Il primo di questi, Bullet Bill, ci trasformerÃƒÂ  momentaneamente in un proiettile, consentendoci di fare un sol boccone dei nostri avversari, in piÃƒÂ¹ stando comodamente a braccia conserte causa autopilota; la piovra Blooper invece, ha il vizio di spruzzare inchiostro, e la potremo utilizzare per sporcare il parabrezza degli altri concorrenti, riducendogli di un buon 70% il campo visivo; la &quot;Bob-omba&quot; infine... beh, penso che non abbia bisogno di spiegazioni, si tira come una buccia di banana ma ha un effetto un tantinello piÃƒÂ¹ incasinato. Fate attenzione al neonato &quot;items score&quot; quando scegliete un kart, da questo dipenderanno la qualitÃƒÂ  e la quantitÃƒÂ  di power ups che riceverete in corso di gara.\nAlcune persone con cui ho avuto modo di parlare, ritengono Mario Kart DS un titolo sopravvalutato causa lo scarso utilizzo del touch screen. Che il touch screen sia l'elemento distintivo del DS, e che il pennino sia il fulcro della sua rivoluzione, nessuno lo mette in dubbio, ma ciÃƒÂ² non vuol dire che il secondo schermo non possa essere utilizzato in altri modi parimenti interessanti ed innovativi. In questo caso ad esempio, lo schermo secondario ÃƒÂ¨ un radar a tutti gli effetti, che ci permette non solo di vedere l'esatta ubicazione degli avversari sulla mappa, ma anche di conoscere in anticipo i power ups in loro possesso, di decidere come e dove rilasciare trappole, e addirittura ci aiuta nella scelta della traiettoria da seguire evidenziando quella di chi ci precede. Parola mia, una volta che avrete apprezzato Mario Kart con il secondo schermo a mÃƒÂ² di radar, non ne vorrete piÃƒÂ¹ sapere degli altri modi di giocarci!\n\nChi l'ha detto che uniti si vince?\nPunto forte del titolo (facendo finta che tutto quanto detto finora non lo sia) ÃƒÂ¨ la componente multiplayer; se in singolo ci si diverte da matti a gareggiare contro la CPU, assieme a 7 amici si raggiunge l'estasi videoludica, e poi, non c'ÃƒÂ¨ niente di meglio di un contest tutti contro tutti per decretare il sovrano assoluto e indiscusso di Mario Kart (che poi sarei io). Non occorre che i partecipanti alla sessione multiplayer abbiano tutti una copia del gioco in questione, ne basta una per poter ugualmente battagliare, correre nei GP e fare sfide in versus, unico neo, far fronte a restrizioni che limitano la scelta dei tracciati e i personaggi disponibili, senza perÃƒÂ² minare la validitÃƒÂ  del multi (questo ribadisco, se si ÃƒÂ¨ in possesso di una sola copia del gioco). Se invece i vostri amici hanno tutti una copia di Mario Kart DS, il problema non si pone e potrete usufruire di tutti i tracciati e i personaggi, anche quelli sbloccati, e scambiarvi le ghost data ottenute nelle sessioni di time trial. Poi l'OnLine, beh... ÃƒÂ¨ tutto da provare, veramente ottimo per essere il primo in larga scala mai fatto da Nintendo!\n\nReady? Go!\nDa un profilo tecnico, Mario Kart DS ÃƒÂ¨ un eccellente esempio di quello che la Console portatile Nintendo puÃƒÂ² fare se saputa sfruttare: una pulizia grafica impressionante, una profonditÃƒÂ  degli scenari stupefacente, ottimi modelli poligonali, superbi effetti speciali, elevato livello del dettaglio e backgrounds piÃƒÂ¹ ispirati che mai, anche se, quelli provenienti dallo SNES e dal GBA, sono leggermente inferiori rispetto a quelli appositamente sviluppati su DS. Ma quello che veramente lascia di stucco, ÃƒÂ¨ che l'engine affianca una grafica di prim'ordine, ad una fluiditÃƒÂ  senza precedenti (anche OnLine, connessioni permettendo). Qualsiasi cosa accada, il gioco schizzerÃƒÂ  comunque a 60 frames per secondo, senza mai accennare rallentamenti o cali di sorta, e, messa da parte un attimino la classe 50cc, il senso di velocitÃƒÂ  nelle restanti due categorie sarÃƒÂ  sempre veramente notevole. Unica pecca, le textures non sono filtrate, ma come sappiamo si tratta di un limite hardware del DS non del gioco in sÃƒÂ¨. Magnifici, in ogni caso, i colori. Per quanto riguarda il track design, si va da strutture semplici (come il classico doppio tornante) ad altre talmente complesse da meritarsi l'appellativo di &quot;paranoico&quot;!\nUn titolo ottimo da vedere ma anche da ascoltare, splendidi i remakes delle vecchie songs, di qualitÃƒÂ  elevatissima gli effetti sonori (come ad esempio il rombo dei motori) ed i campionamenti vocali (gustosissimi i commenti degli avversari), come anche la realizzazione audio dei power ups (esplosioni, slittamenti, boost, etc.).\n","torrent":{"xt":"urn:btih:1e513fedba77515b85b146aed1fb131a23c4a71b","amp;dn":"Mario+Kart+DS+%5Bvolpebianca%5D.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e513fedba77515b85b146aed1fb131a23c4a71b","infoHashBuffer":{"type":"Buffer","data":[30,81,63,237,186,119,81,91,133,177,70,174,209,251,19,26,35,196,167,27]},"announce":[],"urlList":[]}}