{"title":"The Living Elephants - Evolutionary Ecology, Behaviour, and Cons","uid":5336883,"size":7651692,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1eb4f8c2fbb5826b7106badd868f5cf339914c5c&amp;dn=The+Living+Elephants+-+Evolutionary+Ecology%2C+Behaviour%2C+and+Cons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iornix","files":-1,"time":1265348383,"description":"Product Details\n\n    * Pub. Date: September 2003\n    * Publisher: Oxford University Press\n    * Format: Hardcover, 496pp\n\n    * ISBN-13: 9780195107784\n    * ISBN: 0195107780\n\nOverview\nThe Living Elephants is the authoritative resource for information on both Asian and African elephants. From the ancient origins of the proboscideans to the present-day crisis of the living elephants, this volume synthesizes the behavior, ecology and conservation of elephants, while covering also the history of human interactions with elephants, all within the theoretical framework of evolutionary biology.\n\nThe book begins with a survey of the 60-million year evolutionary history of the proboscideans emphasizing the role of climate and vegetation change in giving rise to a bewildering array of species, but also discussing the possible role of humans in the late Pleistocene extinction of mastodonts and mammoths. The latest information on the molecular genetics of African and Asian elephants and its taxonomic implications are then presented. The rise of the elephant culture in Asia, and its early demise in Africa are traced along with an original interpretation of this unique animal-human relationship.\n\nThe book then moves on to the social life of elephants as it relates to reproductive strategies of males and females, development of behavior in young, communication, ranging patterns, and societal organization. The foraging strategies of elephants, their impact on the vegetation and landscape are then discussed. The dynamics of elephant populations in relation to hunting for ivory and their population viability are described with the aid of mathematical models.\n\nA detailed account of elephant-human interactions includes a treatment of crop depredation by elephants in relation to their natural ecology, manslaughter by elephants, habitat manipulation by humans, and a history of the ivory trade and poaching in the two continents. The ecological information is brought together in the final chapter to formulate a set of pragmatic recommendations for the long-term conservation of elephants.\n\nThe broadest treatment of the subject yet undertaken, by one of the leading workers in the field, Raman Sukumar, the book promises to bring the understanding of elephants to a new level. It should be of interest not only to biologists but also a broader audience including field ecologists, wildlife administrators, historians, conservationists and all those interested in elephants and their future.\n\n\n","torrent":{"xt":"urn:btih:1eb4f8c2fbb5826b7106badd868f5cf339914c5c","amp;dn":"The+Living+Elephants+-+Evolutionary+Ecology%2C+Behaviour%2C+and+Cons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eb4f8c2fbb5826b7106badd868f5cf339914c5c","infoHashBuffer":{"type":"Buffer","data":[30,180,248,194,251,181,130,107,113,6,186,221,134,143,92,243,57,145,76,92]},"announce":[],"urlList":[]}}