{"title":"Reliability and Safety Engineering, 2nd Edition [2015] [PDF]","uid":12593205,"size":13324814,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1fb583241407aad14090236ee8d802989c6e8b00&amp;dn=Reliability+and+Safety+Engineering%2C+2nd+Edition+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1445194947,"description":"Title: Reliability and Safety Engineering \r\nSeries: IEEE Press Series on Power Engineering \r\nAuthor: Ajit Kumar Verma, Srividya Ajit, Durga Rao Karanki \r\nFormat: PDF \r\nHardcover: 571 pages \r\nPublisher: Springer; 2nd ed. 2016 edition (September 29, 2015) \r\nLanguage: English \r\nISBN: 978-1447162681 \r\n\r\n\r\nReliability and safety are core issues that must be addressed throughout the life cycle of engineering systems. Reliability and Safety Engineering presents an overview of the basic concepts, together with simple and practical illustrations.\r\n\r\nThe authors present reliability terminology in various engineering fields, viz., electronics engineering, software engineering, mechanical engineering, structural engineering and power systems engineering. The book describes the latest applications in the area of probabilistic safety assessment, such as technical specification optimization, risk monitoring and risk informed in-service inspection. Reliability and safety studies must, inevitably, deal with uncertainty, so the book includes uncertainty propagation methods: Monte Carlo simulation, fuzzy arithmetic, Dempster-Shafer theory and probability bounds. Reliability and Safety Engineering also highlights advances in system reliability and safety assessment including dynamic system modeling and uncertainty management. Case studies from typical nuclear power plants as well as from structural, software and electronic systems are also discussed.\r\n\r\nReliability and Safety Engineering combines discussions of the existing literature on basic concepts and applications with state-of-the-art methods used in reliability and risk assessment of engineering systems. It is designed to assist practicing engineers, students and researchers in the areas of reliability engineering and risk analysis","torrent":{"xt":"urn:btih:1fb583241407aad14090236ee8d802989c6e8b00","amp;dn":"Reliability+and+Safety+Engineering%2C+2nd+Edition+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fb583241407aad14090236ee8d802989c6e8b00","infoHashBuffer":{"type":"Buffer","data":[31,181,131,36,20,7,170,209,64,144,35,110,232,216,2,152,156,110,139,0]},"announce":[],"urlList":[]}}