{"title":"Mafalda Animada Vol.04 Final","uid":4733747,"size":224466944,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1ff921593729ce584bf6a2dbb9b1aaaf2a5a4975&amp;dn=Mafalda+Animada+Vol.04+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malagahuelin","files":1,"time":1235167310,"description":"Mafalda Animada son un total de 104 videos cortos en 4 Volumenes.\nPor la dÃƒÂ©cada del Ã‚Â´60, cuando Quino trabajaba en una agencia de publicidad, la empresa Siam Di Tella le encargo la creaciÃƒÂ³n de un personaje para promocionar en TV sus productos... AsÃƒÂ­ nacÃƒÂ­a Mafalda. \nPero en realidad esta niÃƒÂ±ita nunca fue vista por el publico en esos comerciales, sino que fue tiempo despuÃƒÂ©s cuando el autor argentino la rescata para que protagonice una tira en la revista Primera Plana, esto sucedÃƒÂ­a en septiembre de 1964.\nPara protagonizar esta divertida historieta, que veÃƒÂ­a la eterna lucha entre dÃƒÂ©biles y poderosos con ojos infantiles pero muy perspicaces, Mafalda no estaba sola, sino que estuvo muy bien acompaÃƒÂ±ada (y secundada) por sus amigos Felipe, Susanita, Manolito, Miguelito y Libertad; ademÃƒÂ¡s su hermanito Guille y sus padres.\nHasta junio de 1973 Mafalda desfilo por diferentes medios como el diario El Mundo o por Siete DÃƒÂ­as Ilustrado; luego de esa fecha su creador decidiÃƒÂ³ ponerle un punto final a sus personajes; no pudo, la simpÃƒÂ¡tica niÃƒÂ±a indiscreta ya se habÃƒÂ­a instalado en la sociedad argentina y la obra de Quino fue rescatada e inmortalizada en 10 libros (que aun hoy se siguen vendiendo).\nMas tarde hizo su primera incursiÃƒÂ³n televisiva, era el 2 de abril de 1973 en el canal 11 de Buenos Aires Argentina, se trataba de una tira producida por Daniel Mello. &quot;Era una versiÃƒÂ³n edulcorada de Mafalda, con colores chillones, escuela rosa y cielo celeste, por ejemplo. Todo lo contrario a la visiÃƒÂ³n que tiene el personaje del mundo&quot; se refiriÃƒÂ³ Quino con respecto a este intento fallido.\n\nPor el aÃƒÂ±o 1993 un equipo de animadores cubanos, bajo la direcciÃƒÂ³n de Juan PadrÃƒÂ³n la ayuda del propio Quino y por una iniciativa de la TV espaÃƒÂ±ola trabajaron durante 11 dÃƒÂ­as en La Habana seleccionando material de todas las tiras que habÃƒÂ­a hecho el autor argentino y realizaron una producciÃƒÂ³n de 104 capÃƒÂ­tulos que se presento con bastante ÃƒÂ©xito en EspaÃƒÂ±a hacia 1995.\n\n","torrent":{"xt":"urn:btih:1ff921593729ce584bf6a2dbb9b1aaaf2a5a4975","amp;dn":"Mafalda+Animada+Vol.04+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ff921593729ce584bf6a2dbb9b1aaaf2a5a4975","infoHashBuffer":{"type":"Buffer","data":[31,249,33,89,55,41,206,88,75,246,162,219,185,177,170,175,42,90,73,117]},"announce":[],"urlList":[]}}