{"title":"MIT.Press.The.Definition.of.Standard.ML.Revised.Edition.(1997).e","uid":8651064,"size":4949638,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20014541fa4cbe4ddd6b12216e3065f0ab087d2c&amp;dn=MIT.Press.The.Definition.of.Standard.ML.Revised.Edition.%281997%29.e&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moebanzor","files":1,"time":1373105169,"description":"The Definition of Standard ML, Revised Edition (1997)\n\nRobin Milner, Mads Tofte, David Macqueen\n\nMIT Press\nISBN:0262631814\n\nEPUB\n\n\nStandard ML is a general-purpose programming language designed for large projects.\nThis book provides a formal definition of Standard ML for the benefit of all concerned with the\nlanguage, including users and implementers. Because computer programs are increasingly required to\nwithstand rigorous analysis, it is all the more important that the language in which they are\nwritten be defined with full rigor.One purpose of a language definition is to establish a theory of\nmeanings upon which the understanding of particular programs may rest. To properly define a\nprogramming language, it is necessary to use some form of notation other than a programming\nlanguage. Given a concern for rigor, mathematical notation is an obvious choice. The authors have\ndefined their semantic objects in mathematical notation that is completely independent of Standard\nML.In defining a language one must also define the rules of evaluation precisely--that is, define\nwhat meaning results from evaluating any phrase of the language. The definition thus constitutes a\nformal specification for an implementation. The authors have developed enough of their theory to\ngive sense to their rules of evaluation.The Definition of Standard ML is the essential point of\nreference for Standard ML. Since its publication in 1990, the implementation technology of the\nlanguage has advanced enormously and the number of users has grown. The revised edition includes a\nnumber of new features, omits little-used features, and corrects mistakes of definition.","torrent":{"xt":"urn:btih:20014541fa4cbe4ddd6b12216e3065f0ab087d2c","amp;dn":"MIT.Press.The.Definition.of.Standard.ML.Revised.Edition.%281997%29.e","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20014541fa4cbe4ddd6b12216e3065f0ab087d2c","infoHashBuffer":{"type":"Buffer","data":[32,1,69,65,250,76,190,77,221,107,18,33,110,48,101,240,171,8,125,44]},"announce":[],"urlList":[]}}