{"title":"Ghost.Adventures.S07E28.Goldfield.Hotel.Redemption.HDTV.x264-tNe","uid":8289594,"size":183543310,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:201dbc4000df9fe85291181dfcc1a39f95bf5712&amp;dn=Ghost.Adventures.S07E28.Goldfield.Hotel.Redemption.HDTV.x264-tNe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LegendET","files":5,"time":1364014494,"description":"!!!PLEASE READ!!!PLEASE READ!!!PLEASE READ!!!PLEASE READ!!!\n\n*******A Few Friendly Reminders for the Peer-to-Peer*******\n \n \n- Users must seed back to a ratio of at least 1.5:1. Only\n  1:1 does not keep the file(s) going as only about 90% of\n  that was useable data to others. 2:1 would be wonderful.\n  If any user does not like having to pay it forward then\n  go to a file locker. Simple as that.\n \n- Users must know how to rename a file. Not everything is\n  going to be named how one likes as different people go by\n  different television episode guides. Unless there are\n  numerous sources provided to support the claim, comments\n  may possibily confuse other users. Recommended to only\n  rename the file to ones own liking after seeding is done.\n  Also note that the episode name is not as important as the\n  season and episode numbers. \n \n- Users must have patience. Not everything is going to be\n  released instantaneously. Cappers are NOT machines, they\n  are real people with real lives; jobs; school; families;\n  other things far more important. There are also technical\n  flaws that sometimes occur in a recording which render the\n  whole video completely useless. A capper then has to wait\n  for a re-airing to attempt getting a clean recording.\n \n- Users should know that not everything is going to make it\n  to their favored torrent site. There are hundreds, if not\n  thousands, of websites on the internet where users can\n  find all kinds of releases with download options. Also it\n  should be known, and accepted, that some things just don't\n  ever get released at all (technical flaws and no re-air).\n \n- Users should know how to convert formats. Not everything\n  will be released in the format of choice. If users took\n  the time to learn how to use torrents, then they can take\n  a little more time to learn how to convert file formats.\n  This also goes for archive files and knowing how to mount\n  or extract them. Remember, this is the internet, and there\n  really is plentiful amounts of websites on it with all the\n  information needed to learn these things.\n \n- Try to comment on video/audio quality only or mention any\n  serious technical flaws such as distorted video segments\n  or major synchronization issues throughout the entire file.\n  Comments of commercials in the video is alright as a heads\n  up to other users.\n \n \nJust remember those who provide entertainment to the users\nare volunteers doing everyone a favor. There are going to\nbe flaws as we are only human. If it's not done to a users\nsatisfaction, then they should try doing it themselves. \n\n \nAdditional Notes:\n \n- Regarding RAR files that we get from scene. Disgusted and\n  tired of so many complaints about it from users yet they\n  have no idea why it is used. There have been a couple users\n  attempting to explain the reason for them, but no one has\n  been correct.\n \n  It should be common sense, but will spell it out now...\n \n  It is impossible to upload an incomplete file. It would\n  have to be written over again with each bit of progress.\n  The RAR files are so that completed parts can upload while\n  the recording and encoding is still going. The RAR files\n  are how users can get some shows within 10 minutes after\n  airing. And that's when it reaches P2P, the bottom of the\n  sharing process. The actual release time was likely only 2\n  minutes after air.\n \n  The use of RAR files is also in case there is a disruption\n  in the connection while uploading. Upload can resume at the\n  last RAR part instead of starting from the beginning again.","torrent":{"xt":"urn:btih:201dbc4000df9fe85291181dfcc1a39f95bf5712","amp;dn":"Ghost.Adventures.S07E28.Goldfield.Hotel.Redemption.HDTV.x264-tNe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"201dbc4000df9fe85291181dfcc1a39f95bf5712","infoHashBuffer":{"type":"Buffer","data":[32,29,188,64,0,223,159,232,82,145,24,29,252,193,163,159,149,191,87,18]},"announce":[],"urlList":[]}}