{"title":"Supramolecular Chemistry at Surfaces - David B. Amabilino","uid":15140923,"size":32364964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21a701729200ebdc8fcdce4530d819de84bf5b5f&amp;dn=Supramolecular+Chemistry+at+Surfaces+-+David+B.+Amabilino&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467198625,"description":"Supramolecular Chemistry at Surfaces - David B. Amabilino (RSC, 2016).pdf\r\n\r\nISBN 978-1-84973-952-8\r\n\r\nSupramolecular chemistry provides a versatile approach for modifying the structure and function of surfaces, including the formation of clusters, monolayers and films. This can be used in a variety of applications from porous surface systems, to modifiers of interface energy and sensor-based systems.\r\n\r\nSupramolecular Chemistry at Surfaces covers different methods of preparing and studying self-assembled structures at surfaces and interfaces. The book starts with a general introduction concerning the nature of surfaces followed by specific sections discussing different techniques to characterise surface-based supramolecular systems. Each chapter then goes on to address different surface systems including the surface of water; physisorbed layers at interfaces; chemisorbed layers at interfaces; polyelectrolyte systems; thin films; dynamic systems; and patterning.\r\n\r\nWritten by a leading expert in the field, this is the first book to give a multidisciplinary view of the supramolecular aspects of interfaces providing the reader with an objective summary of all the deposition methods and their characterisation. The book will appeal to students and researchers in supramolecular chemistry, nanoscience, polymer chemistry and physics, surface science and materials science","torrent":{"xt":"urn:btih:21a701729200ebdc8fcdce4530d819de84bf5b5f","amp;dn":"Supramolecular+Chemistry+at+Surfaces+-+David+B.+Amabilino","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21a701729200ebdc8fcdce4530d819de84bf5b5f","infoHashBuffer":{"type":"Buffer","data":[33,167,1,114,146,0,235,220,143,205,206,69,48,216,25,222,132,191,91,95]},"announce":[],"urlList":[]}}