{"title":"(LEAWO) Total Media Converter Ultimate 6.0.0.0","uid":7967031,"size":72681160,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:22cde998b0b6e7835722b8d08bbe6ca13ec99213&amp;dn=%28LEAWO%29+Total+Media+Converter+Ultimate+6.0.0.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LifeIsCode","files":3,"time":1356708729,"description":"A total media converter solution provider that can perfectly convert between all common video/HD video/audio formats, e.g. AVI, MP4, WMV, AVCHD, FLV, RMVB, MPEG, MP3; convert AACS and BD+ Blu-ray discs; convert various DVD formats, e.g. DVD-5, DVD-9, CSS-DVD; create high quality DVD and recordable Blu-ray discs with wide selection of menu templates, background pictures and music; and accelerate online flash video playback and downloading process.\n\n\nThis total media converter bundle also presents flexible video importing ways from file or folder, codec parameter settings, powerful video editing features, CPU core controls and profile quick search, external subtitle importing and so on to meet the higher video processing demands for advanced users.\n\nConvert among popular media files\nConvert between regular video (AVI, MP4, WMV, FLV, RMVB, MPEG, 3GP, MKV, etc.), HD video(AVCHD, MOD/TOD, MTS/M2TS)and audio (MP3, WMV, WAV, AAC, OGG, M4A, etc.)\n\nConvert encrypted DVD\nRip and convert CSS protected DVD to all kinds of popular video formats for playback on various portable devices like iPod Touch, iPhone 4, PSP, PS3, Zune, Apple TV, Mobile Phone, Tablet PC, etc.\n\nConvert encrypted Blu-ray\nUpgraded with the enhanced ability to decrypt AACS and BD+ Blu-ray disc the latest MKB protection, which is higher enough to handle almost all the Blu-ray discs on market so far.\n\nImport multiple video sources\nImport source videos from DVD, Blu-ray and regular videosimultaneously. Either import single video file or import multiple video files at one time from a video folder.\n\nBurn and backup DVDs\nBurn all kinds of popular video formats to DVD disc, and more DVD output formats like DVD folder and ISO file is also supported. Backup DVD content on hard disk with high quality.\n\nBurn Blu-ray disc\nBurn video in a variety of formats to recordable Blu-ray disc and provides more output options like Blu-rayfolder and ISO file.\n\nDIY DVD and Blu-ray disc\nDIY disc menu from wide selection of templates, background pictures, background music and DIY disc volume label, disc type(DVD-5/9 or BD-25/50), video size and video quality, etc.\n\nAccelerate online video\nSpeed up online video playback using the built-in accelerator and enjoy the smooth watching experience via the embedded flash video player.\n\nDownload online video\nDownload online videos from YouTube, Google Video, MySpace and other video-sharing sites fast at the same time you are watching them. Categorize to your preferred PC folder for future reference.\n\nConvert the downloaded online video\nProceed to convert the downloadedonline videos to popular video formats for easy share on more portable gadgets.","torrent":{"xt":"urn:btih:22cde998b0b6e7835722b8d08bbe6ca13ec99213","amp;dn":"%28LEAWO%29+Total+Media+Converter+Ultimate+6.0.0.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22cde998b0b6e7835722b8d08bbe6ca13ec99213","infoHashBuffer":{"type":"Buffer","data":[34,205,233,152,176,182,231,131,87,34,184,208,139,190,108,161,62,201,146,19]},"announce":[],"urlList":[]}}