{"title":"The Allman Brothers - LIVE 03/26/2011 [320k MP3] NYC","uid":6960435,"size":411283131,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:232a84e4e025d4e43194c8809589dc90026e7b85&amp;dn=The+Allman+Brothers+-+LIVE+03%2F26%2F2011+%5B320k+MP3%5D+NYC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"smbdownload","files":-1,"time":1326741474,"description":"The last show of the 2011 Beacon Run was also the 200th time the Allman Brothers Band played the legendary theater, and they delivered a fiery show that was worthy of such a historic occasion!\n\nThe band came out strong in the first set, laying down mighty version of &quot;Ain't Wastin' Time No More&quot; and &quot;Every Hungry Woman&quot; with great vocals from Gregg and tight playing by the whole band.  After a jazzy &quot;Kind of Bird,&quot; they brought out blues legend Hubert Sumlin, as well as harmonica ace Hook Herrera and Bruce Katz from Gregg's band on keys.  This supersized blues orchestra wailed on &quot;Smokestack Lightning&quot; and &quot;Key To The Highway,&quot; delighting the crowd.\n\nThe fun continued when the one and only Dr. John took the stage to add his unique New Orleans flavor.  &quot;I Walk On Gilded Splinters&quot; is one of the Night Tripper's signature tunes, and a staple for the current ABB, so it was a natural fit.  The Brothers played it in Dr. John's original style which toned it down to a quieter, darker, moodier New Orleans voodoo theme that had the audience absolutely spellbound.  The versatile Doctor switched to guitar for the New Orleans tune &quot;Let The Good Times Roll,&quot; then returned to keyboards for a raucous version of his &quot;Right Place, Wrong Time&quot; that brought the house down! With Susan and Nigel Hall added background vocals this song wailed and screamed with Derek and Warren taking turns at adding their talent to an all time classic!\n\nThe first set was a tough act to follow, but the ABB stepped up in the second set, which kicked off with a powerful &quot;Dreams&quot; that saw Warren take the main solo.  &quot;Black Hearted Woman&quot; was an extended improvisational showcase, topping other excellent versions from this run.  &quot;Who's Been Talking&quot; was a nice return to the blues flavor of the first set, with Herrera and Katz joining in, and guitarist David Grissom added some tasty licks to &quot;It Takes A Lot To Laugh, It Takes A Train To Cry&quot; and &quot;One Way Out.&quot;\n\nBruce Katz sat in on piano for an epic &quot;Jessica,&quot; contributing some Chuck Leavell licks as well as some of his own.  That brought the second set to a close, and the only thing that could top it was a &quot;Whipping Post&quot; encore.  After a brief jam/tease of &quot;Little Martha,&quot; the ABB brought the thunder, wrapping up the run with a relentless &quot;Post&quot; that put an exclamation point on a great run!\n\nThe Allman Brothers Band\n2011-03-26\nBeacon Theater\nNew York, NY\n\nOFFICIAL DOWNLOAD [320k MP3]\n\nDisc One\n\n1. Hot'Lanta (5:35)\n2. Ain't Wastin' Time No More (7:41)\n3. Midnight Rider (3:33)\n4. Every Hungry Woman (7:15)\n5. Kind Of Bird (16:49)\n6. Smokestack Lightning (5:32) @#$\n7. Key To The Highway (5:19) @#$\n8. I Walk On Gilded Splinters (6:20) %\n9. Let The Good Times Roll (6:10) %\n10. Right Place, Wrong Time (8:00) %&amp;*\n\nDisc Two\n\n1. Dreams (11:02)\n2. Black Hearted Woman (14:33)\n3. Who's Been Talking (11:00) #$\n4. It Takes A Lot To Laugh, It Takes A Train To Cry (6:34) ^*\n5. One Way Out (6:32) ^\n\nDisc Three\n\n1. Crowd (1:33) \n2. Jessica (20:11) $\n\nE: 3. Little Martha (1:20)\n   4. Whipping Post (16:46)\n\n@ = w/Hubert Sumlin, guitar\n# = w/ Hook Herrera, harmonica\n$ = w/ Bruce Katz, piano\n% = w/ Dr. John, keyboards, guitar and vocals\n&amp; = w/ Susan Tedeschi and Nigel Hall, backing vocals\n* = w/ James van de Bogert, drums\n^ = w/ David Grissom, guitar","torrent":{"xt":"urn:btih:232a84e4e025d4e43194c8809589dc90026e7b85","amp;dn":"The+Allman+Brothers+-+LIVE+03%2F26%2F2011+%5B320k+MP3%5D+NYC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"232a84e4e025d4e43194c8809589dc90026e7b85","infoHashBuffer":{"type":"Buffer","data":[35,42,132,228,224,37,212,228,49,148,200,128,149,137,220,144,2,110,123,133]},"announce":[],"urlList":[]}}