{"title":"Kula Shaker - K [1996]","uid":9460531,"size":346721108,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:24f88d90646c4c6fc6aefca78cc69e3e88b96fee&amp;dn=Kula+Shaker+-+K+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389344341,"description":"Review by Stephen Thomas Erlewine  [-]\nBy the mid-'90s, most bands had abandoned the sounds and sensibilities of late-'60s psychedelia, which is what makes Kula Shaker's debut album, K, such a weird, bracing listen. The band doesn't simply revive the swirling guitar and organ riffs of psychedelia, it embraces the mysticism and Eastern spirituality that informed the music. On both &quot;Tattva&quot; and &quot;Govinda,&quot; lead singer Crispian Mills has adapted portions of Sanskrit text for the lyrics, chanting Indian mantras without a hint of embarrassment. Similarly, Kula Shaker are unashamed about their devotion to Hendrix, Traffic, and the Beatles, cutting their traditionalist tendencies with an onslaught of volume, overdriven guitars, and catchy melodies -- though they have a song called &quot;Grateful When You're Dead,&quot; all of their psychedelic sensibilities derive from British rock, not the more experimental American counterpart. Kula Shaker may play well -- they have a powerful rush that makes you temporarily forget how classicist their music actually is -- but they still have trouble coming up with hooks. About half the record (&quot;Hey Dude,&quot; &quot;Tattva,&quot; &quot;Govinda,&quot; &quot;Grateful When You're Dead&quot;) has strong melodies, while the rest just rides by on the band's instrumental skills. Consequently, much of K doesn't stick around once the record is finished, but the singles remain excellent blasts of colorful neo-psychedelia. (3/5)","torrent":{"xt":"urn:btih:24f88d90646c4c6fc6aefca78cc69e3e88b96fee","amp;dn":"Kula+Shaker+-+K+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24f88d90646c4c6fc6aefca78cc69e3e88b96fee","infoHashBuffer":{"type":"Buffer","data":[36,248,141,144,100,108,76,111,198,174,252,167,140,198,158,62,136,185,111,238]},"announce":[],"urlList":[]}}