{"title":"Cities Skylines v1.0 [CODEX]","uid":12228666,"size":2189361152,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:254ba0144850376e3855f0dd05adc12517a432a2&amp;dn=Cities+Skylines+v1.0+%5BCODEX%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"djupload","files":5,"time":1439522327,"description":"Cities: Skylines is a single player open-ended city-building simulation. Players engage in urban planning by controlling zoning, road placement, taxation, public services, and public transportation of an area. Players work to maintain the city's budget, population, health, happiness, employment, pollution (air, water, and noise), traffic flow, and other factors.\n\nPlayers start with a plot of land - equivalent to a 2 km x 2 km area - along with an interchange exit from a nearby freeway, as well as a starting amount of in-game money. The player proceeds to add roads and residential, industrial, and commercial zones and basic services like power, water, and sewage as to encourage residents to move in and supply them with jobs. As the city grows beyond certain population tiers, the player will unlock new city improvements including schools, fire stations, police stations, health care facilities and waste management systems, tax and governing edicts, and other features to manage the city. One such feature enables the player to designate parts of their city as districts. Each district can be configured by the player to restrict the types of developments or enforce specific regulations within the district's bounds, such as only allowing for agricultural industrial sectors, offering free public transportation to residents in the district to reduce traffic, or increased tax levels for high commercialized areas. Buildings in the city have various development levels that are met by improving the local area, with higher levels providing more benefits to the city. For example, a commercial store will increase in level if nearby residents are more educated, which in turn will be able to allow more employees to be hired and increase tax revenue for the city. When the player has accumulated enough residents and money, they can purchase neighboring plots of land, allowing them to build up 8 additional parcels out of 25 within a 10 km x 10 km area. The parcel limitation is to allow the game to run across the widest range of personal computers, but players can use Steam Workshop modifications to open not only all of the game's standard 25 tile building area, but the entire map (81 tiles, 324 square kilometers)","torrent":{"xt":"urn:btih:254ba0144850376e3855f0dd05adc12517a432a2","amp;dn":"Cities+Skylines+v1.0+%5BCODEX%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"254ba0144850376e3855f0dd05adc12517a432a2","infoHashBuffer":{"type":"Buffer","data":[37,75,160,20,72,80,55,110,56,85,240,221,5,173,193,37,23,164,50,162]},"announce":[],"urlList":[]}}