{"title":"Spent - 2 Albums (1994-1996) [FLAC]","uid":9532469,"size":628567754,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2562026fd8ded313554f6ea6f09046942234fb56&amp;dn=Spent+-+2+Albums+%281994-1996%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1390867695,"description":"\n  Spent - 2 Albums (1994-1996) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  1995 Songs of Drinking and Rebellion\n  1996 A Seat Beneath the Chairs\n\n  Spent have created a new breed of tunes that are catchy in spite of their ever-changing textures, tempos, themes and keys. Within seconds, Spent songs can make an effortless transition from slow, beautiful melodies with subtle male/female harmonies to near &quot;pit&quot; - inducing tempos with dissonance and a touch of distorted guitar thrown in to barely mask the singer's slightly frustrated vocalization of cryptic lyrics. Just when a chorus becomes familiar enough to sing along to, a song will shift into a new focus, which soon becomes just as catchy as the first. Versatile, observant, clever, restless, energetic, determined, empathetic and diverse is the sound of Spent.\n\n  Joe, Annie, John and Ed (Spent, natch) were busy following the release of 95's Songs of Drinking and Rebellion touring across the States with hardly a minute to rest and relax in their lovely habitat, Jersey City. They did, however, have time to write some great new songs, firstly the EP &quot; Umbrella Wars.&quot; From the relaxed, maraca-driven catchy beat of &quot;Umbrella Wars&quot; to the gentle acoustic feel of &quot;Angeleva,&quot; Spent had diversified their instrumentation as well as their sound, but the end result still being the same as Spent of Yore: a passionate and earnest sound that simply rocks.\n\n  June '96 saw the band at Rare Book Room, Brooklyn, NY, with wonderkid Nicolas Vernhes at the helm, recording their second full-length album, A Seat Beneath the Chairs. This new release catapults the Spent sound into bold new sonic territory. While remaining loyal to layered guitar interplay, varied male-female vocalizing and instantly hummmable songcraft, Spent had created a noticeably subdued, cohesive collection, worthy of repeated listening in order to fully take in all of its subtleties. From the gnarled wisfulness of &quot;Stumble Up the Stairs&quot; to the stark majesty of &quot;Until We Have Enough&quot;; from the unapologetic pop &quot;Under False Eyelids&quot; to the first rate instrumental &quot;No Sign of the Ponies,&quot; Spent continue to recreate and reveal themselves in a variety of melodic guises. Piano and clarinet (&quot;The Quarter Conspiracy&quot;), keyboards and Moog (&quot;The Pilot's Lament,&quot; &quot;He's Into Lonely&quot;) and trumpet (on the title track)also enlisted to flavor the album's already expansive musical palette. The band Toured with other keystone MERGE artists like Superchunk and Seam for much of the 90's.","torrent":{"xt":"urn:btih:2562026fd8ded313554f6ea6f09046942234fb56","amp;dn":"Spent+-+2+Albums+%281994-1996%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2562026fd8ded313554f6ea6f09046942234fb56","infoHashBuffer":{"type":"Buffer","data":[37,98,2,111,216,222,211,19,85,79,110,166,240,144,70,148,34,52,251,86]},"announce":[],"urlList":[]}}