{"title":"Bob Guiliani's The Basics Of Close-Up Photography [Tutorial] - ","uid":4731705,"size":1466308608,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:258d8c656f6e9d32beb8a3c35ee969fbe3446608&amp;dn=Bob+Guiliani%5C%27s+The+Basics+Of+Close-Up+Photography+%5BTutorial%5D+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"malestrom_HH","files":2,"time":1235066534,"description":" &lt;a href=&quot;http://www.image-upload.net/images/ccel7uytx47ovytiq72.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/ccel7uytx47ovytiq72.jpeg&lt;/a&gt;\n\nBob Guiliani's The Basics Of Close-Up Photography [Tutorial] \n\nThis tutorial is the field study of close-up and macro photography by master photographer and teacher Bob Guiliani. Field study of close-up and macro photography by master photographer and teacher Bob Guiliani. Bob spends much time reviewing the equipment needed for successful close-up and macro photography. He also examines the elements involved in creating elegant portraiture of flowers. (Which you could turn into beautiful art prints) You will learn many technical and practical tips from selecting the proper camera angle to creating perfect lighting on every exposure in all kinds of lighting situations.\n\nOther topics include:\n\n* When to use a flash * How &amp; where to position the flash * When to use tripod * Hand held examples are created * What time of day is best * What to do when it gets windy * When to use a polarizing filter * How to create a small hand held reflector - FREE Background selection * How to establish proper camera angle and lens selection\n\nThis presentation is jam packed with tips and ideas and is entirely filmed on location. Bob walks you through the woods in search of the perfect flower to photograph. Come along as Bob points out plants that are so small that you would never see them unless you were really looking. Discover what you are missing in life and get it in front of your camera. Even if you're a seasoned veteran this training film is a first class refresher course for creating fine art macro portraits. You will find yourself re-energized with your craft or profession. Re-discover your photography passion with the &quot;Basics of Close-up Photography&quot;. If you love flowers, find out how to photograph them for future crafting projects. (about 120 minutes)\n\nBob discusses several pieces of equipment he often uses in the field when he is taking nature photographyt images. Bob will also show you how you can find beautiful subjects for Nature Photography in your own backyard! (about 120 minutes)","torrent":{"xt":"urn:btih:258d8c656f6e9d32beb8a3c35ee969fbe3446608","amp;dn":"Bob+Guiliani%5C%27s+The+Basics+Of+Close-Up+Photography+%5BTutorial%5D+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"258d8c656f6e9d32beb8a3c35ee969fbe3446608","infoHashBuffer":{"type":"Buffer","data":[37,141,140,101,111,110,157,50,190,184,163,195,94,233,105,251,227,68,102,8]},"announce":[],"urlList":[]}}