{"title":"Coast to Coast AM March 15 2013","uid":8267318,"size":55691320,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:25d980dcee9d3788426b2a12cb9be6966a5740cd&amp;dn=Coast+to+Coast+AM+March+15+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1363540196,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-15-13\nHost: \tGeorge Noory\nGuests: \tOpen Lines, William Warwick\n\nGeorge Noory hosted an evening of Open Lines, offering a special 'evil' hotline for callers who wanted to share experiences when they looked into the eyes of evil. Robert from Santa Barbara, California, remembered the time he encountered a form of evil at a jazz club in Oregon. Robert, who was 25 at the time and attending law school, said he met a woman at the bar who emanated a palpable evil energy that caused him to feel like he would be in immediate danger if he was not cordial to her. He described his instincts kicking in and engaging the strange female in superficial conversation. Robert revealed that he later found out the woman was recruiting people to join a cult in Oregon.\n\nEugene, a truck driver traveling through St. Louis, recalled how as a teen he would stand in front of a mirror, stare at himself and wish to be the most evil person on the planet. Eugene admitted that he found pleasure in hurting people, noting the time he stabbed his best friend in the stomach at school and was arrested for assault with a deadly weapon. &quot;I actually felt like pulling [the knife] up to his chest and gutting him in the cafeteria,&quot; he said, noting that he believes there was a demonic force around him since childhood that contributed to his rage. Eugene said he found no happiness on this evil path and credited God's grace and his mother's prayers for turning his life around.\n\nDan in England claimed to have stared evil in the face prior to the beginning of our universe, when he witnessed two opposing universes collide and initiate the Big Bang explosion that gave birth to us. He and his ancient race had been exploring their universe and attempting to make contact with other intelligences, Dan explained. They eventually came across a consciousness located in an opposing universe of anti-matter and traveled into it, he continued. According to Dan, the resulting collision of the two universes set in motion the creation of our own universe and marked the origins of evil as well, Dan noted. The God of the Old Testament was a demiurge from the original anti-light / anti-matter universe, he revealed, adding how he and similar forces are trying to manifest a collapse of our universe down to a lower domain.\nBoomerang UFOs\n\nIn the first hour, researcher William Warwick| YouTube) talked about boomerang-shaped UFOs throughout history. &quot;The thing about the boomerangs is they come and they're here for a while... and then they're gone,&quot; he said. Warwick described footage an eyewitness named Terrell captured in 2007 that shows such a craft nearly collide with a military jet in the skies over Suffolk, Virginia. He revealed a connection between these boomerang UFOs and the Knights Templar, noting how the order had a cypher that included a chevron-shaped object with dots, or orbs, surrounding it. A tomb thought to belong to the family of Jesus also has a boomerang over a small circle, Warwick added, concluding that these objects go back to the most ancient of times.\n\nNews segment guests: Capt. Kelly Sweeney / Peter Davenport ","torrent":{"xt":"urn:btih:25d980dcee9d3788426b2a12cb9be6966a5740cd","amp;dn":"Coast+to+Coast+AM+March+15+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25d980dcee9d3788426b2a12cb9be6966a5740cd","infoHashBuffer":{"type":"Buffer","data":[37,217,128,220,238,157,55,136,66,107,42,18,203,155,230,150,106,87,64,205]},"announce":[],"urlList":[]}}