{"title":"Roberta Gambarini - Easy to Love (2006) [Jazz][mp3 320][schon55]","uid":5915703,"size":195143997,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:25f5bd14a1c4dd445e3df22a2ebb925ab04ae9bf&amp;dn=Roberta+Gambarini+-+Easy+to+Love+%282006%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":19,"time":1288216072,"description":"Roberta Gambarini - Easy to Love\nOriginal Release Date: 2006 \nAudio CD: June 6, 2006\nLabel: Now Forward Inc\nQuality: CBR 320 kpbs\n\nRecording: Jun 18-19, 2004\n\nRoberta Gambarini was a virtual unknown outside of Europe before coming to the United States and dazzling both seasoned jazz musicians and critics alike. Under the wing of Benny Carter for several years prior to his death in 2003, the Italian singer with an expressive, clear, and consistently swinging vocal style has seen her reputation spread widely, culminating in this initial American release. Her delightful take on the standard &quot;Easy to Love&quot; includes a bit of soft scatting in tandem with Chuck Berghofer's bass.  Her expressive interpretation of &quot;On the Sunny Side of the Street&quot; finds her scatting to each of the demanding solos from a recorded collaboration by Sonny Stitt, Dizzy Gillespie, and Sonny Rollins, as well as adding some original vocalese to each of the solos. She is just as effective handling Bill Evans' bittersweet ballad &quot;The Two Lonely People&quot; and Billy Strayhorn's overlooked gem &quot;Multi-Colored Blue.&quot; Tenor saxophonist James Moody is a special guest on &quot;Lover Man&quot; and the swinging &quot;Centerpiece,&quot; on the latter playing in unison with Gambarini and engaging in a friendly, often hilarious scat duet with her as well. With this first-rate 2006 release, Roberta Gambarini makes a strong case for consideration as one of the most impressive jazz vocalists to arrive on the scene over the previous two decades; her attractive voice, impeccable taste, and skills as an arranger make her impossible to resist. ~ AMG \n\nThose fortunate to have seen Roberta Gambarini perform have waited a long time for this release. I, for one, am thrilled with the outcome. Her song selection hints at her command of the American Songbook. The band(s) provides sophisticated support. The sound is clean and solid. Roberta's voice is rich, smooth, and faultless through her extensive range. Her pitch is spot on, her phrasing opens up the songs, and her time just swings. \n\nHaving placed 3rd behind Jane Monheit and Teri Thornton in the Thelonious Monk International Jazz Vocal Competition in 1998, she went on to win the jazz hearts and minds of musicians and jazz lovers at festivals and clubs across the U.S. - but contract issues in her native Italy prevented a U.S. release. With those issues resolved, and with the release of &quot;Easy to Love&quot;, Roberta Gambarini will finally be heard by the audience she deserves. Bruce C. Moore\n\nCredits:\nDizzy Gillespie (Arranger),\nChuck Berghofer, John Clayton (Bass),\nJoe La Barbera, Willie Jones III (Drums),\nRoberta Gambarini (Arranger, Vocals, Adaptation), \nTamir Hendelman (Piano, Arranger),\nGerald Clayton (Piano),\nJames Moody Sextet (Tenor Sax, Vocals, Guest Appearance)\n \nRoberta Gambarini - Easy to Love\n01  Easy to Love\n02  Only Trust Your Heart\n03  Lover Man\n04  On the Sunny Side of the Street\n05  Porgy, I's Your Woman Now / I Loves You, Porgy\n06  Lover Come Back to Me\n07  Two Lonely People, The\n08  Centerpiece\n09  Guess I'll Hang My Tears Out to Dry - (with James Moody)\n10  No More Blues\n11  Smoke Get's In Your Eyes / All The Things You Are\n12  Too Late Now\n13  Mulyi-Colored Blue - (Bonus Track)\n14  Monk's Prayer / Looking Back - (Bonus Track)","torrent":{"xt":"urn:btih:25f5bd14a1c4dd445e3df22a2ebb925ab04ae9bf","amp;dn":"Roberta+Gambarini+-+Easy+to+Love+%282006%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25f5bd14a1c4dd445e3df22a2ebb925ab04ae9bf","infoHashBuffer":{"type":"Buffer","data":[37,245,189,20,161,196,221,68,94,61,242,42,46,187,146,90,176,74,233,191]},"announce":[],"urlList":[]}}