{"title":"Steel Panther - Death To All But Metal","uid":4913975,"size":131971076,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2615092595d93790a4e1d34caebe39e483c5a8ed&amp;dn=Steel+Panther+-+Death+To+All+But+Metal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"2nafish","files":-1,"time":1243336665,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nThis music video is the censored version. \n\n\n\nSteel Panther (formerly known as Danger Kitty, Metal Shop and Metal Skool), is a Los Angeles, California glam metal band. Originally formed as Metal Shop, they're known for their energetic live show, the longest running heavy metal show on the Sunset Strip. Onstage, the band both pays tribute to and lampoons the heyday of 80's glam metal. The band's between-song comedy includes jests at conflict between band members, discussions of drugs, sex, and improvised humor with the crowd.\n\nIn May 2008, Steel Panther were finally signed to a record label called Universal Republic.\n\nThe album will be released June 9th, 2009, and was produced by Jay Ruston.\n\nThe first single &quot;Death To All But Metal&quot; premiered on iTunes Monday January 26th, 2009.\n\nThe band members have all adopted pseudonyms in the spirit of the bands they imitate. Their line up is billed as: drummer &quot;Stix Zadinia&quot; (real name Darren Leader), guitarist &quot;Satchel&quot; (real name Russ Parrish), singer &quot;Michael Starr,&quot; (real name Ralph Saenz) and bassist &quot;Lexxi Foxxx&quot; (real name Travis Haley).\n\nSaenz is the former lead singer for the Van Halen tribute band the &quot;Atomic Punks&quot;, and was lead singer for L.A. Guns for a short period of time. Parrish was formerly the guitar player for the Atomic Punks and for the Rob Halford-fronted band, Fight. Leader and Parrish have another band of their own called the Thornbirds with Jeff Duncan of Armored Saint on guitar and bassist Dean Cameron, who also directed Metal Skool's &quot;Fat Girl&quot; video.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2615092595d93790a4e1d34caebe39e483c5a8ed","amp;dn":"Steel+Panther+-+Death+To+All+But+Metal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2615092595d93790a4e1d34caebe39e483c5a8ed","infoHashBuffer":{"type":"Buffer","data":[38,21,9,37,149,217,55,144,164,225,211,76,174,190,57,228,131,197,168,237]},"announce":[],"urlList":[]}}