{"title":"Is It Bill Bailey? Complete TV Series (1998)","uid":4526392,"size":1464647680,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:26f5bf1deed28169542cc68b5a70084785342809&amp;dn=Is+It+Bill+Bailey%3F+Complete+TV+Series+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"madstiv","files":-1,"time":1227369417,"description":"Is It Bill Bailey?\n\nThe complete 1998 TV Series, comprising of 6 x 30 minute episodes. Converted from VHS, so quality is about 7/10 - but still perfectly watchable.\n\nThese episodes have never been released officially on DVD to this date, and they have never been repeated on TV; So this is a must have for any Bill Bailey fan, and an excellent addition to any collection.\n\nSypnosis from Wikipedia...\n\n&quot;Is It Bill Bailey? was a stand up / sketch comedy series written by and starring Bill Bailey. One series of six episodes was produced and aired on BBC Two in 1998, and it has never been recommissioned or released on DVD. It was to have been repeated for the first time since original transmission on Dave from 23 September 2008, but was dropped from the schedules a few days before broadcast.\n\nEach episode featured Bailey performing stand-up comedy on stage, interspersed with sketches starring himself and other actors. As well as performing parodies of pop songs or performers, Bailey would deconstruct music from television shows such as Doctor Who or Starsky and Hutch.\n\nThe programme was produced by BBC Scotland and many of the sketches feature Scottish actors such as Forbes Masson and Ford Kiernan. Geraldine McNulty, Norman Lovett and Simon Pegg also feature. Additional material was also contributed by frequent collaborators Sean Lock and Martin Trenaman. The shows were directed by Edgar Wright, who went on to direct the sitcom Spaced and the films Shaun of the Dead and Hot Fuzz, all of which starred Simon Pegg. Many songs and routines featured in the show were first performed in his Cosmic Jam tour and TV show Asylum and several were later used during his Bewilderness tour.\n\nThe title is derived from the Rizla game (&quot;Guess Who&amp;#039;s You&quot;), the opening credits of the show showing Bill with a Rizla on his forehead, bearing his own name.&quot;\n\nI will seed as often as possible - However please note that due to a &quot;Fair Usage&quot; policy in place with my ISP, I am unable to seed between the hours of 6pm-midnight British time.\n\nPlease seed when completed, and enjoy :-)\n\nFeedback appreciated.","torrent":{"xt":"urn:btih:26f5bf1deed28169542cc68b5a70084785342809","amp;dn":"Is+It+Bill+Bailey%3F+Complete+TV+Series+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26f5bf1deed28169542cc68b5a70084785342809","infoHashBuffer":{"type":"Buffer","data":[38,245,191,29,238,210,129,105,84,44,198,139,90,112,8,71,133,52,40,9]},"announce":[],"urlList":[]}}