{"title":"Birth of the Federation","uid":4812852,"size":623227054,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:26f86e5443becf608b6b24b72cc0eb372ca01e9a&amp;dn=Birth+of+the+Federation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Amazing69","files":5,"time":1238440696,"description":"Star Trek: The Next Generation, Birth of the Federation is the first PC CD-ROM strategy game based on the rich Star Trek universe! Forged from the cultures, time lines, events and technologies of the hit TV show Star Trek: The Next Generation, this turn-based epic emphasises resource management, combat and diplomacy. Control one of five major alliances: Federation, Klingon, Romulan, Ferengi or Cardassian, each with its own set of abilities, strengths and weaknesses. Encounter over 30 exotic races. And beware, there lurks the potential for a Borg invasion--threatening all players! \n\nManufacturer's Description\nIf a long, complicated journey into Star Trek minutiae sounds like your idea of a perfect weekend, Birth of the Federation is certainly worth the time investment required to play it. That said, this is a very deep strategic game, too abstract and complicated to appeal to the casual gamer. \nSimilar to space-expansion games like Master of Orion, Birth of the Federation is a race to gain control of the galaxy. In this case, Klingons, Romulans, Ferengis and Cardassians compete with Jean-Luc Picard and the Federation. \n\n\n*Develop your intelligence and use diplomacy to weave a trail of alliances or enemies\n\n*Rise or fall by your ability to develop or acquire technology\n\n*Manage a complex economy of empire-level resources, solar systems, and trade routes\n\n*Construct, maintain, and refit a Starship fleet\n\n*Play against up to 5 players via LAN, direct connect, modem, or Internet\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Birth_of_the_Federation&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Birth_of_the_Federation&lt;/a&gt;\n\n\n\nps. Fully patched up with the last Offical update from microprose 1.02v\n\n\nHave fun! :)","torrent":{"xt":"urn:btih:26f86e5443becf608b6b24b72cc0eb372ca01e9a","amp;dn":"Birth+of+the+Federation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26f86e5443becf608b6b24b72cc0eb372ca01e9a","infoHashBuffer":{"type":"Buffer","data":[38,248,110,84,67,190,207,96,139,107,36,183,44,192,235,55,44,160,30,154]},"announce":[],"urlList":[]}}