{"title":"Crossroads: Labor Pains of a New Worldview | FULL MOVIE","uid":8078641,"size":866041129,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2764a96648901cd3c5fc71a7ba07ed64b2d399cf&amp;dn=Crossroads%3A+Labor+Pains+of+a+New+Worldview+%7C+FULL+MOVIE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HydraMind","files":-1,"time":1359442942,"description":"Crossroads on FB:\n[Like] *Crossroads* on FB to Get Updates about *Crossroads* incl. Video Clips, Extras, Discussions on Crossroads' Topics &amp; More... Â»\n\n\nCROSSROADS SYNOPSIS:\n*Crossroads: Labor Pains of a New Worldview* is a documentary exploring the depths of the current human condition and the emergence of a worldview that is recreating our world from the inside out.\n\n\nWeaving together insights and findings from biology, psychology, network science, systems science, business, culture and media, the film reveals the inner workings of the human experience in the 21st century, urging viewers to step out of the box and challenge their own assumptions about who we really are, and why we do what we do.\n\n\n*Crossroads* places evolutionary context to today's escalating social unrest, natural disasters, and economic failures. It illuminates the footsteps of an integrated worldview, penetrating its way through the power of social networks to the forefront of our personal and collective awareness.\n\n\nA refreshing reality check for all viewers and a clarion call for those who carry the seeds of the emerging worldview.\n\n\nScientists and thinkers featured in *Crossroads* include: Amit Goswami, Neale Donald Walsch, Elisabet Sahtouris, Bruce Lipton, Peter Joseph, Caroline A. Miller, Nicholas Christakis, James Fowler, Michael Laitman, Ervin Laszlo, Dean Radin, Dave Sherman, Annie Leonard, Jairon G. Cuesta, and John St. Augustine.\n\n\nABOUT CROSSROADS' FILMMAKER:\nJoseph Ohayon, a filmmaker, writer and speaker based in Israel and New York, is best known for his relentless quest to put pieces together and look at the big picture. Joseph directs, writes, and hosts documentaries and talk shows on Israeli and US television, and also lectures on the need to adapt to an increasingly interdependent world.\n\n\nCrossroads Official Site: http://www.crossroadsfilm.com","torrent":{"xt":"urn:btih:2764a96648901cd3c5fc71a7ba07ed64b2d399cf","amp;dn":"Crossroads%3A+Labor+Pains+of+a+New+Worldview+%7C+FULL+MOVIE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2764a96648901cd3c5fc71a7ba07ed64b2d399cf","infoHashBuffer":{"type":"Buffer","data":[39,100,169,102,72,144,28,211,197,252,113,167,186,7,237,100,178,211,153,207]},"announce":[],"urlList":[]}}