{"title":"World Religions - The Great Faiths Explored &amp; Explained","uid":8837170,"size":260720348,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2790593b1e74499216641d39900598c8b96d0149&amp;dn=World+Religions+-+The+Great+Faiths+Explored+%26amp%3B+Explained&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1377150980,"description":"Scanned at 200dpi, converted to PDF\n &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/world-religions-john-bowker/1115354150?ean=9780756617721&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/world-religions-john-bowker/1115354150?ean=9780756617721&lt;/a&gt;\n\nOverview\nTaking a refreshing new approach to understanding different faiths, World Religions looks at the beliefs and practices of many different religions, including Christianity, Judaism, Hinduism, Buddhism, Jainism, Sikhism and Islam.\n\nAuthor Biography: John Bowker's books include The Meanings of Death, the Oxford Dictionary of World Religions, and DK's God: A Brief History.\n\nFrom School Library Journal\nYA. An easy-to-follow, pictorial resource that is overflowing with information. Colorful pictures enhance each page with virtually every detail identified via arrows and described in a detailed caption. Each chapter begins with a succinct introduction and is followed by one-or-two page sections that explain the basic tenets of the faith, symbols, events, people, buildings, works of art, and the differences and similarities to other religions. Hinduism, Buddhism, Judaism, Christianity, and Islam are included as are Jainism, Sikhism, Chinese and Japanese religions, and Native religions. The time line places key figures and events of one faith in relation to important people of another belief. Maps identify locations of sacred sites and the spread of the religion. Pages that include tall pictures are printed sideways across the double-page spread. This means the illustrations can be larger and clearer, but it is awkward for readers, who must constantly turn this oversized volume around. However, this is a visual feast that will be useful in most collections.\n\nFrom Library Journal\nBowker (divinity, Gresham Coll., London) has produced two very different books, though both are focused on world religion. The Oxford Dictionary, whose entries often lack information on etymology and pronunciation, is actually a one-volume desktop encyclopedia for ready reference. Combining brevity of exposition with a massive number of entries in an attempt to be dictionary-like, the work suffers from trying to be comprehensive in breadth of coverage instead of depth. The psychology of religion is discussed in a half-page, for instance, and the Church Fathers get only two sentences. In addition, the entries are uneven in quality; one has the feeling that the 80 contributors are each writing according to his or her own personal interests and styles. Despite these idiosyncrasies, the work is a solid reference source for people who want to know only the barest of facts about any religious topic. In World Religions, on the other hand, one has the feeling that Bowker, now the author, is finally freed to range over what he wants to say and how he wants to say it. This book is a bold attempt to meld religious information with expressive art and to use the art as a tool for pedagogy. Each religion is represented by a few brilliantly illustrated icons, paintings, or sculptures, which the author painstakingly annotates to illuminate their theologies and deepen one's insight. Whether he is using Michelangelo's Final Judgment to explain Christian eschatology or a handscroll of Chou Ch'en to explain Taoist concepts of immortality, the emphasis upon the visual makes these religions vibrant and intriguing. There are surprising discrepancies between the two works. World Religions has generous discussions of the ancient Egyptian, Greek, Roman, Norse, and Celtic religions, topics not even included in the Oxford Dictionary. There are also variations of names. Ultimately, World Religions is the more commendable publication, though both books are recommended for most libraries.","torrent":{"xt":"urn:btih:2790593b1e74499216641d39900598c8b96d0149","amp;dn":"World+Religions+-+The+Great+Faiths+Explored+%26amp%3B+Explained","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2790593b1e74499216641d39900598c8b96d0149","infoHashBuffer":{"type":"Buffer","data":[39,144,89,59,30,116,73,146,22,100,29,57,144,5,152,200,185,109,1,73]},"announce":[],"urlList":[]}}