{"title":"Nanotechnology and Health Risk - Eric Lichtfouse et al.","uid":15104053,"size":7350837,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27925af5dacb0e94bcb96a529e81b06ce21b6826&amp;dn=Nanotechnology+and+Health+Risk+-+Eric+Lichtfouse+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466972137,"description":"Nanotechnology and Health Risk - Eric Lichtfouse et al. (Springer, 2012).pdf\r\n\r\nISBN 978-94-007-2441-9\r\n\r\nEnvironmental chemistry is a fast developing science aimed at deciphering fundamental mechanisms ruling the behaviour of pollutants in ecosystems. Applying this knowledge to current environmental issues leads to the remediation of environmental media, and to new, low energy, low emission, sustainable processes. Nanotechnology applications for alternative energies such as solar power, fuel cells, hydrogen and lithium batteries are reviewed in the first section. Recent investigations on carbon nanotubes, nanocatalysts and cyclodextrins disclose unprecedented techniques to monitor and clean pollutants such as greenhouse gases, heavy metals, pesticides, pathogens occurring in water, air and soil. The second section reviews the risks for human health of critical pollutants such as endocrine disruptors, dioxins and heavy metals contaminating seafood and sediments. An exhaustive review of DDT isomers reveals unexpected mechanisms of DDT transfer to fishes. A chapter on pollutant geochronology using river sedimentary archives provides novel insights on pollution history since the beginning of the anthropocene.\r\n\r\nThis book will be a valuable source of information for engineers and students developing novel applied techniques to monitor and clean pollutants in air, wastewater, soils and sediments","torrent":{"xt":"urn:btih:27925af5dacb0e94bcb96a529e81b06ce21b6826","amp;dn":"Nanotechnology+and+Health+Risk+-+Eric+Lichtfouse+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27925af5dacb0e94bcb96a529e81b06ce21b6826","infoHashBuffer":{"type":"Buffer","data":[39,146,90,245,218,203,14,148,188,185,106,82,158,129,176,108,226,27,104,38]},"announce":[],"urlList":[]}}