{"title":"Inside the Living Body (720p, HDTVRip, eng)","uid":4468024,"size":4695283473,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:28d3110352f5a6812cdef95f61b4bca9771365cc&amp;dn=Inside+the+Living+Body+%28720p%2C+HDTVRip%2C+eng%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ranak","files":1,"time":1224994701,"description":"Genre: Documentary\n\nDescription: The story of a human life, from first breath to last. Told from \nwithin the body\n\nFull description: From our first cry to our last breath, our bodies undergo a continuous second-by-second transformation. Every move we make and every outside stimulus triggers a reaction through the skin, bones, organs, muscles and cells. We breathe, on average, 700 million breaths in a lifetime; an adult skeleton is replaced every seven to 10 years; we shed as many as 30,000 dead skin cells every minute; and the food we eat travels 30 feet (9 meters) on its journey through our bodies. Now, the National Geographic Channel (NGC) takes you beneath the skin to reveal how our bodies evolve from birth to old age, and the amazing biological systems we need to thrive. From the producers of NGC's critically acclaimed In the Womb series, Inside the Living Body traces one &quot;everywoman's story&quot;, using milestones to examine the everyday workings of a living, functioning body in ways not seen on television until now. Cutting-edge miniature endoscopic HD cameras delve deep inside the mouth, throat, heart, lungs, digestive tract, brain and reproductive organs to shed new light on how and why our bodies do what they do. Stunning photography in this two-hour special reveals universal moments in human development at the most minute level, providing insight into both our own individual metamorphosis and our shared human experiences.\n\nCover: http://simz.at.tut.by/Cover.jpg","torrent":{"xt":"urn:btih:28d3110352f5a6812cdef95f61b4bca9771365cc","amp;dn":"Inside+the+Living+Body+%28720p%2C+HDTVRip%2C+eng%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28d3110352f5a6812cdef95f61b4bca9771365cc","infoHashBuffer":{"type":"Buffer","data":[40,211,17,3,82,245,166,129,44,222,249,95,97,180,188,169,119,19,101,204]},"announce":[],"urlList":[]}}