{"title":"Island Press Fundamentals of Sustainable Dwellings 2012 RETAIL e","uid":8214329,"size":38290785,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2958be77656d20cd67723d13eb076a55291c86ce&amp;dn=Island+Press+Fundamentals+of+Sustainable+Dwellings+2012+RETAIL+e&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BlackTar","files":3,"time":1362310896,"description":"        /                                                 .        /\n       /  :______  _____/_        _/   __     ___  ____/  __   /  \n      /    \\    /      /   /  /   _/  __:/   /      /   /    \n     /      /    /   ___/   /  /        /                       \n    /    |      /      _         |    /   //  /     /        |   \n        _    _        /   //   /  .    _   /  /   /   \\  /   /       _.\n    :___|    /_____  /   /   /___|    /__/_____/   /_/__:___|    /\n   -+-       /      ./  _/  /        /            _/ alexandria. \\ /\n+---:       /                /        /                              /:---+\n:                   Fundamentals of Sustainable Dwellings                     :\n+-+                                                                         +-+\n  :    SUB TITLE: -                                                         :\n  :       AUTHOR: Avi Friedman                                              :\n  :    PUBLISHER: -                                                         :\n  :   CATEGORIES: -                                                         :\n  : RELEASE DATE: 2012-10-22               PUBLISH DATE: 2012-03-12         :\n  :      ISBN-10: 1597268070                      PAGES: 352                :\n  :      ISBN-13: 9781597268073                LANGUAGE: English            :\n  +-------------------------------------------------------------------------+\n\n   Despite a prolonged slump in the housing market, the demand for           \n   residential green building remains strong. More than ever,                \n   professionals need reliable information about how to construct or         \n   retrofit livable, sustainable, and economical homes. With Fundamentals    \n   of Sustainable Dwellings, Avi Friedman provides that resource. While      \n   other books on residential green building are often either superficial    \n   or overly technical, Friedman gets it just right, delivering an           \n   illustrated, accessible guide for architects, developers, home            \n   builders, codes officials, and students of architecture and green         \n   design. Friedman charts a new course for residential buildingone in       \n   which social, cultural, economic, and environmental values are part of    \n   every design decision. The book begins with a concise overview of green   \n   building principles, covering topics such as sustainable resources and    \n   common certification methods. Each following chapter examines a           \n   critical aspect of green home construction, from siting to waste          \n   management options. Friedman provides basics about energy-efficient       \n   windows and heating and cooling systems. And he offers innovative         \n   solutions like edible landscaping and green roofs. Friedman knows that    \n   in green building, ideas are only as good as their execution. So in       \n   each chapter valuable data is assembled and a contemporary project in     \n   which designers strove to achieve sustainability while adhering to        \n   real-world constraints is featured. The result is a practical guide for   \n   every professional in the burgeoning field of residential green building. \n\n  +-[ ALEXANDRIA ]----------------------------------------------------------+\n  : The Royal Library of Alexandria, or Ancient Library of Alexandria, in   :\n  : Alexandria, Egypt, was the largest and most significant great library   :\n  : of the ancient world. It flourished under the patronage of the          :\n  : Ptolemaic dynasty and functioned as a major center of scholarship from  :\n  : its construction in the 3rd century BC until the Roman conquest of      :\n  : Egypt in 30 BC. The library was conceived and opened either during the  :\n  : reign of Ptolemy I Soter (323-283 BC) or during the reign of his son    :\n  : Ptolemy II (283-246 BC).                                               /:\n  +-----------------------------------------------------------------:_/--/:+  \n    &quot;With knowledge, comes wisdom - and wisdom should be shared.&quot;       /\n","torrent":{"xt":"urn:btih:2958be77656d20cd67723d13eb076a55291c86ce","amp;dn":"Island+Press+Fundamentals+of+Sustainable+Dwellings+2012+RETAIL+e","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2958be77656d20cd67723d13eb076a55291c86ce","infoHashBuffer":{"type":"Buffer","data":[41,88,190,119,101,109,32,205,103,114,61,19,235,7,106,85,41,28,134,206]},"announce":[],"urlList":[]}}