{"title":"BUSTER KEATON A Hard Act to Follow (TV) [1987]","uid":6856757,"size":1099387889,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2a83b6caf327732eb3c52c557254c7a3387b6ca1&amp;dn=BUSTER+KEATON+A+Hard+Act+to+Follow+%28TV%29+%5B1987%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"ThorntonWilde","files":-1,"time":1322733504,"description":" &lt;a href=&quot;http://bayimg.com/naLGBaADD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/naLGBaADD&lt;/a&gt;\n\nBuster Keaton: A Hard Act to Follow (TV) (1987) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0172202/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0172202/&lt;/a&gt;\n\nRelease Date: 30 September 1987\n\nEpisode 01 From Vaudeville to Movies\nEpisode 02 Star Without a Studio\nEpisode 03 A Genius Recognized\n\nThis Thames Television biopic from film historians David Gill and Kevin Brownlow is an example of solid, traditional-style documentary-making at its best. There could hardly be a better subject than Buster Keaton - a giant of the silent era, arguably a more important artist than Chaplin - and with someone who was captured so comprehensively on film throughout his life, there is an abundance of material to chose from, an editor's delight. We see Keaton go from the palefaced jauntiness of his youth, to the lugubrious early middle age of alcoholism, with his dark-ringed sunken eyes, to the worn-out bald and wrinkled premature old age of his sixties (he died at just seventy). Made in 1987, A Hard Act to Follow has interviews with those who were close to Keaton, such as his widow Eleanor, actress Marion Mack and director Charles Lamont, plus an archive interview from the sixties with Keaton himself. It is therefore a valuable historical record, unrepeatable today. \n\nWith the best of his gags cherry-picked and assembled together in delirious montages, Keaton's brilliance as a visual comedian and director is all too manifest. He was undoubtedly the most cinematic of silent comedy directors, using space and movement within the frame to create stunts and gags on a scale unworkable outside the medium. In one stunt, a portable house becomes stuck on a railway line, and we expect an oncoming train to demolish it; but the train passes by on another track - only then for a second train to speed past and do the job. In another Keaton's character decides to commit suicide by stepping in front of a car at night. As the two headlights approach, they are revealed as belonging to a pair of motorcycles, which pass harmlessly by on either side of Keaton. \n\nKeaton's story is a marvellous and sad one. If his career was plotted like the graph of a share price, it would have the shape of a rapid, meteoric rise up to a spike at the time of the making of The General (1926), and then a quick drop followed by a long, slow inexorable decline with a few secondary peaks and troughs along the way. Born in 1895, he became a vaudeville child star in the family act - like Michael Jackson he was sometimes mistaken for an adult midget. He got into the movie business in 1917 by teaming up with Roscoe (Fatty) Arbuckle and making slapstick two-reelers. By 1919 Keaton was devising and co-directing his own pictures, and earning a thousand dollars a week plus a share of the profits. Through the mid-twenties he made the pictures he is famous for - Sherlock Jr., The Navigator, Seven Chances, Go West and The General - employing increasingly sophisticated shooting techniques and outrÃƒÂ© stunts that placed him in great personal danger. He suffered injuries throughout his body, several near-drownings, and once broke his neck, only discovering the fact during a medical exam twelve years later. \n\nIn those pictures Keaton had almost complete creative control under studio boss Joe Schenck, but then several things happened and it all changed. Firstly The General wasn't the box office success that its big budget required, and Schenck became cautious, eventually transferring Keaton into the control of MGM. Secondly the movie business was changing, becoming more industrialized and management-orientated, and of course sound was just around the corner. The net result of these changes for Keaton amounted to a clipping of his wings and the surrender of control to executives who tried to package him as product. In Episode Two of A Hard Act to Follow the decline from the exuberance of his heyday is all too obvious, and we see painful footage of his studio-inspired partnership with Jimmy Durante, a verbal comedian on a different wavelength to Keaton, and other attempts to make him into a regulation clown and fall guy. \n\nBy now Keaton had turned to drink, and by the mid-thirties he was reduced to devising gags for other artists, including the Marx Brothers. It comes as no surprise that he had a hand in creating one of their most famous gags - the stateroom scene in A Night at the Opera, where a succession of service staff cram into a tiny cabin, filling it to bursting point. Then in the fifties he was re-discovered by new audiences looking back nostalgically at the silent era. Many of his films were restored and re-screened, and he also became a performer again, within the new medium of television. The later footage of an aged Keaton is fascinating in that it shows the old vigour behind the ravaged face, and the fact that so many of his new acts were recapitulations of his silent movie gags - pure visual comedy, which still worked as well as ever.","torrent":{"xt":"urn:btih:2a83b6caf327732eb3c52c557254c7a3387b6ca1","amp;dn":"BUSTER+KEATON+A+Hard+Act+to+Follow+%28TV%29+%5B1987%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a83b6caf327732eb3c52c557254c7a3387b6ca1","infoHashBuffer":{"type":"Buffer","data":[42,131,182,202,243,39,115,46,179,197,44,85,114,84,199,163,56,123,108,161]},"announce":[],"urlList":[]}}