{"title":"Pomegranates &amp; Pine Nuts (gnv64)","uid":12726328,"size":85211273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ba81a424dd7840dccbcb672d6d5e3d83ae8c85d&amp;dn=Pomegranates+%26amp%3B+Pine+Nuts+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":3,"time":1447060370,"description":"Pomegranates &amp; Pine Nuts: A stunning collection of Lebanese, Moroccan and Persian recipes\r\nby Bethany Kehdy\r\nNourish | October 2013 | ISBN-10: 184899088X | ePUB | 81.2 mb\r\n\r\nNew Cookbook from Former ‘Miss Lebanon’ Explores Modern Middle Eastern Cooking\r\nThe Middle East cradles an ancient cuisine—one of the oldest in the world. Despite its pedigree, conflict in the region has largely kept it under wraps to a wider audience. Hummus, tabbouleh, and stuffed vine leaves now receive global recognition, but there still exists this vast and distinct culinary heritage that remains unexplored: wholesome stews, exotic casseroles and a range of home cooking which revolves around humble, yet delicious vegetables and grains. It is these that routinely welcome home hungry school children and soothe the appetites of tired workers. They too must be shared with the world.\r\nFor the past five years, Lebanese-American Bethany Kehdy has sought to demystify Middle Eastern food through her blog DirtyKitchenSecrets.com and her Taste of Lebanon tours. In her debut book, Pomegranates &amp; Pine Nuts, she provides 100+ new recipes that will introduce you to the wonders of the Middle East and change any thought you might have had that this hearty cuisine is complicated or laborious.\r\n\r\nAbout the Author\r\nBethany Kehdy is a Lebanese-American food explorer most notably known by her popular Middle Eastern food blog, Dirty Kitchen Secrets. Born in Houston, Texas to an American mother and a Lebanese father, Bethany grew up in Lebanon during the country's most volatile civil war years\r\nAfter competing in Miss Lebanon 2001 and proudly representing Lebanon in Miss World 2002, Bethany traveled the world and built a career around her enthusiasm for Middle Eastern food. Bethany has spent the last 5 years heating up the kitchen and establishing herself as the most provocative Middle Eastern cook online, bringing together her childhood memories of traditional Middle Eastern cuisine and interpreting it in a fresh, modern approach, all the while incorporating her well-traveled palate.\r\n\r\nCONTENTS\r\nCulinary Reflections\r\nMeze\r\nPoultry\r\nMeat\r\nSeafood\r\nVegetarian\r\nDesserts\r\nMiddle Eastern &amp; North African Pantry\r\nBasic Recipes &amp; Methods\r\nSuppliers\r\n \nhttp://s3.postimg.org/tzi03phv7/Pomegranates_Pine_Nuts.jpg","torrent":{"xt":"urn:btih:2ba81a424dd7840dccbcb672d6d5e3d83ae8c85d","amp;dn":"Pomegranates+%26amp%3B+Pine+Nuts+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ba81a424dd7840dccbcb672d6d5e3d83ae8c85d","infoHashBuffer":{"type":"Buffer","data":[43,168,26,66,77,215,132,13,204,188,182,114,214,213,227,216,58,232,200,93]},"announce":[],"urlList":[]}}