{"title":"Hornblower - The Adventure Continues 3 - =2Lions Team=","uid":4721457,"size":8272366173,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2bc894be6e88da63b76427befe9a724192451740&amp;dn=Hornblower+-+The+Adventure+Continues+3+-+%3D2Lions+Team%3D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Vermeulen","files":-1,"time":1234539306,"description":"Hornblower - The Adventure Continues 3 bevat de volgende twee afleveringen:\n\n\nAflevering 1 - Loyalty\nPortsmouth, 1803. Horatio Hornblower is gedegradeerd tot luitenant als gevolg van het vredesakkoord met Frankrijk. Hij probeert wat geld bij te verdienen met kaartspelletjes en huurt een kamer bij Mrs Mason. Een toevallige ontmoeting met luitenant Bush doet hun vriendschap weer opbloeien. Het is Bush die als eerste ontdekt dat Maria, de dochter van Mrs Mason, een oogje op Hornblower heeft. Admiraal Pellew laat Hornblower bij zich roepen en promoveert hem tot kapitein. Hij krijgt de leiding over het schip de Hotspur, dat naar de kust van Frankrijk vaart om de uitgeweken burgemeester CÃƒÂ´tard naar het landgoed van de graaf van Montreuil te brengen. Daar ontdekt Hornblower dat de Fransen een invasie van 50.000 man voorbereiden. Pellew besluit deze oorlogsverklaring te beantwoorden met een preventieve aanval op de Franse vloot. Terwijl Hornblower de Franse communicatiemiddelen en gevechtseenheden aan de kust probeert te vernietigen, wordt hij verraden. Het nieuws dat zijn verrader tot diep in de Engelse marine was geÃƒÂ¯nfiltreerd, slaat in als een bom. Hornblower weet te ontsnappen uit zijn Franse cel, waardoor Pellew nog net op tijd een succesvolle aanval op de Fransen kan uitoefenen en hun invasieplannen kan dwarsbomen. Eenmaal terug in Engeland vraagt Hornblower, zeer tot zijn eigen verbazing, Maria ten huwelijk.\n\n\n\nAflevering 2 - Duty\nHoratio Hornblower ziet zijn trouwdag met angst en beven tegemoet. Maar hij heeft Maria zijn woord gegeven en zou zijn bruid nooit oneervol behandelen door haar te verlaten. Admiraal Pellew geeft Hornblower weinig tijd om te wennen aan het getrouwde leven. Hij stuurt hem direct weer op reis om op zoek te gaan naar het vermiste schip Grasshopper en de gezagvoerder, hun oude vriend Bracegirdle. Tijdens de reis redt Hornblower twee vreemdelingen die net buiten de kust van Frankrijk in een storm terecht zijn gekomen. Een van de twee beweert dat hij Zwitser is en dat hij vergezeld wordt door zijn Amerikaanse vrouw. Maar Hornblower gelooft hun verhaal niet. De uiteindelijke onthulling van hun ware identiteit blijkt zowel onthutsend als zeer gevaarlijk te zijn. Hornblower vindt het wrak van de Grasshopper en de enige overlevende, de vermoeide en verslagen kapitein Bracegirdle. Samen komen Hornblower en Bracegirdle erachter welke snode plannen er precies worden gesmeed in een afgelegen baai bij Bretagne. Hornblower ziet zich gedwongen door gevaarlijke wateren te varen, recht door dichte mist en sneeuw, en de Franse schepen aan te vallen die op het punt staan een nieuwe invasie uit te voeren, zij het via een intrigerende route. Thuis, in Engeland, wacht Maria geduldig tot ze haar grote nieuws aan Hornblower kan vertellen.\n\n\n\n******************************************\n\nBrought to you by\nVermeulen.GmBh\n2Lions-Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************\n\nBezoek ook eens NLT voor de DivX.\nhttp://www.nlt.ons-forum.nl\n\n\nEnjoy\nVermeulen.GmBh\n2Lions-Team","torrent":{"xt":"urn:btih:2bc894be6e88da63b76427befe9a724192451740","amp;dn":"Hornblower+-+The+Adventure+Continues+3+-+%3D2Lions+Team%3D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bc894be6e88da63b76427befe9a724192451740","infoHashBuffer":{"type":"Buffer","data":[43,200,148,190,110,136,218,99,183,100,39,190,254,154,114,65,146,69,23,64]},"announce":[],"urlList":[]}}