{"title":"The Byrds - Mr. Tambourine Man [Ed Sullivan, 1965].VOB","uid":12544817,"size":98525184,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2c3e76af7250af199a95e7e253b0ea97191b5f02&amp;dn=The+Byrds+-+Mr.+Tambourine+Man+%5BEd+Sullivan%2C+1965%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":1,"time":1444455531,"description":"The Byrds - Mr. Tambourine Man [Ed Sullivan, 1965].VOB\r\n\r\n\r\nHQ rare live performance on &quot;The Ed Sullivan Show&quot; music video from a promo DVD. &quot;Mr. Tambourine Man&quot; is a song written, composed, and performed by Bob Dylan, who released his original version of it on his 1965 album  Bringing It All Back Home. The Byrds also recorded a version of the song that they released in the same year as their first single on Columbia Records, reaching number 1 on both the Billboard Hot 100 chart and the UK Singles Chart, as well as being the title track of their first album, Mr. Tambourine Man. The Byrds' recording of the song was influential in initiating the musical subgenre of folk rock, leading many contemporary bands to mimic its fusion of jangly guitars and intellectual lyrics in the wake of the single's success.\r\n\r\n&quot;Mr. Tambourine Man&quot; was the debut single by the American band The Byrds and was released on April 12, 1965 by Columbia Records. The song was also the title track of the band's debut album, Mr. Tambourine Man, which was released on June 21, 1965. The single, along with the album of the same name, was influential in originating the musical style known as folk rock, with the single becoming the first folk rock smash hit. Indeed, the term &quot;folk rock&quot; was first coined by the U.S music press to describe the band's sound at around the same time as &quot;Mr. Tambourine Man&quot; peaked at number 1 on the Billboard chart.\r\n\r\nThe single initiated the folk rock boom of 1965 and 1966, with many acts imitating the band's hybrid of a rock beat, jangly guitar playing and poetic or socially conscious lyrics. This hybrid had its antecedents in the American folk revival of the early 1960s, The Animals's rock-oriented recording of the folk song &quot;The House of the Rising Sun,&quot; the folk-influences present in the songwriting of The Beatles, and the twelve-string guitar jangle of The Searchers and The Beatles's George Harrison. However, it was The Byrds who first melded these disparate elements into a unified whole, creating a template for folk rock that would prove successful for many acts during the mid-1960s.\r\n\r\nThe Byrds' version of &quot;Mr. Tambourine Man&quot; was listed as the number 79 song on Rolling Stone's list of the 500 Greatest Songs of All Time, and Dylan's version was ranked number 106. It is one of three songs to place twice, along with &quot;Walk This Way&quot; by both Aerosmith and Run-DMC with Perry and Tyler, and &quot;Blue Suede Shoes&quot; by both Carl Perkins and Elvis Presley. The Byrds' version was honored with a Grammy Hall of Fame Award in 1998, and Dylan's version was honored with the same award in 2002.\r\n\r\n\r\nThe Byrds were an American rock band, formed in Los Angeles, California in 1964. The band underwent multiple line-up changes throughout its existence, with frontman Roger McGuinn (known as Jim McGuinn until mid-1967) remaining the sole consistent member, until the group disbanded in 1973. Although they only managed to attain the huge commercial success of contemporaries like the Beatles, the Beach Boys, and the Rolling Stones for a short period (1965-66), the Byrds are today considered by critics to be one of the most influential bands of the 1960s. Initially, they pioneered the musical genre of folk rock, melding the influence of the Beatles and other British Invasion bands with contemporary and traditional folk music. As the 1960s progressed, the band was also influential in originating psychedelic rock, raga rock, and country rock.\r\n\r\nIn January 1991, the Byrds were inducted into the Rock and Roll Hall of Fame, an occasion that saw the five original members performing together for the last time. McGuinn, Crosby, and Hillman still remain active but Gene Clark died of a heart attack in 1991, and Michael Clarke died of liver failure in 1993.\r\n*(video does not have any logos)*\r\n\r\n\r\n    \nhttp://en.wikipedia.org/wiki/Mr._Tambourine_Man#The_Byrds.27_version \r\n      \nhttp://postimg.org/image/kavzkj25j/ \r\n   \r\n\r\n\r\nFile properties info using Media Player Classic:     \r\n   Video: MPEG2 Video 720x576 (4:3) 25fps 8600kbps\r\n   Audio: Dolby Digital AC3 48000Hz stereo 224kbps\r\n   Duration: 00:02:16\r\n\r\n\r\n\r\n\r\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \r\nor for better visual and audio quality playback of all your videos. \r\nIt's 100% free to download and use. Latest stable build is v1.7.9\r\n\r\n*Media Player Classic Home Cinema*         \nhttp://mpc-hc.org/ \r\n\r\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:2c3e76af7250af199a95e7e253b0ea97191b5f02","amp;dn":"The+Byrds+-+Mr.+Tambourine+Man+%5BEd+Sullivan%2C+1965%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c3e76af7250af199a95e7e253b0ea97191b5f02","infoHashBuffer":{"type":"Buffer","data":[44,62,118,175,114,80,175,25,154,149,231,226,83,176,234,151,25,27,95,2]},"announce":[],"urlList":[]}}