{"title":"Cartas.a.Julieta.DVDRip.Castellano .avi","uid":6120755,"size":1907572736,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2c45fd742813cf183b90c65e1041bc9fd9b39263&amp;dn=Cartas.a.Julieta.DVDRip.Castellano+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"erato99","files":1,"time":1295730814,"description":"Calidad de video: DVD RIP\nPeso: 1800 mb\nIdioma del audio: Castellano AC3 5.1 \n\nSophie Hall (Amanda Seyfried) es una aspirante a escritora de una revista, quien, junto con su novio VÃƒÂ­ctor (Gael GarcÃƒÂ­a Bernal), vuela desde Nueva York a Italia para vivir algo del romance que mucha falta le hace a la relaciÃƒÂ³n. Mientras VÃƒÂ­ctor estÃƒÂ¡ fuera, ocupÃƒÂ¡ndose de unos asuntos de trabajo, SofÃƒÂ­a se encuentra en el famoso patio de Verona de los amantes de Julieta Capuleto de Romeo y Julieta, donde mujeres de todas partes del mundo le dejan a Julieta cartas de amores perdidos y no correspondidos. Ella descubre una carta escrita 50 aÃƒÂ±os antes a Julieta por Claire Smith (Vanessa Redgrave) buscando a un joven italiano que la cautivÃƒÂ³ siendo adolescente.\n\nPara sorpresa de Sophie, su carta inspira a Claire, ahora abuela, para viajar a Verona en busca de su amor perdido (Franco Nero). AcompaÃƒÂ±ada por su nieto Charlie (Christopher Egan), el trÃƒÂ­o busca por toda la Toscana y descubre que la valentÃƒÂ­a que todos ellos necesitan para enfrentar el amor no es algo que se obtenga fÃƒÂ¡cilmente.\n\nSin embargo, ella cree que lo que la impulsa a embarcarse en esta aventura es avanzar en su carrera. Pasar de ser responsable de verificar los hechos a convertirse en periodista, representa un gran cambio y Sophie detecta una historia que pudiera ayudarla a impulsar su carrera. Al verse atrapada ayudando a Claire a tener una segunda oportunidad, descubre que en realidad estÃƒÂ¡ persiguiendo esa historia porque estÃƒÂ¡ huyendo de las historias de su propia vida.\n\t\t\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:2c45fd742813cf183b90c65e1041bc9fd9b39263","amp;dn":"Cartas.a.Julieta.DVDRip.Castellano+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c45fd742813cf183b90c65e1041bc9fd9b39263","infoHashBuffer":{"type":"Buffer","data":[44,69,253,116,40,19,207,24,59,144,198,94,16,65,188,159,217,179,146,99]},"announce":[],"urlList":[]}}