{"title":"LadyKillers (Tom Hanks) [2004] @! .avi","uid":4510770,"size":545611272,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2cec283ce4b998ea3960858ab4cd5fce62d9e7fe&amp;dn=LadyKillers+%28Tom+Hanks%29+%5B2004%5D+%40%21+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"alien99","files":1,"time":1226769576,"description":"This is not as bad a bad movie as many other would seem to want you to believe. It does not really bear comparison to the original because it has been made differently and updated for a modern audience. Tom Hanks, contrary to other comments I have seen here, is quite excellent in the lead role. His hammy, Poe-esquire disguise, is clearly compensating for the lack of intellectual gravity to which he so anxiously aspires. And, although I understand that Hanks did not watch the original prior to filming, it is a neat coincidence then that he chose to insert false teeth (see Alistair Simm in the original). The supporting characters are nicely fleshed out with some helpful introductory vignettes and although some of the film comes across as a little too &quot;Uncle Tom&amp;#039;s Cabin&quot; at times; I think we can forgive the Cohens. There are some great laugh out loud moments of pure slapstick and some nice subtle touches of more gentle humour. This does not stack up against some of the more lauded of the Cohen&amp;#039;s work - Fargo - Barton Fink - but it is an enjoyable and worthwhile slice of cinematic time. Beware of plenty of (uneccesary) bad language","torrent":{"xt":"urn:btih:2cec283ce4b998ea3960858ab4cd5fce62d9e7fe","amp;dn":"LadyKillers+%28Tom+Hanks%29+%5B2004%5D+%40%21+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cec283ce4b998ea3960858ab4cd5fce62d9e7fe","infoHashBuffer":{"type":"Buffer","data":[44,236,40,60,228,185,152,234,57,96,133,138,180,205,95,206,98,217,231,254]},"announce":[],"urlList":[]}}