{"title":"Garmin Topo BeLux.rar","uid":4648753,"size":178131887,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:2d5d236fd393ebe59d0fb206beeed431a9dad6b6&amp;dn=Garmin+Topo+BeLux.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Emmertje","files":1,"time":1231971481,"description":"De Routeerbare topografische kaart van BelgiÃƒÂ« en van het Groot-Hertogdom Luxemburg ( verder in de tekst Luxemburg genoemd) is vooral een topografische kaart met hoogtelijnen, grondgebruik en andere topografische details. Bovendien laat deze kaart toe een voor de fietser of de wandelaar gepaste route te bepalen op een computer. De gebruiker kan nadien de berekende route overdragen naar een Garmin GPS toestel dat hem zal leiden volgens deze route. De Routeerbare topografische kaart werkt ook op de GPS zelf: voer een bestemming in op de GPS en hij zal u leiden naar deze bestemming bij voorkeur langs fiets- en/of wandelvriendelijke wegen, net als een GPS die in de wagen op weg helpt langs autosnelwegen.\n\nDe Routeerbare topografische kaart van BelgiÃƒÂ« en Luxemburg is beschikbaar op een micro SD kaart die in de GPS wordt geschoven of op een cd-rom die op een computer wordt geÃƒÂ¯nstalleerd. De op de computer geÃƒÂ¯nstalleerde kaart kan naar het GPS toestel overgebracht worden, wat het zelfde gebruik toelaat als de micro SD kaart, maar laat ook zijn gebruik toe voor de voorbereiding en de analyse van de wandelingen.\n\nDe basiskaarten zijn de topografische kaarten op 1/50.000ste van het Nationaal Geografisch Instituut van BelgiÃƒÂ« en van de Administration du Cadastre et de la Topographie van het Groot-Hertogdom Luxemburg. Ze zijn vervolledigd met het DTM model (Digitaal Terrein Model)dat door deze beide administraties verschaft werd. Dit DTM model laat toe het profiel van de gekozen route op het scherm van de computer te tonen. Dit is heel belangrijk voor heuvelachtige regio?s.\n\nRouteYou, een bedrijf gespecialiseerd in het aanmaken van digitale routes en routekaarten voor GPS navigatiesystemen, heeft al deze gegevens van Luxemburg, WalloniÃƒÂ« en Vlaanderen verzameld en verwerkt naar een Garmin Platform. \n\nAlso on usenet: http://www.binsearch.net/?q=Garmin+Topo+Belgium-Luxembourg&amp;adv_age=50","torrent":{"xt":"urn:btih:2d5d236fd393ebe59d0fb206beeed431a9dad6b6","amp;dn":"Garmin+Topo+BeLux.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d5d236fd393ebe59d0fb206beeed431a9dad6b6","infoHashBuffer":{"type":"Buffer","data":[45,93,35,111,211,147,235,229,157,15,178,6,190,238,212,49,169,218,214,182]},"announce":[],"urlList":[]}}