{"title":"Jean Strouse - Morgan, an American Financier","uid":8353332,"size":2488523136,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2dc17edf95f15f2628d9e2ee92fdb49add56147d&amp;dn=Jean+Strouse+-+Morgan%2C+an+American+Financier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"notpaid","files":36,"time":1365413831,"description":"\n\nHistory has remembered J. Pierpont Morgan as a complex and contradictory figure, part robber baron and part patron saint. Now this magisterial biography, based extensively on new material, draws a definitive, full-scale portrait of Morgan's tumultuous life both in and out of the public eye.Morgan earned his reputation as &quot;the Napoleon of Wall Street&quot; by reorganizing the nation's railroads and creating some of its greatest industrial trusts, including General Electric and U.S. Steel. At a time when the United States had no Federal Reserve System, he appointed himself a one-man central bank. He had two wives, three yachts, four children, six houses, mistresses, and one of the finest art collections in America. In this extraordinary book, award-winning biographer Jean Strouse vividly portrays the financial colossus, the avid patron of the arts, and the entirely human character behind all the myths.\n\nBrilliantly crafted, epic in scope, Morgan reveals a man we have never seen before, offering new insights on the culture, political struggles, and social conflicts of America's Gilded Age.\n","torrent":{"xt":"urn:btih:2dc17edf95f15f2628d9e2ee92fdb49add56147d","amp;dn":"Jean+Strouse+-+Morgan%2C+an+American+Financier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dc17edf95f15f2628d9e2ee92fdb49add56147d","infoHashBuffer":{"type":"Buffer","data":[45,193,126,223,149,241,95,38,40,217,226,238,146,253,180,154,221,86,20,125]},"announce":[],"urlList":[]}}