{"title":"John Paul Young - The Life Of Ermie Scub (1980) vtwin88cube","uid":6109235,"size":73755246,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2fa164121ea4df57c8e4a8820d824a621270165e&amp;dn=John+Paul+Young+-+The+Life+Of+Ermie+Scub+%281980%29+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1295284358,"description":"John Paul Young\nThe Life Of Ermie Scub (1980)\n\nWhen John Paul Young was a boy his family moved from Scotland to Australia, where he quickly learned to imitate the local accent to avoid being teased by his classmates. It was with this newly learned voice that he started singing, joining a production of Jesus Christ Superstar and becoming the lead singer for rock band Elm Tree in the 1970s. During one of their performances he was spotted by manager and sometimes-producer Simon Napier-Bell, who asked him to record an overdub for a song called &quot;Pasadena.&quot; That song was written by Harry Vanda and George Young of the Easybeats, who were impressed enough with him to become John Paul Young's songwriters, penning a string of pop songs that gave him chart success in Australia as well as Europe and Asia. It wasn't until the late '70s that he became world-famous, first for the disco song &quot;Standing in the Rain,&quot; and then for the biggest hit of his career, &quot;Love Is in the Air.&quot; John Paul Young attributed the song's success to the direction of George Young, who had told him to make the song casual by singing it as if it were a conversation. Subsequent singles either unsuccessfully attempted to re-create the disco formula of &quot;Standing in the Rain&quot; or turned towards rock, which gave him several more hits within Australia in the early '80s. Young eventually retired from singing to become a radio DJ, but came out of retirement in 1992 when a version of &quot;Love Is in the Air&quot; was used on the soundtrack to Baz Luhrmann's film Strictly Ballroom and the song became a hit once again. After performing his old hits at live concerts for another decade, including a performance at the 2000 Sydney Olympics, he returned to the studio with Harry Vanda's Flashpoint Music in 2006 to record a new album, In Too Deep. \n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tPop\t\t\nM3U Playlist:\t\tYes\n\n01.Ermie Has Feeders\n02.All The Sad Goodbyes\n03.Boy In The Gutter With The Broken Mind\n04.Our Time Escapes\n05.Is That Why\n06.Summertime\n07.The Monster In Ed\n08.The Girl Spells Grief\n09.Angels With Dirty Faces\n10.The Boulevard Of Hope\n11.Surrender To The Void\n\n\nCheers!","torrent":{"xt":"urn:btih:2fa164121ea4df57c8e4a8820d824a621270165e","amp;dn":"John+Paul+Young+-+The+Life+Of+Ermie+Scub+%281980%29+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fa164121ea4df57c8e4a8820d824a621270165e","infoHashBuffer":{"type":"Buffer","data":[47,161,100,18,30,164,223,87,200,228,168,130,13,130,74,98,18,112,22,94]},"announce":[],"urlList":[]}}