{"title":"Wars of Empire - Porch Douglas.epub","uid":10626614,"size":7226533,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fa97b291dcc5f59838d429f64a7f51c1b4d8514&amp;dn=Wars+of+Empire+-+Porch+Douglas.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PusInBoots","files":1,"time":1406243942,"description":"Unfortunately this book contained some pictures that were printed across opposing pages, and not suitable for an e-book reader, I have not included those. Biographies, Further Reading, Index and Picture Credits have also not been included.\n*&quot;.an exciting saga, written by a gifted writer with the capacity to explain military tactics and strategies in laypersons' terms, filled with a fascinating array of characters, lush illustrations highlight the text, outstanding, will delight both scholars and well informed general readers who appreciate a great story well told.&quot;--Booklist *\nAcross the globe, the 19th century signaled the high renaissance of Western Imperialism. With all their power, it may have seemed that the Europeans pressed forward unchecked, but in fact native militias often defeated those who would possess their homelands. Maintaining control of overseas empires began to put an enormous strain on the home economies of all imperial powers--especially when the Great War loomed. From the African land rush to British expansion and American imperialism, this is a gripping story.","torrent":{"xt":"urn:btih:2fa97b291dcc5f59838d429f64a7f51c1b4d8514","amp;dn":"Wars+of+Empire+-+Porch+Douglas.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fa97b291dcc5f59838d429f64a7f51c1b4d8514","infoHashBuffer":{"type":"Buffer","data":[47,169,123,41,29,204,95,89,131,141,66,159,100,167,245,28,27,77,133,20]},"announce":[],"urlList":[]}}