{"title":"Boys Don't Cry - 1999","uid":4893235,"size":2844175325,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2fc584ae781c5336052adb3d710172d8905ef8ac&amp;dn=Boys+Don%5C%27t+Cry+-+1999&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EvilTSAngel","files":-1,"time":1242163268,"description":"Enjoy and Seed!\nThis is an EvilTSAngel Original DVDRip!\nOriginal Menu's Included!\n\nBased on a true story, this drama was adapted from the life of Brandon Teena, born Teena Brandon, a woman who chose to live her life as a man and suffered tragic consequences as a result. In 1993, 20-year-old Brandon (Hilary Swank) leaves Lincoln, Nebraska for the nearby community of Falls City, where she sports a crew cut, favors jeans and boots, and is regarded as a man by most of the people in town. While Brandon's friend Lonny (Matt McGrath) warns her that sexual outsiders aren't looked upon kindly in Falls City, she develops a reputation for being something of a ladies' man, and is soon living with a single mother named Candace (Alicia Goranson). But when Brandon meets teenage Lana (Chloe Sevigny), the two become romantically involved almost immediately. Brandon makes friends with Lana's mother (Jeanetta Arnette) and a burly ex-con named John (Peter Sarsgaard). John and his buddy Tom (Brendan Sexton) run with a rough group of men who like to drink and carouse, and they accept Brandon as one of their own. However, when Brandon ends up in jail on a traffic violation, her secret comes out, and, while Lana stands by Brandon's side, John and Tom feel betrayed -- and their anger soon boils over into violence. A distinguished feature debut for director Kimberly Peirce, Boys Don't Cry was enthusiastically received in its showings at 1999 film festivals in Venice, Toronto, and New York. ~ Mark Deming, All Movie Guide\n\nWarning: This product is intended for mature audiences only. It may contain violence, sexual content, drug abuse and/or strong language. You must be 17 or older to purchase it. By ordering this item you are certifying that you are at least 17 years of age.\n\n\nTheatrical Feature Running Time: 118 mins \nComplete Cast:\nHilary Swank - Brandon Teena\nPeter Sarsgaard - John\nAlison Folland - Kate\nMatt McGrath - Lonny\nJeanetta Arnette - Lana's Mom\nChloÃƒÂ« Sevigny - Lana\nBrendan Sexton III - Marvin Thomas 'Tom' Nissen\nAlicia Goranson - Candace\nRob Campbell - Brian\nLou Perryman - Sheriff\n\n\nDirector(s):Kimberly Peirce\nWriter(s):Andy Bienen, Kimberly Peirce\nProducer(s):Christine Vachon, Jeff Sharp, John Hart\nTheatrical MPAA Rating: R(Sexual Situations, Rape &amp; Sexual Abuse, Nudity, Substance Abuse (Alcohol, Drugs), Not For Children, Violence, Profanity)\nClosed Captioning:Check All Versions\nSubtitles:Check All Versions\nAwards:\n1999 - Boys Don't Cry - Broadcast Film Critics Association - Best Actress\n1999 - Boys Don't Cry - Chicago Film Critics Association - Best Supporting Actress\n1999 - Boys Don't Cry - Chicago Film Critics Association - Best Actress\n1999 - Boys Don't Cry - Hollywood Foreign Press Association - Best Performance by an Actress in a Motion Picture - Drama\n1999 - Boys Don't Cry - Independent Spirit Awards - Best Supporting Actress\n1999 - Boys Don't Cry - Independent Spirit Awards - Best Actress\n1999 - Boys Don't Cry - Los Angeles Film Critics Association - Best Actress\n1999 - Boys Don't Cry - Los Angeles Film Critics Association - Best Supporting Actress\n1999 - Boys Don't Cry - National Board of Review - Best Directorial Debut\n1999 - Boys Don't Cry - National Board of Review - Best Breakthrough Performance by an Actress\n1999 - Boys Don't Cry - National Society of Film Critics - Best Actress - Runner-up\n1999 - Boys Don't Cry - National Society of Film Critics - Best Supporting Actress\n1999 - Boys Don't Cry - New York Film Critics Circle - Best Actress\n1999 - Boys Don't Cry - Toronto Film Critics Association - Best Actress\n\nFormat: DVD\nRelease Date: 04/18/2000\nMPAA Rating: R\nRunning Time: 118 min\nNumber of Discs: 1\nLanguage: Eng\nSubTitles: Eng/Spa\nView special edition featuresView special edition featuresLimited Edition Features:\nAnamorphic widescreen [aspect ratio 1.85:1]\nEnglish 5.1 Surround\nEnglish Dolby Surround\nSubtitles: English\nFeaturette\nDirector's commentary\nTheatrical trailer\nTV spots\n\nBlockbuster info link: &lt;a href=&quot;\nhttp://www.blockbuster.com/browse/catalog/movieDetails/135710&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.blockbuster.com/browse/catalog/movieDetails/135710&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2fc584ae781c5336052adb3d710172d8905ef8ac","amp;dn":"Boys+Don%5C%27t+Cry+-+1999","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fc584ae781c5336052adb3d710172d8905ef8ac","infoHashBuffer":{"type":"Buffer","data":[47,197,132,174,120,28,83,54,5,42,219,61,113,1,114,216,144,94,248,172]},"announce":[],"urlList":[]}}