{"title":"Abiogenesi - Discography [320kbps]","uid":11674673,"size":535393386,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3033804d909fb78877322e908ec76f8adc6847e2&amp;dn=Abiogenesi+-+Discography+%5B320kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RodneyYouPlonker","files":41,"time":1422807350,"description":"Upon their arrival on the prog scene in the mid 90's, ABIOGENESI showed a surprisingly charismatic style which they continued to display for over ten years. Out of the entire prog catalogue, this prolific Italian band chose to go back to the roots, dressing up the 70's traditional sound with new craftsmanship and a variety of influences. Classic prog isn't exactly what they play as their style has a dark, hard feel, although it blends well with the symphonic style. Their influences are basically threefold: heavy art rock (classic influence or modern arrangements), psychedelic prog, and modern Italian symphonic prog. Retro-prog could perhaps be mentioned also, as the band seeks to recreate a druggy, classic psych atmoshpere that blends fantasy, melodious passages and improvisation.\n\nABIOGENESI are essentially marked by their guitarist, songwriter and vocalist Toni d'Urso. The initial quartet, which also included drummer Sandro Immacolato, bassist Roberto Piccolo and keyboardist Patrick Menegaldo, was in itself an original and promising entity. After their second album, Menegaldo was replaced by organist and flutist Marco Cimino, who was later replaced by Paulo Cercato. Their many albums also feature other musicians among whom Clive Jones from BLACK WIDOW, Gigi Venegoni and Kevin Brooks are most prolific.\n\nAs influences go, BLACK WIDOW first come to mind; not only because of the music's hard-rock feel (rather deceiving at times), but the similarities between the two bands are palpable. In addition to collaborating with Clive Jones, ABIOGENESI did covers of BLACK WIDOW's &quot;Sabbath&quot; album and contributed to their tribute album &quot;King Of The Witches&quot; in 2000; in fact, ABIOGENESI's never strays far from BLACK WIDOW's characteristic prog style. Their music can also be likened to that of label-mates STANDARDE as well as to the heavy style of HIGH TIDE or KING CRIMSON. The more jazzy or retro sound isn't particularly relative, being perhaps a swell result of their craft; the psychedelic influence is brought on by a slight Floydian touch. The Italian influence is reminiscent of BALLETO DI BRONZO or a darker ARTI E MESIERI. Finally, ABIOGENESI seem fascinated for the English accent and the dark prose of Poe, Lovecraft and Rice.\n\nDespite all of the above, ABIOGENESI's history remains quite obscure. Their first album is considered a fantastic debut, featuring long pieces, effects and complex atmospheres; it is a blend of instrumental psychedelia and melodic or acoustic rock. &quot;Il Giocoscuro&quot; has a slower pace but bears a more aggressive and characteristic prog dynamic, where instrumentals and fantasy prevail. Still wearing hard rock and psychedelic influences,&quot;Le Notti Di Salem&quot; is a bit less varied but offers solid compositions and delicate eclecticism. Finally, ABIOGENESI released a soundtrack album containing their best psychedelic contribution todate, at times favouring smooth and relaxed moments, reminiscent of the very best (CAMEL, URIAH HEEP, BLACK WIDOW).\n\nConsistently favouring a classic hard-rock prog style, ABIOGENESI is a modern band with a promising future, their music a guilty pleasure true fans can't afford to miss.\n\n--------------------------------------------------------------------------------------------------------------------------------\n\nI have ripped each one of these albums from the original CD source. This is the full discography but due to the fact that Abiogenesi have released a newer album in 2010, it is incomplete but this album has only been released on a special edition vinyl. It is not available in CD digital format so I cannot do a rip of it.\n\nI have done all the tagging and also album artwork. The covers are included but there was no back cover for the first album. The MP3s are all encoded @ 320kbps/44.1Khz Joint Stereo.\n\nIf you like this band then please help to seed them. Please help to keep these files alive for as long as possible.\n\nReleases included as follows:\n\n(1995) Abiogenesi - Abiogenesi\n\n01 - Ile St. Louis\n02 - La Notte Di Ognissanti\n03 - Abiogenesi\n04 - L'Oscura Tenebra\n05 - R.I.P.\n06 - Appuntamento Con La Luna\n\n(1996) Abiogenesi - Il Giocoscuro\n\n01 - Il Giocoscuro\n02 - Sul Margine Del Bosco La Morte Libra Va La Sua Falce\n03 - Notte Da Urlare\n04 - Lunipieno\n05 - Golem\n\n(2000) Abiogenesi - Le Notti Di Salem\n\n01 - Warning\n02 - A Salem\n03 - Echi Nel Buio\n04 - Abiogenesi 3\n05 - Nuove Stelle\n06 - Mr. Clive E Dr. Jones\n07 - Similia Similibus Curentur\n08 - Z.A.W. (Zombie Abiogenetic War)\n09 - I Warned You\n\n(2005) Abiogenesi - Io Sono Il Vampiro\n\n01 - Io Sono Il Vampiro\n02 - Leandro\n03 - Di Nero Vestita - Lady In Black\n04 - Vampire Blues\n05 - Amico Ti Penso - Never Let Go\n06 - Ascolta I Sogni\n07 - Lontano\n08 - Infinito\n09 - Belfagor\n10 - Sex Vampire\n11 - Mary Clark\n12 - Sabba Vampire","torrent":{"xt":"urn:btih:3033804d909fb78877322e908ec76f8adc6847e2","amp;dn":"Abiogenesi+-+Discography+%5B320kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3033804d909fb78877322e908ec76f8adc6847e2","infoHashBuffer":{"type":"Buffer","data":[48,51,128,77,144,159,183,136,119,50,46,144,142,199,111,138,220,104,71,226]},"announce":[],"urlList":[]}}