{"title":"Cobra Woman (1944) Maria Montez Dual (Eng-Span).avi","uid":4621619,"size":1364953088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:304cadbd1e12e4b467405a04ff72006abf27803b&amp;dn=Cobra+Woman+%281944%29+Maria+Montez+Dual+%28Eng-Span%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"johnefp","files":-1,"time":1231058607,"description":"NO SUBS\n=======\n\nPlot Synopsis\tby Bruce Eder\n\nOn the eve of her wedding to Ramu (Jon Hall), the beautiful Tollea (Maria Montez) is spirited away from her tranquil South Sea island to the mysterious, forbidden place of her birth, Cobra Island. Ramu follows and, with help from his young-but-not-too-bright friend Kado (Sabu) and their chimp Coco, manages to land on the island and avoid capture, which would mean death. It turns out that Tollea is the rightful high priestess of Cobra Island, the first born of two twin daughters of the earlier priestess. Tollea was not immune to the venom of the king cobra, however, so she was spirited away from the island as an infant to avoid her unnecessary death. Now her grandmother, the Queen (Mary Nash), has secured her return. Tollea's twin sister, Naja (also played by Montez), has turned cruel, greedy, and ambitious, and is killing, torturing, and tormenting her people and perverting their religion; Naja must be deposed, hopefully before the volcano on the far side of the island registers too loud an objection to her blasphemies. But Naja -- who is wanton enough to want Ramu for her own pleasure -- and her confederate, the evil, ambitious Martok (Edgar Barrier), don't plan on leaving quietly.\n\nMeanwhile, Ramu has to keep himself and Kado alive and decide if he's willing to give up the woman that he loves so that she can save her people; Tollea must choose between love and duty, fate and her birthright. One of the most ridiculously and unselfconsciously campy costume adventure movies of its era, Cobra Woman was apparently a lot of fun to work on and a relief from the reality of the Second World War for audiences in 1944. The script, co-authored by Richard Brooks a long time before he wrote The Brick Foxhole, much less directed Blackboard Jungle or made In Cold Blood or Lord Jim, is incredibly sloppy, the mix of harem dancers and ridiculous prop snakes is bizarre, and some of the worst choreography of its era doesn't help -- and yet it all hangs together, somehow, as entertainment. Director Robert Siodmak reportedly liked it, and as a refugee from the Nazis, working on it still beat the fate he'd fled in Germany. The movie is also alleged to be the primary inspiration for Jack Smith's Flaming Creatures -- which starred female impersonator Mario Montez -- and looking at it in the 21st century, one wonders if it was ever seen by Edward D. Wood Jr.; not only does the production sort of anticipate (albeit on a much higher level and budget) his work in the adventure genre, but the script seems to contain the essence of inept moments that he would elevate to an art of sorts. And one can just imagine Wood, as a young marine recruit, watching Cobra Woman eagerly and &quot;learning&quot; all the wrong lessons from its writing and production. But, like the best of Wood's movies -- only more so -- Cobra Woman is still great fun of the &quot;guilty pleasure&quot; sort. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0036716/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0036716/&lt;/a&gt;\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:07:27\nMovie complete : Yes\n\n[Video]\nResolution : 704x512\nCodec : XviD MPEG-4 codec\nFPS : 25,00\nBitRate : 2314 Kbps\nQuality Factor : 0,26 b/px\n\n[Audio]\nCodec : ATSC/A-52 Dolby AC3\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 192 Kbps\n\n\nENJOY  AND  SEED","torrent":{"xt":"urn:btih:304cadbd1e12e4b467405a04ff72006abf27803b","amp;dn":"Cobra+Woman+%281944%29+Maria+Montez+Dual+%28Eng-Span%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"304cadbd1e12e4b467405a04ff72006abf27803b","infoHashBuffer":{"type":"Buffer","data":[48,76,173,189,30,18,228,180,103,64,90,4,255,114,0,106,191,39,128,59]},"announce":[],"urlList":[]}}