{"title":"Storage Hunters - Season 1 - REAL COMPLETE - WRCR NMBSTV","uid":7407922,"size":4026813592,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:30c70d76f9712e872a8b460d1f423664bdfe11a1&amp;dn=Storage+Hunters+-+Season+1+-+REAL+COMPLETE+-+WRCR+NMBSTV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"iamgreat","files":-1,"time":1341301373,"description":"     Storage Hunters | s01 REAL COMPLETE | HDTV / WS PDTV\n\n\nFirst off, thanks to WRCR and NMBSTV for capping the show. The is a collection of those releases. Where duplication exists preference was given to the WRCR release.\n\n\nThis is the full season 1, from the pilot through episode 21, of truTV's reality show about storage locker auctions. The episodes are correctly named and numbered with episode titles. Anyone downloading this might already have some of these episodes though they might have the incorrect file names as explained below. Now to try and make sense of the mess of file names found in other torrents:\n\n* Initially noone capped the pilot in January 2011. WRCR got the repeat of it on 9 August 2011 but mistakenly called it ep 9. \n\n* WRCR followed the numbering then in place on TVRage, a user-submitted content site, when numbering the episodes in November and December 2011. At that time TVRage had them as season 2. \n\n* In January 2012 WRCR re-released the episodes on usenet with the corrected episode numbering as they are part of season 1. Those corrections never appeared on TPB or Demonoid. But it still left two episodes, &quot;Forbidden Storage&quot; and &quot;Old Rivals, New Wars&quot;, each numbered as s01e09.\n\n* When NMBSTV started capping the show they correctly numbered those eps as part of season 1 but accidentally skipped a number and had to go back and rename a few files.\n\n* Turner Broadcasting Inc., the owner of truTV, has always maintained that season 2 began on 10 June 2012. psspss has been taking WRCR's releases of the REAL season 2 and renaming them to season 3. \n\n\nThere are 22 episodes in total, numbered 0 - 21. They span 18 January 2011 through 14 February 2012.\n\nEnjoy the show but please do remember the level of truth and reality in these shows is not always what is implied by the name of the genre. :)","torrent":{"xt":"urn:btih:30c70d76f9712e872a8b460d1f423664bdfe11a1","amp;dn":"Storage+Hunters+-+Season+1+-+REAL+COMPLETE+-+WRCR+NMBSTV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30c70d76f9712e872a8b460d1f423664bdfe11a1","infoHashBuffer":{"type":"Buffer","data":[48,199,13,118,249,113,46,135,42,139,70,13,31,66,54,100,189,254,17,161]},"announce":[],"urlList":[]}}