{"title":"Isaacson_Walter-Einstein.epub","uid":8806707,"size":2048745,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31efb7265e2c6fe7bc9f5d342636d546085cbf5d&amp;dn=Isaacson_Walter-Einstein.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"420weedman","files":1,"time":1376350556,"description":"By the author of the acclaimed bestseller Benjamin Franklin, this is the first full biography of Albert Einstein since all of his papers have become available. How did his mind work? What made him a genius? Isaacson's biography shows how his scientific imagination sprang from the rebellious nature of his personality. His fascinating story is a testament to the connection between creativity and freedom. Based on newly released personal letters of Einstein, this book explores how an imaginative, impertinent patent clerk -- a struggling father in a difficult marriage who couldn't get a teaching job or a doctorate -- became the mind reader of the creator of the cosmos, the locksmith of the mysteries of the atom and the universe. His success came from questioning conventional wisdom and marveling at mysteries that struck others as mundane. This led him to embrace a morality and politics based on respect for free minds, free spirits, and free individuals. These traits are just as vital for this new century of globalization, in which our success will depend on our creativity, as they were for the beginning of the last century, when Einstein helped usher in the modern age.","torrent":{"xt":"urn:btih:31efb7265e2c6fe7bc9f5d342636d546085cbf5d","amp;dn":"Isaacson_Walter-Einstein.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31efb7265e2c6fe7bc9f5d342636d546085cbf5d","infoHashBuffer":{"type":"Buffer","data":[49,239,183,38,94,44,111,231,188,159,93,52,38,54,213,70,8,92,191,93]},"announce":[],"urlList":[]}}