{"title":"Ska-P (ska punk) Concert","uid":4491062,"size":734300160,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:335fb7e2df1f6b7b0545c6da01e71957722c4004&amp;dn=Ska-P+%28ska+punk%29+Concert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Minotavrs","files":-1,"time":1225986363,"description":"Ska-P is a ska punk band formed in Madrid (Vallecas), Spain, in 1994, that could be categorized, politically, as an anarchist musical group. It is one of the most popular ska bands in Spain and Europe.\n\nMusically, despite their fun image, Ska-P has well-rehearsed and tight arrangements, and as of 2002, includes among its members a small but striking brass section which gives the band a powerful sound.\n\nTheir nonconformist attitude is also evident in their eccentric haircuts. Some band members have mohawks while others are almost bald-shaven (with a ponytail at the back).\n\nAt the end of 2004, they announced work on a new album. After voting 4 against 2, in February 2005, the sudden and unexpected announcement was made that the band would take a break to allow the members to work on side projects, though some considered the band to have dissolved. The band&amp;#039;s worldwide farewell tour of 2005 ended in Buenos Aires, Argentina in October of that year. Their farewell concert in LeganÃƒÂ©s (near Madrid), on September 24 2005, filled the 10,000-seat La Cubierta Stadium.\n\nIn April 2008 the band confirmed they were getting back together and on September 5th, 2008 released the single &quot;Crimen sollicitationis&quot;. This was followed in October 2008 by a new album, LÃƒÂ¡grimas y Gozos (Tears and Joys), which was released on October 7, 2008. The release of the album would be followed by a brief tour.[1]","torrent":{"xt":"urn:btih:335fb7e2df1f6b7b0545c6da01e71957722c4004","amp;dn":"Ska-P+%28ska+punk%29+Concert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"335fb7e2df1f6b7b0545c6da01e71957722c4004","infoHashBuffer":{"type":"Buffer","data":[51,95,183,226,223,31,107,123,5,69,198,218,1,231,25,87,114,44,64,4]},"announce":[],"urlList":[]}}