{"title":"David Benatar - Better Never to Have Been","uid":9622577,"size":1094105,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:340524f71f79ac35d139b12253ed511451230d48&amp;dn=David+Benatar+-+Better+Never+to+Have+Been&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AreciboMessage","files":1,"time":1392532501,"description":"Amazon description:\n\nMost people believe that they were either benefited or at least not harmed by being brought into existence. Thus, if they ever do reflect on whether they should bring others into existence---rather than having children without even thinking about whether they should---they presume that they do them no harm. Better Never to Have Been challenges these assumptions. David Benatar argues that coming into existence is always a serious harm. Although the good things in one's life make one's life go better than it otherwise would have gone, one could not have been deprived by their absence if one had not existed. Those who never exist cannot be deprived. However, by coming into existence one does suffer quite serious harms that could not have befallen one had one not come into existence. Drawing on the relevant psychological literature, the author shows that there are a number of well-documented features of human psychology that explain why people systematically overestimate the quality of their lives and why they are thus resistant to the suggestion that they were seriously harmed by being brought into existence. The author then argues for the 'anti-natal' view---that it is always wrong to have children---and he shows that combining the anti-natal view with common pro-choice views about foetal moral status yield a &quot;pro-death&quot; view about abortion (at the earlier stages of gestation). Anti-natalism also implies that it would be better if humanity became extinct. Although counter-intuitive for many, that implication is defended, not least by showing that it solves many conundrums of moral theory about population.","torrent":{"xt":"urn:btih:340524f71f79ac35d139b12253ed511451230d48","amp;dn":"David+Benatar+-+Better+Never+to+Have+Been","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"340524f71f79ac35d139b12253ed511451230d48","infoHashBuffer":{"type":"Buffer","data":[52,5,36,247,31,121,172,53,209,57,177,34,83,237,81,20,81,35,13,72]},"announce":[],"urlList":[]}}