{"title":"Roxi Red And Her 38K's Will Blow You Away [720p].wmv","uid":7891002,"size":424706972,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:341778512fce0a6320cbc25720f5aa7e5223b4e0&amp;dn=Roxi+Red+And+Her+38K%27s+Will+Blow+You+Away+%5B720p%5D.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"FluxXxu","files":-1,"time":1354722644,"description":"\nRoxi Red And Her 38K's Will Blow You Away [720p].wmv\n\n\nDescription:\n\n&quot;Roxi Red's first pictorials and  videos had everyone clamoring for more! Her gigantic ta-tas (38K wonders  of nature) had us reeling like boob-drunk sailors. Roxi is one of the  biggest-breasted finds of the past 20 years of SCORE. Now Roxi  makes her SCOREVideos debut with her second pump and hump hooternanny. A  huge chest needs a big dick so Johnny Champ has the honors again. Roxi  looks awesome in her skimpy white top and traffic-stopping denim  short-shorts. He plays with her mounds like it's Titmas morning, then  plays wet T-shirt contest by pouring water on her top, making it  see-through. Roxi is stripped down totally naked and gets on her knees  to suck his nine-incher. She has a thick bush too, a rare sight these  days but one much appreciated by muff lovers. Huge tits, a sexy body and  a bush: nirvana for many. Roxi drools, licks and kisses his shaft and  nuts until it's as wet as her dangling gazongas. She is an excellent  cock sucker. Now it's time to fuck! Roxi gets on her side for position  #1, a side-winder. Can she take this trouser-python? Roxi had never made  videos until SCORE found her. She glances into the camera while  she's getting the pipe and shaking her boobs in numerous fuck positions.  Is she looking for approval? Assurance? Whatever the reasons, her  glances add another dimension of fucking heat to her bed bouncing. &quot;So  hot it kills!&quot; wrote longtime SCORE Man Seth 1968. &quot;I can't wait for this mega-hottie to make it to DVD. She is fucking beautiful!&quot;&quot;\n\n\nResolution:   1280x720\n\nDuration:     00:26:06\n\t\nSize:\t      405 MB\n\n\nScreens:\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=16238709653371500061.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=16238709653371500061.jpg&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:341778512fce0a6320cbc25720f5aa7e5223b4e0","amp;dn":"Roxi+Red+And+Her+38K%27s+Will+Blow+You+Away+%5B720p%5D.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"341778512fce0a6320cbc25720f5aa7e5223b4e0","infoHashBuffer":{"type":"Buffer","data":[52,23,120,81,47,206,10,99,32,203,194,87,32,245,170,126,82,35,180,224]},"announce":[],"urlList":[]}}