{"title":"Colon Therapy (Freaky Empire) 2010","uid":15500856,"size":2912354304,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3473d7869faeab89ab8b809831afaa0cbcf37cc7&amp;dn=Colon+Therapy+%28Freaky+Empire%29+2010&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":4,"time":1470504776,"description":"Colon Therapy (Freaky Empire) 2010\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=4762116107\r\n \nhttp://imagedisco.net/?g=9462963691\r\n\r\n\r\nPlot:\r\n\r\nScene 1: Scene opens up with Missy Woods teasing Strong's POV camera. Missy takes the action inside and starts playing with her ass shoving different toys into it. Woods then gets double teamed by John Strong and Steven French, stroking and sucking their hard cocks simultaneously. The scene is loaded with double penetration action as Strong and French take turns pounding Woods ass as the other jabs dick down her throat. \r\n\r\nScene 2: The Action heats up with Shyla Stylez taking multiple long sex toys deep in her ass. She then takes her time deep throating Strong's hard cock. Stylez moans and squirms as Strong licks her wet pussy just before pounding her ass missionary style. Shyla takes time out to suck Strong's massive rod then begs him to continue ramming her while she shoves a large dildo in her ass. Shyla shows that she is not afraid to take dick into her ass, from different positions including riding, reverse cowgirl, and getting pounded upside down at the bottom of the couch. \r\n\r\nScene 3: Crissy Moon bends over on the stairs, showing off her ass and tits to the POV camera. She shows her ability to squat on a large dildo while sucking the cock of John Strong and Mr. Pete. Crissy takes an ass fucking from Mr. Pete while continuing to deep throat Strong's dick. She rides him reverse cowgirl while Strong fucks her wet pussy. Throughout the scene, Crissy proves that she is a pro at taking two dicks at once. \r\n\r\nScene 4: Anita Blue is a sexy blonde that opens the scene showing off her pole grinding skills. Then being true to her name, she takes a long blue dildo and deep throats it. Blue shows her love for ass toys by pounding her gape with multiple plugs and dildos. John Strong fucks her ass on the couch from a missionary then side doggy position. Blue then jumps on his dick and hollers for more right before Strong shoots his hot load into her mouth. \r\n\r\nScene 5: Kelly Wells opens the scene by bending over on a pool table, fingering her own ass. With her legs high in the air Wells uses both hands to spread her ass and pussy wide for the POV camera. Kelly Wells stretches her ass using two very long dildos. Strong enters the scene and fucks her ass while pushing her legs behind her shoulders. Wells gets down on her knees and sucks Strong's dick harder and harder until he starts pounding her again. Scene ends with Strong shooting cum in her ass until it drips out. \r\n\r\nGenre:Hardcore , Anal , Creampie , Gonzo","torrent":{"xt":"urn:btih:3473d7869faeab89ab8b809831afaa0cbcf37cc7","amp;dn":"Colon+Therapy+%28Freaky+Empire%29+2010","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3473d7869faeab89ab8b809831afaa0cbcf37cc7","infoHashBuffer":{"type":"Buffer","data":[52,115,215,134,159,174,171,137,171,139,128,152,49,175,170,12,188,243,124,199]},"announce":[],"urlList":[]}}