{"title":"Nanotechnology Commercialization for Managers and Scientists","uid":12039218,"size":4422935,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34a56397501e86204aeaf2ee7ad27ff6985b38c7&amp;dn=Nanotechnology+Commercialization+for+Managers+and+Scientists&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1434738456,"description":"ISBN 9789814364386\n\nThe nanotechnology industry is a fast growing industry with many unique characteristics. When bringing the results of nanotechnology research to the market, companies and universities run into unforeseen problems related to intellectual property rights and other legal and regulatory issues. An effective commercialization of the results of research requires basic knowledge of the relevant issues and a well-defined strategy, while the absence of such knowledge and strategy can be detrimental to the commercial potential of any invention. Even the most impressive scientific achievements can become a commercial failure due to a lack of understanding and strategy relating to the legal and regulatory issues surrounding the commercialization of a technology.\n\nWith contributions from twenty experts in the field, Nanotechnology Commercialization for Managers and Scientists discusses the most relevant issues that a company or university will face when bringing a nanotechnology invention to the market. A large part of the book will be dedicated to the obtainment, strategic use, valuation and licensing of patents. Further chapters will deal with e.g. investment, university-industry collaboration, environment health and safety, etc. In this way managers and scientists at universities and companies are provided with a handbook that provides them with industry specific basic knowledge of issues that they are unfamiliar with but is essential to the commercial success of their inventions","torrent":{"xt":"urn:btih:34a56397501e86204aeaf2ee7ad27ff6985b38c7","amp;dn":"Nanotechnology+Commercialization+for+Managers+and+Scientists","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34a56397501e86204aeaf2ee7ad27ff6985b38c7","infoHashBuffer":{"type":"Buffer","data":[52,165,99,151,80,30,134,32,74,234,242,238,122,210,127,246,152,91,56,199]},"announce":[],"urlList":[]}}