{"title":"Sugarland - It Happens  (2nafish)","uid":5285684,"size":100691972,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3520b9b0483a3952aca3effc760259bd0c7f824c&amp;dn=Sugarland+-+It+Happens++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1263711179,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;It Happens&quot; is the title of a song recorded by the American country music duo Sugarland. It is the third single from their third album, 2008's Love on the Inside. The duo's members, Jennifer Nettles and Kristian Bush, wrote the song along with Bobby Pinson, with whom the duo also co-wrote the album's first two singles, &quot;All I Want to Do&quot; and &quot;Already Gone&quot;.\n\n&quot;It Happens&quot; is an up-tempo accompanied by steel-string acoustic guitar and electric guitar. In it, the female narrator (Jennifer Nettles, the duo's lead singer) tells of oversleeping and coming to work late. She borrows her neighbor's car to drive to &quot;Wally World&quot; in the second verse, and is involved in an accident with her ex-husband and his new girlfriend. In the chorus, she states that, despite her mistakes that day, she is still willing to laugh them off:\n\n    Ain't no rhyme or reason\n    No complicated meanin'\n    Ain't no need to overthink it\n    Let go laughin'\n    Life don't go quite like you planned it\n    We try so hard to understand it\n    The irrefutable, indisputable fact is\n    It happens\n\nA &quot;Pssh&quot; sound precedes the phrase &quot;It happens&quot; on all but the second chorus, so as to make the phrase sound like &quot;shit happens&quot;.\n\n&quot;It Happens&quot; debuted at #40 on the Billboard Hot Country Songs charts dated for February 28, 2009. The song became the duo's fifth U.S. Number One song on the chart week of May 23, 2009, holding that position for two weeks. It also spent six weeks at #1 on the Canadian Radio &amp; Records country singles chart.\n\nIn his review of the album, Entertainment Weekly critic Chris Willman said that the song recalled &quot;cheekily potty-mouthed hits like Blake Shelton's 'Some Beach'.&quot; Thom Jurek of Allmusic cited the song as an example of the album's personal influence, as Nettles had gone through a divorce while writing it. Matt Bjorke described the song favorably as well in his review for the Roughstock website. He called it &quot;a playful, irreverent song&quot; and considered it a better single choice than &quot;Love&quot; (which was originally slated as the album's third single), because he thought that &quot;It Happens&quot; showed a more traditionally country sound than &quot;Love&quot; did.\n\nMatt C., in his review of the album for The 9513, said that Nettles seemed to show more interest in &quot;frivolous tracks&quot; such as &quot;It Happens&quot; as compared to the more serious tracks. Country Universe critic Blake Boldt gave it a C rating, saying that it was a &quot;needless novelty&quot; but a &quot;necessary evil in a corporate radio world&quot;.\n\nLove on the Inside is the third album by the American country music duo Sugarland, released in 2008 on Mercury Nashville Records. It was first released on July 22, 2008 as a Deluxe Fan Edition, including four bonus tracks, with the regular edition following one week later. The album has produced three chart singles in &quot;All I Want to Do&quot;, &quot;Already Gone&quot; and &quot;It Happens&quot;, all Number One hits on the Billboard country singles charts. The fourth single, &quot;Joey&quot;, reached Top 20. The release of the fifth single &quot;Keep You&quot; was cancelled. It is also the first album of the duo's career to reach Number One on Top Country Albums and The Billboard Top 200. The album has been certified 2x Platinum by the RIAA with sales of over 2 million copies in the U.S. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3520b9b0483a3952aca3effc760259bd0c7f824c","amp;dn":"Sugarland+-+It+Happens++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3520b9b0483a3952aca3effc760259bd0c7f824c","infoHashBuffer":{"type":"Buffer","data":[53,32,185,176,72,58,57,82,172,163,239,252,118,2,89,189,12,127,130,76]},"announce":[],"urlList":[]}}