{"title":"Nancy LaMott - Beautiful Baby [EAC-FLAC]","uid":11193914,"size":226083887,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:35ae60a6fe708e9917f52f7172fc5a2a91198029&amp;dn=Nancy+LaMott+-+Beautiful+Baby+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jayb","files":-1,"time":1413049906,"description":"Nancy LaMott - Beautiful Baby\n\nRelease Date:\t1991\nFormat:\t\tCD\nDuration:\t45:44\nLabel:\t\tMidder Music #1 (Mastered by Nimbus Records)\n\nTrack Listing:\n\n01 Skylark\t\t\t\tHoagy Carmichael/Johnny Mercer\t\t03:07\n02 The Surrey With The Fringe On Top\tOscar Hammerstein II/Richard Rodgers\t03:41\n03 Child In Me Again\t\t\tAnnie Dinerman\t\t\t\t04:00\n04 I Have Dreamed\t\t\tOscar Hammerstein II/Richard Rodgers\t04:11\n05 Why Don't We Run Away\t\tDavid Zippel\t\t\t\t03:07\n06 It Might As Well Be Spring\t\tOscar Hammerstein II/Richard Rodgers\t06:22\n07 Blue Skies\t\t\t\tIrving Berlin\t\t\t\t04:15\n08 With Every Breath I Take\t\tCy Coleman/David Zippel\t\t\t05:09\n09 You Must Have Been A Beautiful Baby\tJohnny Mercer/Harry Warren\t\t04:38\n10 Help Is On The Way\t\t\tDavid Friedman\t\t\t\t03:11\n11 In Passing Years\t\t\tRick Jensen\t\t\t\t04:03\n\nAllMusic Review by Dave Nathan:\n\nThis album, Nancy LaMott's first, was originally released in 1991 and then reissued in 1996, shortly after her tragic death from uterine cancer. Even at this, the outset of her recording career, she shows all the moves needed to be a top-of-the-list cabaret singer. Not content to simply recite the story of the lyrics, each track is a separate dramatic event filled with just the right emotional intensity to fit the character of the song she is singing. For &quot;It Might as Well Be Spring&quot; there's a feeling of yearning, while &quot;You Must Have Been a Beautiful Baby&quot; starts off cute and ends up on the barroom floor. On the latter she engages in some slow-motion give and take with the trumpet of long-time session player Glenn Drewes. &quot;Blues Skies&quot; is a production with LaMott treating it like a hymn at the start, then with each successive chorus the tempo picks up speed, with the rest of the rhythm section joining in with Christopher Marlowe as LaMott's coda is a note somewhere in the upper stratosphere. On this tune, she shows how effective a vibrato can be if applied judiciously to emphasize a line or a word. There are times when a lieder recital atmosphere is created by the pure, crystalline, expressive LaMott vocalizing combined with the classical like piano of Christopher Marlowe. Standards are not LaMott's only forte. She handles award-winning Annie Dinerman's wistful, hopeful, and stop the world &quot;Child in Me Again&quot; with aplomb. Mike Migliore's flighty flute helps make this track one of the finest on an album of good tracks. Beautiful Baby is cabaret at its best, and is recommended.\n\n\n&gt;&gt; If you like her as much as I do, please support her legacy by purchasing her work. &lt;&lt;","torrent":{"xt":"urn:btih:35ae60a6fe708e9917f52f7172fc5a2a91198029","amp;dn":"Nancy+LaMott+-+Beautiful+Baby+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35ae60a6fe708e9917f52f7172fc5a2a91198029","infoHashBuffer":{"type":"Buffer","data":[53,174,96,166,254,112,142,153,23,245,47,113,114,252,90,42,145,25,128,41]},"announce":[],"urlList":[]}}