{"title":"The Phoenix Lights Documentary DVD","uid":4084538,"size":1014862266,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:35ffa71f69ceddab1e42d7ee0f5d0e3b667c004e&amp;dn=The+Phoenix+Lights+Documentary+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ta84","files":6,"time":1205733191,"description":"WORLDWIDE RELEASE OF THE NEW 11th ANNIVERSARY EDITION\n\nCelebrating the 10th anniversary of the historic and still unexplained Arizona mass sighting of 1997. Executive producer, writer, director &amp; key witness, Lynne D. Kitei, M.D., in collaboration with producer &amp; cinematographer, Steve Lantz, share riveting NEW data and personal interviews in this updated version of the internationally critically acclaimed and award winning Documentary.\n\nDuring the evening of March 13, 1997, a mile-wide, V-shaped formation of lights (that seemed to be attached to something) slowly and silently traversed throughout Arizona at a very low altitude for many hours. The inexplicable and awesome event was witnessed by thousands of people, while they were looking up at the sky, purposely to catch a glimpse of the Halle-Bopp Comet. The significant statewide incident garnering headline news, catching the attention of USA Today, CNN, MSNBC, The Discovery Channel, EXTRA, national morning TV shows, as well as the Evening News with Tom Brokaw and Dan Rather.\n\nUFO buffs call it the most documented and important mass sighting ever recorded. But still today, the military and government can only offer questionable explanations as to what the anomalous lights truly were. In over 10 years, the strange phenomena have never been duplicated or re-enacted [although the military tried fruitlessly, three years later]. Many experts and witnesses insist that what appeared in the Arizona skies was something beyond this world.\n\nBased on the bestselling book, &quot;The Phoenix Lights...A Skeptic&amp;#039;s Discovery That We Are Not Alone&quot;, over 30 credible eyewitnesses, children, scientists, military, and experts, as well as NASA footage and the recent disclosure by former Governor Fife Symington, give compelling testimony to the reality of these mysterious global visitations.\n\nWhat are they? How did they affect the witnesses? What do they mean?\n\nTHERE IS MUCH MORE TO THE STORY THAN MARCH 13, 1997!\n","torrent":{"xt":"urn:btih:35ffa71f69ceddab1e42d7ee0f5d0e3b667c004e","amp;dn":"The+Phoenix+Lights+Documentary+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35ffa71f69ceddab1e42d7ee0f5d0e3b667c004e","infoHashBuffer":{"type":"Buffer","data":[53,255,167,31,105,206,221,171,30,66,215,238,15,93,14,59,102,124,0,78]},"announce":[],"urlList":[]}}