{"title":"Blast","uid":7680564,"size":1006672396,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:361a0303137c52e66d900a91622bc7cb40fa7ace&amp;dn=Blast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Clapperx","files":1,"time":1348810392,"description":"avi, VHS copy.  The whole performance is there.  Near the end where the members are showing you around their house it cuts off, at 1 hour 15 minutes or so.\n\nFrom Wikipedia:\n\nBlast! is a Broadway production created by James Mason and Cook Group Incorporated, the director and organization formerly operating the Star of Indiana Drum and Bugle Corps. It was the 2001 Winner of the Tony Award for &quot;Best Special Theatrical Event&quot; [1] and also won the 2001 Emmy Award for &quot;Best Choreography&quot;.[2]\n\nBlast!'s instrumentation is exclusively brass and percussion, a nod to the show's roots in the drum and bugle corps activity. Blast!'s performers use trumpets, flugelhorns, mellophones, baritone horns, tubas, trombones (including one on a unicycle during &quot;Gee, Officer Krupke!&quot;), flugabones (a compact form of valve trombone), french horns, and a full complement of percussion instruments including snare drums, tenor drums, bass drums, xylophones. vibraphones and marimbas, tympani, and other standard percussion equipment. In addition, Blast! adds instruments not normally found in drum corps, such as French horns, concert euphoniums, trombones and bass trombones, didgeridoos and synthesizers.[3][4] Accompanying the wind and percussion is the Visual Ensemble (or VE for short), a group of dancers who manipulate a variety of props, similar to a color guard.","torrent":{"xt":"urn:btih:361a0303137c52e66d900a91622bc7cb40fa7ace","amp;dn":"Blast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"361a0303137c52e66d900a91622bc7cb40fa7ace","infoHashBuffer":{"type":"Buffer","data":[54,26,3,3,19,124,82,230,109,144,10,145,98,43,199,203,64,250,122,206]},"announce":[],"urlList":[]}}