{"title":"Whitney Houston-I Wanna Dance With Somebody (Who Loves Me)","uid":4281142,"size":188911620,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:370975b2ea71c64903b2c5a6a2e2d2fccf15087d&amp;dn=Whitney+Houston-I+Wanna+Dance+With+Somebody+%28Who+Loves+Me%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"2nafish","files":1,"time":1215430067,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Wanna Dance with Somebody (Who Loves Me)&quot; was released in May 1987 and is the first single from Whitney Houston&amp;#039;s second studio album Whitney. It was written by George Merrill and Shannon Rubicam of the band Boy Meets Girl, who had previously written the number-one hit &quot;How Will I Know&quot;, also for Houston. Merrill delivered the demo to Clive Davis on an audio cassette, and Davis had Houston record it. If Davis didn&amp;#039;t like the song, Merrill and Rubicam would have recorded it as &quot;Boy Meets Girl&quot;.\n\nThe song originally had a working title of &quot;I Want to Dance with Somebody&quot;, Whitney herself stated that it was the working title while she was on tour in 1986. The song was produced by Narada Michael Walden. The original arrangement of the song did not impress him, as he saw it as more of a country tune than a pop song, so he threw in faster beats and Caribbean percussion to create a dance track.\n\nThe video for &quot;I Wanna Dance with Somebody&quot; (directed by Brian Grant) is one of Houston&amp;#039;s best recognized music videos. In this light-hearted video, Houston first performs in a black-and-white concert arena. She walks backstage, and the scene is intercut with more vivid, colorful images of her. The song then explodes into its beginning, with a myriad of locations and various outfits by Houston, as dancers trying to impress her as she dances around, just having a good time. At one point she pours a bucket of water on a bad dancer.\n\n\nMy Videos: \n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:370975b2ea71c64903b2c5a6a2e2d2fccf15087d","amp;dn":"Whitney+Houston-I+Wanna+Dance+With+Somebody+%28Who+Loves+Me%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"370975b2ea71c64903b2c5a6a2e2d2fccf15087d","infoHashBuffer":{"type":"Buffer","data":[55,9,117,178,234,113,198,73,3,178,197,166,162,226,210,252,207,21,8,125]},"announce":[],"urlList":[]}}