{"title":"Psychoheresy: The Psychological Seduction Of Christianity - Mart","uid":10350130,"size":1827313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:375cb0c534ba5395656cc4ed609cf429bf9fa4ad&amp;dn=Psychoheresy%3A+The+Psychological+Seduction+Of+Christianity+-+Mart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1402666021,"description":"Almost everywhere one turns in the church one sees psychology. The psychologizing of Christianity has reached epidemic proportions. We see it everywhere in the church, from psychologized sermons to psychologized persons. However, the psychologizing of the church is neither biblically nor scientifically justifiable. Beneath all the biblical reasons why Christians should not pursue psychotherapy and its underlying psychologies is this one fact. The use of psychotherapy and its underlying psychologies denies the sufficiency of Scripture for the issues of life normally taken to a psychotherapist.\nThis book exposes the fallacies and failures of psychological counseling theories and therapies for one purpose: to call Christians back to God's Word and the Holy Spirit's work in the believer; reveals the anti-Christian biases, internal contradictions, and documented failures of secular psychotherapy; examines various amalgamations with Christianity; and explodes myths that undergird these unholy unions.\nIt demonstrates the fact that psychological explanations about life and psychological solutions to life's problems are questionable at best, detrimental at worst, and spiritual counterfeits at least.\n\n\nAbout the authors:\nMartin Bobgan holds four university degrees, including a doctorate in educational psychology from the University of Colorado and heads PsychoHeresy Awareness Ministries. Deidre Bobgan holds an M.A. degree in English from the University of California, Santa Barbara, and is a member of Phi Beta Kappa. They have coauthored hundreds of articles and twenty books. ","torrent":{"xt":"urn:btih:375cb0c534ba5395656cc4ed609cf429bf9fa4ad","amp;dn":"Psychoheresy%3A+The+Psychological+Seduction+Of+Christianity+-+Mart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"375cb0c534ba5395656cc4ed609cf429bf9fa4ad","infoHashBuffer":{"type":"Buffer","data":[55,92,176,197,52,186,83,149,101,108,196,237,96,156,244,41,191,159,164,173]},"announce":[],"urlList":[]}}