{"title":"Crossing Hitler: The Man Who Put the Nazis on the Witness Stand","uid":11775028,"size":2516403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3763b9a58a01bf02942072dcc6bdcc65c1d1cb5c&amp;dn=Crossing+Hitler%3A+The+Man+Who+Put+the+Nazis+on+the+Witness+Stand&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427245797,"description":"During a 1931 trial of four Nazi stormtroopers, known as the Eden Dance Palace trial, Hans Litten grilled Hitler in a brilliant and merciless three-hour cross-examination, forcing him into multiple contradictions and evasions and finally reducing him to helpless and humiliating rage (the transcription of Hitler's full testimony is included.) At the time, Hitler was still trying to prove his embrace of legal methods, and distancing himself from his stormtroopers. The courageous Litten revealed his true intentions, and in the process, posed a real threat to Nazi ambition.\nWhen the Nazis seized power two years after the trial, friends and family urged Litten to flee the country. He stayed and was sent to the concentration camps, where he worked on translations of medieval German poetry, shared the money and food he was sent by his wealthy family, and taught working-class inmates about art and literature. When Jewish prisoners at Dachau were locked in their barracks for weeks at a time, Litten kept them sane by reciting great works from memory. After five years of torture and hard labor-and a daring escape that failed-Litten gave up hope of survival. His story was ultimately tragic but, as Benjamin Hett writes in this gripping narrative, it is also redemptive. &quot;It is a story of human nobility in the face of barbarism.&quot;\nThe first full-length biography of Litten, the book also explores the turbulent years of the Weimar Republic and the terror of Nazi rule in Germany after 1933","torrent":{"xt":"urn:btih:3763b9a58a01bf02942072dcc6bdcc65c1d1cb5c","amp;dn":"Crossing+Hitler%3A+The+Man+Who+Put+the+Nazis+on+the+Witness+Stand","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3763b9a58a01bf02942072dcc6bdcc65c1d1cb5c","infoHashBuffer":{"type":"Buffer","data":[55,99,185,165,138,1,191,2,148,32,114,220,198,189,204,101,193,209,203,92]},"announce":[],"urlList":[]}}