{"title":"My Medical Info v1.8 Final By bobiras2009","uid":7593272,"size":173667,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:38117a9e5884c9b905183d2c32c09a550b265c4d&amp;dn=My+Medical+Info+v1.8+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346615925,"description":"                                    By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nRequirements: Android 2.0+\nOverview: Store all your family's key medical data for emergencies and day to day use.\n\nStore all your family's key medical data for emergencies and day to day use.\n\nKey Features:\n- People: Store data for multiple people\n- Contacts: Store name, phone, fax, website and address for all you contacts (Doctor, dentist, vision, hospital, pharmacy, specialists, emergency, etc) and directly call, view website or show on map.\n- Allergies: Store all your food, medical and other allergies\n- Medications: Store all your current and past medications, dose and other data\n- Facts: Store all your medical facts (Insurance information, current medical issues and other personal information). You can create store custom information, not just pre-determined data.\n- History: Store all your history of illness, surgery, injury, vaccines, family history and any other customizable medical history\n- Trends: Use to track items like weight, blood results, blood pressure or anything you want\n- Password Protection: Optionally you can set and require a password to use this application\n- Share: Share your data via email or other share option. This allows you to share info with a babysitter or print and take to doctor.\n- Backup/Restore: Save a backup copy of your data\n\n\n                                    By bobiras2009\t","torrent":{"xt":"urn:btih:38117a9e5884c9b905183d2c32c09a550b265c4d","amp;dn":"My+Medical+Info+v1.8+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38117a9e5884c9b905183d2c32c09a550b265c4d","infoHashBuffer":{"type":"Buffer","data":[56,17,122,158,88,132,201,185,5,24,61,44,50,192,154,85,11,38,92,77]},"announce":[],"urlList":[]}}