{"title":"FIFA 12 PS3 Cfw 3.55 / 3.41 EXEtrimALL (tonyman)","uid":6948922,"size":9596143136,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:38f2ea5783d6ce19f071d214a984c327cd1c4f2b&amp;dn=FIFA+12+PS3+Cfw+3.55+%2F+3.41+EXEtrimALL+%28tonyman%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"antonix01x","files":-1,"time":1326330886,"description":"This torrent includes the three parts of the pkg files that can be installed on any cfw console.\nSeed\n\nFIFA Soccer 12 is the 19th game in Electronic Arts\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\' popular video game soccer series. Continuing with the franchise\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s unique blend of realism and innovative features that bring the authenticity to the video game pitch that fans crave, FIFA Soccer 12 is an exciting title for longtime and existing fans of console sports gaming. Game features include: 500 officially licensed clubs and more than 15,000 players, improved self-awareness and aptitude of AI players, a redefined defending mechanism, more true-to-life injuries, precision dribbling and new commentary teams.\n\n\nLove Soccer - Play Soccer\n\nFIFA Soccer 12 brings to the pitch the game-changing new Player Impact Engine, a physics engine built to deliver real-world physicality in every interaction on the pitch. Revolutionary gameplay innovations inspired by the real-world game make FIFA Soccer 12 deeper and more engaging. All-new Precision Dribbling delivers a higher fidelity of touch on the ball for attacking players, while Tactical Defending fundamentally changes the approach to defending by placing equal importance on positioning, intercepting passes and tackling. Plus, AI players have been infused with Pro Player Intelligence, the next generation of player intelligence and performance.\n\n\nHit the pitch in one of the best reviewed Sports games of E3 2011.\nView larger.\nKey Game Features\n\nPro Player Intelligence - AI players have been infused with self-awareness and aptitude, enabling them to make decisions based on their own skills as well as the strengths and attributes of their teammates. Players who possess exceptional vision, for example, will see opportunities for through balls that other players won\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t. Real Madrid\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s KakÃƒÂ¡ will be more likely to pick out a run from a teammate farther away than a player with poorer vision. Additionally, teams will vary their attack based on the strengths of their players on the pitch, and the weaknesses of opposing players, creating a more authentic experience and greater variety of matches.\nTactical Defending - Redesigned defending mechanism fundamentally changes the approach to defending by placing equal importance on positioning, intercepting passes and tackling at the right moment. Tactics and timing are crucial.\nTrue Injuries - The Player Impact Engine monitors contact between players in real-time, analyzing the force of the collision and impact on the body to detect real injuries, creating a deeper more challenging Career Mode. Manage new types of injuries and the risk of sending a player onto the pitch who isn\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t fully healed.\nPlayer Impact Engine - Two years in development, the new physics engine is built to deliver real-world physicality in every interaction on the pitch. Experience an infinite variety of natural and believable outcomes in every contact. Players feel more resilient on the ball, push and pull during the fight for possession, and recover from light challenges more easily, preserving their natural momentum.\nPrecision Dribbling - Enjoy new ways to take on opponents, more time on the ball to make decisions, and complete control of the pace of the game. Utilize close dribble touches in tight spaces, on the wings, and even while fending off an opponent.\nComplete Authenticity - Over 500 officially licensed clubs and more than 15,000 players.\nNew Commentary Teams - For the first time ever, two broadcast teams will be featured - Martin Tyler and Alan Smith and Clive Tyldesley and Andy Townsend. Fans can customize audio to their preferred commentators for any matches.","torrent":{"xt":"urn:btih:38f2ea5783d6ce19f071d214a984c327cd1c4f2b","amp;dn":"FIFA+12+PS3+Cfw+3.55+%2F+3.41+EXEtrimALL+%28tonyman%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38f2ea5783d6ce19f071d214a984c327cd1c4f2b","infoHashBuffer":{"type":"Buffer","data":[56,242,234,87,131,214,206,25,240,113,210,20,169,132,195,39,205,28,79,43]},"announce":[],"urlList":[]}}