{"title":"Manson - Documentary - Laurence Merrick -1972 - 93 min. DivX","uid":3940922,"size":645702340,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:396f13f76694c5c33d35ed451eae4d0b6da275f9&amp;dn=Manson+-+Documentary+-+Laurence+Merrick+-1972+-+93+min.+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"st2580smile","files":1,"time":1198132662,"description":"Despite its title, Manson does not focus on Charles Manson himself. Instead, it examines the history of his case through a series of interviews with Manson followers, trial witnesses, and prosecuting attorney Vincent Bugliosi. The resulting film could have degenerated into a festival of talking heads, but directors Laurence Merrick and Robert Hendrickson keep this from happening by making sophisticated use of split-screen imagery and colorful opticals that give the proceedings a stylish veneer. The atmosphere is further enhanced by a memorable song soundtrack by former Manson family members Brooks Poston and Paul Watkins: their well-crafted, mournful folk songs are lovely yet creepy and thus a perfect backdrop for a tale of hippie ideals gone horribly wrong. That said, Manson is also hindered by a couple of fundamental flaws in its approach to its subject. The first is that the film&amp;#039;s tone often descends into heavy-handed sensationalism, especially during the moments where Bugliosi struts around an empty courtroom in a Perry Mason-inspired style and pontificates about the shocking nature of the crimes. The other big problem is that Manson himself is seldom seen in the documentary, and thus little insight is gained into his personality or the psychological tricks he used to dominate his followers. Despite these key flaws, Manson remains worth watching for crime buffs thanks to its one-of-a-kind footage of the Manson followers: when Sandra Good and Lynette Fromme discuss their &quot;anything goes&quot; philosophy while brandishing guns, it is genuinely chilling in a way most horror movies can only aspire to be. In the end, Manson is a bit too self-conscious and uneven in its handling of its subject to be a definitive portrait but offers enough memorable moments to make it worthwhile for those interested in this case.\n\n\nCast (Credited cast)\n\n Mary Brunner ...  Herself \n Vincent Bugliosi ...  Himself \n Bruce Davis ...  Himself \n Lynette Fromme ...  Herself \n Sandra Good ...  Herself \n Steve Grogan ...  Himself \n Ronnie Howard ...  Herself \n Charles Manson ...  Himself \n Jess Pearson ...  Narrator (voice) \n Phil Phillips ...  Himself \n Nancy Pitman ...  Herself \n Brooks Poston ...  Himself \n Catherine Share ...  Herself \n George Spahn ...  Himself \n Paul Watkins ...  Himself \n\n\n","torrent":{"xt":"urn:btih:396f13f76694c5c33d35ed451eae4d0b6da275f9","amp;dn":"Manson+-+Documentary+-+Laurence+Merrick+-1972+-+93+min.+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"396f13f76694c5c33d35ed451eae4d0b6da275f9","infoHashBuffer":{"type":"Buffer","data":[57,111,19,247,102,148,197,195,61,53,237,69,30,174,77,11,109,162,117,249]},"announce":[],"urlList":[]}}