{"title":"Neil Young - Live at the Cellar Door [2013] [FLAC]","uid":9340465,"size":248723922,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3a2cd9a41383fbd18a014b4b166651114375e082&amp;dn=Neil+Young+-+Live+at+the+Cellar+Door+%5B2013%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmashAndGrab","files":-1,"time":1386922283,"description":"Neil Young - Live at the Cellar Door [2013] [FLAC]\n\nReleased ................ 2013\nSource .................. CD\nGenre ................... Pop/Rock\nStyle ................... Album Rock, Singer/Songwriter\nCodec ................... FLAC\nBit Depth ............... 16 bits\nSampling Rate ........... 44.1 KHz\n\n01 - Tell Me Why\n02 - Only Love Can Break Your Heart\n03 - After The Gold Rush\n04 - Expecting To Fly\n05 - Bad Fog Of Loneliness\n06 - Old Man\n07 - Birds\n08 - Don't Let It Bring You Down\n09 - See The Sky About To Rain\n10 - Cinnamon Girl\n11 - I Am A Child\n12 - Down By The River\n13 - Flying On The Ground Is Wrong\n\nIn late 1970, Neil Young was coming down from a bustling two-year stretch of touring with the immensely popular Crosby, Stills, Nash &amp; Young and had just released his third solo album, After the Goldrush. That album, lodged between the jammy country rock of 1969's Crazy Horse-aided Everybody Knows This Is Nowhere and the hushed, hermetic folk of 1972's Harvest, found an ethereal and otherworldly middle ground for Young's rapidly developing songwriting voice. Live at the Cellar Door finds a solo Young just a few months after the release of After the Goldrush, playing a six-show stint at the tiny Washington D.C. club, running through a set heavy on the relatively new material from Gold Rush, but also getting into songs that wouldn't see album release for a few more records yet. It would have been impossible to gauge at the time of the performance, but the set list of Live at the Cellar Door is a non-stop string of what would become some of Young's many timeless classics, punctuated by the sound of the unthinkably small audience clapping politely as he wove through 15 magical compositions on spare acoustic guitar and occasional piano. Not just heavy on highlights, this is a rare live recording that lacks any duds or missteps at all. Apart from near-perfect selections from After the Goldrush like its fever-dream title track, the heartbreaking &quot;Birds,&quot; or the long look at growing up in &quot;Tell Me Why,&quot; Young debuts future hit &quot;Old Man&quot; as well as the On the Beach piano dirge &quot;See the Sky About to Rain.&quot; He also offers up a piano-only reading of &quot;Cinnamon Girl,&quot; announcing &quot;That's the first time I ever did that one on piano.&quot; Part of an ongoing archival series of key live dates from Young's massive career, Live at the Cellar Door includes snippets of the usual between-song banter, but a noticeably tired Young is more subdued even when making dry jokes. Sticking mostly to focused readings of his then-brand-new songs, he cultivates a somber mood, tapping into all the sorrow, wonder, and wistfulness of his early solo material as well as a few Buffalo Springfield tunes. These tracks feel much more like an album of alternate versions than a typical live recording. The intimacy and raw beauty of Live at the Cellar Door makes it not just a must for super fans, but a valuable companion piece to any of Young's early studio output.\n &lt;a href=&quot;\nhttp://i.imgur.com/8RPZCkZ.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/8RPZCkZ.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:3a2cd9a41383fbd18a014b4b166651114375e082","amp;dn":"Neil+Young+-+Live+at+the+Cellar+Door+%5B2013%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a2cd9a41383fbd18a014b4b166651114375e082","infoHashBuffer":{"type":"Buffer","data":[58,44,217,164,19,131,251,209,138,1,75,75,22,102,81,17,67,117,224,130]},"announce":[],"urlList":[]}}