{"title":"Astral Masters v1.91","uid":7972659,"size":9730367,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3aaf5900f64e24319c8b7ef693a5eb2c57fe7d67&amp;dn=Astral+Masters+v1.91&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"473577249","files":1,"time":1356898956,"description":"Description\nChallenge your brains and hone strategic thinking skills in a new turn-based strategy card game Astral Masters. The downloadable table game builds on the success of its massively popular predecessor - Astral Tournament that won the hearts and minds of thousands of card players around the world. Take a fantastic tour to the elaborately themed world of mages and wizards and engage into hot duels with hundreds of sneaky and artful magicians who will try to stop you on your way to Archmage ranks. Download table game and have hours of strategic fun. In Astral Masters you will become a mage who specializes in some magic element such as Fire, Earth, Air, Water, or all at a time. Also, there will be six creatures to help you attack the enemy mage. Your life will depend on the number of magic elements you use and most typically it'll be 40 points. Your objective will be to weaken your opponent by casting spells and summoning creatures so that the enemy's life falls down to zero. The strength of your attack will depend on your overall power - the higher it will be, the more chances for victory you'll have. \nFeatures\nTotally addictive gameplay\nEye-pleasing graphics with artistic murals\nDifferent enemy mages\nComprehensive player's guide\n\nSystem Requirements\nWindows XP/Vista/7\nProcessor 400 Mhz or better\n60 Mb RAM\n32 Mb of video memory\nDirectX 8.0\nAll files are scanned before uploading here:http://www.virustotal.com,\nand local virus programms\nSome files get falsely detected as being virus, but this is not the case, we has no \nwish to cause infection to anyone's computer.  If this bothers you, try another antivirus \nprogram or just buy the game.","torrent":{"xt":"urn:btih:3aaf5900f64e24319c8b7ef693a5eb2c57fe7d67","amp;dn":"Astral+Masters+v1.91","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aaf5900f64e24319c8b7ef693a5eb2c57fe7d67","infoHashBuffer":{"type":"Buffer","data":[58,175,89,0,246,78,36,49,156,139,126,246,147,165,235,44,87,254,125,103]},"announce":[],"urlList":[]}}