{"title":"James Bradley - Flags of Our Fathers","uid":8635450,"size":181780480,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3abba63e0b44446e04378fb6a64f6984f46c76b4&amp;dn=James+Bradley+-+Flags+of+Our+Fathers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Wldsthrnboy","files":-1,"time":1372730984,"description":"Written by James Bradley \nRead by Barry Bostwick \nFormat: MP3 \nAbridged \n\nIn February 1945, American Marines plunged into the surf at Iwo Jima - and into history. Through a hail of machine-gun and mortar fire that left the beaches strewn with comrades, they battled to the island's highest peak. And after climbing through a landscape of hell itself, they raised a flag. Now the son of one of the flag raisers has written a powerful account of six very different men who came together in a moment that will live forever.\n\nTo his family, John Bradley never spoke of the photograph or the war. But after his death at age 70, his family discovered closed boxes of letters and photos. In Flags of Our Fathers, James Bradley draws on those documents to retrace the lives of his father and the men of his company. Following these men's paths to Iwo Jima, James Bradley has written a classic story of the heroic battle for the Pacific's most crucial island.\n\nBut perhaps the most interesting part of the story is what happened after the victory. The men in the photo - three were killed during the battle - were proclaimed heroes and flown home, to become reluctant symbols. For two of them, the adulation was shattering. Only James Bradley's father truly survived, displaying no copy of the famous photograph in his home, telling his son only: &quot;The real heroes of Iwo Jima were the guys who didn't come back.&quot;","torrent":{"xt":"urn:btih:3abba63e0b44446e04378fb6a64f6984f46c76b4","amp;dn":"James+Bradley+-+Flags+of+Our+Fathers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3abba63e0b44446e04378fb6a64f6984f46c76b4","infoHashBuffer":{"type":"Buffer","data":[58,187,166,62,11,68,68,110,4,55,143,182,166,79,105,132,244,108,118,180]},"announce":[],"urlList":[]}}