{"title":"The Banner Saga 2-CODEX","uid":14360376,"size":3619133767,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3bc0eae9dbc220802e638a7d4d0fea771b29178e&amp;dn=The+Banner+Saga+2-CODEX&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":5,"time":1461093219,"description":"About This Game\r\nThe award winning and BAFTA nominated saga continues in The Banner Saga 2. Continue your journey soon after the climactic events of The Banner Saga. The choices you made in the first game will affect who is alive and who is dead in this exciting sequel. As the world continues to crumble around you, only one bastion of hope remains, but getting there will require strong leadership, hard sacrifices, influencing new heroes, and, as always, sound strategy in combat.\r\n\r\nKEY GAME FEATURES\r\n• The epic Viking saga continues on – beautifully 2D hand drawn combat sequences and animations are further enhanced with special effects, once again accompanied by an evocative score from Grammy-nominated composer Austin Wintory\r\n• Player choice that continues to drive your narrative – your story continues based on choices made in the first game as well as hard choices you have to make in this one.\r\n• New Characters and a New Race – continue your epic journey interacting with new characters and a new race, the Horseborn.\r\n• Improved Strategic combat with consequences – improved, more strategic battle boards enhance combat and permanent loss of characters will still weigh heavy on your mind long after the battle is over.\r\n• The journey is as important as battle – your role in building and managing your caravan as you travel the vast landscape is critical to not only your own survival but the survival of an entire civilization","torrent":{"xt":"urn:btih:3bc0eae9dbc220802e638a7d4d0fea771b29178e","amp;dn":"The+Banner+Saga+2-CODEX","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bc0eae9dbc220802e638a7d4d0fea771b29178e","infoHashBuffer":{"type":"Buffer","data":[59,192,234,233,219,194,32,128,46,99,138,125,77,15,234,119,27,41,23,142]},"announce":[],"urlList":[]}}