{"title":"Pavarotti Forever","uid":5142580,"size":214081050,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3c625c896995656ac06ecea86e0a3572371a12ee&amp;dn=Pavarotti+Forever&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dougietrotter","files":-1,"time":1257026689,"description":"This double CD was released within weeks of Pavarotti's demise from pancreatic cancer. CD 1 is devoted to his greatest hits from opera, CD 2 mainly to the greatest hits on the crossover-pop side of his career. \n\nToward the end of his long public life, Pavarotti was dismissed by critics as musically irrelevant, a once-great voice pushed far beyond its viable life span. At worst he was seen as a defector from the sacred temple of classical music to the muddy arena of popular kitsch. \n\nYet I loved him - the world loved him - beyond any other tenor in modern memory. He was immense and lovable in all his incarnations, whether at Wembley Stadium, Central Park, the Met, or his native Modena. Painted by the media as a creature of excess, I have no doubt he was, but what a glorious excess! \n\nIntimates described him as a child in a man's huge body, and he was often as lazy as he was self-indulgent. Does any of that matter? As the opera selections in this set testify, Pavarotti's dedication to the highest artistic standards was a hallmark of his musicianship for twenty years. He was extravagantly gifted but also extravagantly giving. What he had to give was all of himself. That's a hugely egotistical way to go through life, and yet for the rare few who can bring it off, it's also hugely rewarding, for both giver and receiver. I will never forget the one and only time I heard the great man in recital, and despite the hype of &quot;Pavarotti Forever,&quot; his name will endure for a very, very long time. \n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3c625c896995656ac06ecea86e0a3572371a12ee","amp;dn":"Pavarotti+Forever","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c625c896995656ac06ecea86e0a3572371a12ee","infoHashBuffer":{"type":"Buffer","data":[60,98,92,137,105,149,101,106,192,110,206,168,110,10,53,114,55,26,18,238]},"announce":[],"urlList":[]}}