{"title":"Beef - The Untold Story of How Milk, Meat, and Muscle Shaped the","uid":4857650,"size":1956737,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ca72caf0f7cce5aa110a4f6eb6fe8876472ad4c&amp;dn=Beef+-+The+Untold+Story+of+How+Milk%2C+Meat%2C+and+Muscle+Shaped+the&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philmccrevice","files":1,"time":1240131001,"description":"While Americans may take a plentiful supply of hamburger patties for granted, the days of easy beef are threatened by climate change, dwindling Great Plains aquifers drained by irrigation and an unsustainable business model's thin profit margins, argue the authors of this lively and unsettling history-cum-polemic. Rimas and Fraser preface their sobering assessment with a panoramic history; they write vividly about the semimystical aurochs that became extinct in 1627, the Spanish bullfighting tradition, the African Masai's continuing reverence for cows, plagues that ravaged European herds in the 19th century, and the cowboy era of great cattle drives. Once fattened entirely on pasture grass, cattle are now confined to feedlots for half their lives, pumped full of hormones and antibiotics and stuffed with grain they aren't naturally equipped to eat, sacrificing quality for quantity. The authors lament that cows ceased to be animals and they became commodities, and they certainly aren't antimeat; their colorful account is well-seasoned with a series of culinary interludes for such dishes as bull's tail stew, steak tartare, beef jerky and, of course, the great American hamburger","torrent":{"xt":"urn:btih:3ca72caf0f7cce5aa110a4f6eb6fe8876472ad4c","amp;dn":"Beef+-+The+Untold+Story+of+How+Milk%2C+Meat%2C+and+Muscle+Shaped+the","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ca72caf0f7cce5aa110a4f6eb6fe8876472ad4c","infoHashBuffer":{"type":"Buffer","data":[60,167,44,175,15,124,206,90,161,16,164,246,235,111,232,135,100,114,173,76]},"announce":[],"urlList":[]}}