{"title":"Complete Marvel Chronology  CMC 1972","uid":9432627,"size":6772856031,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3cc7a7a8286f4b771699d5630c24b434358faff5&amp;dn=Complete+Marvel+Chronology++CMC+1972&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"7","files":-1,"time":1388835083,"description":"1972 Dracula, Werewolf, Ghost Rider and Man-Thing - The Year of Horror\n\n1971 had seen Marvel challenge the Comics Code and the reception that the drugs story received, coupled with the popularity and respect Marvel's comics were receiving, saw a significant change in the Code.\n\nThe result was a release of horror titles not seen since the fifties, with Dracula, the Werewolf, Ghost Rider and Man-Thing all getting their own titles. In addition the X-Men's Beast also saw a change as he lost the human look he'd had since birth and now turned into a far more beastly and hairy form.\n\nIn the editorial offices, Stan Lee became publisher of all Martin Goodman's magazines and comics. This gave the editor-in-chief role to Roy Thomas, Marvel's innovative and talented writer.\n\nRoy Thomas would introduce a wide range of new titles embracing not just the Superhero genre but also many other genres, as well as bring in many talented names to bolster the Bullpen's burgeoning list of titles.\n\nAbout the Complete Marvel Chronology by PeteThePIPster\n\nThe Complete Marvel Chronology (CMC) is version 2.0 of the Marvel Chronology (MC).\n\nThe MC was created by cyager69 aka Chuck, who uploaded Marvel comics beginning with Fantastic Four 001 (Nov 61) through to the issues published in Jun 1997.\n\nWhen Chuck was unable to continue the uploads I took over the MC and uploaded the remainder of the issues through to December 2008. Additional uploads added various titles not cover-dated with a specific month (the 'Decades' uploads) and seven Fill packs added new scans for issues missing when the original uploads were done for the 70's through to the 90's.\n\nWith none of Chuck's original uploads online, the decision was to either upload the original version of 1961-1996 or go with a brand new, full version incorporating the missing genres, such as romance, western and humour, and including the imprints which Chuck intended to upload following the completion of the MC.\n\nThe CMC will cover Marvel's entire seventy year history. At present I am uploading the years beginning with 1960 and these uploads will continue right through to December 1996. After that I have not finalised what will follow, but the likelihood will be that I go back to upload the 39-59 period, and then upload the 97-09 period again. When I do upload version 2.0 of 97-09 there will be many additions and many new scans.\n\nNews and Notes by PeteThePIPster\n\n1972 00-12 slightly later than planned, hopefully worth the wait.\n\nJustice League of America issue 103 sees the second DC-Marvel 'crossover', after the Aquaman story in 1971.\n\nThis crossover continues in Amazing Adventures 016 and Thor 207 (both 1973) and features a story set in Rutland at Halloween.\n\nAcknowledgments\n\nBooks used as research material in completing the CMC include -\n\nMarvel Chronicle - Tom DeFalco\nMarvel Vault - Roy Thomas and Pete Sanderson\nTales of the Implosion - Tom Lammers\nStandard Catalogue of Comics 5th Edition\n\nThanks to PeteThePIPster for his amaziness and ability to put all this together.\n\nThanks to all the scanners, editors and uploaders who make the scans available.\n\nThanks for the support of all those who seed the CMC.\n\nThanks to Chuck for creating the MC.\n\nMore info and covers at:\n &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-%E2%98%BA%E2%99%8B%E2%99%82%E2%98%A0%E2%98%80%E2%98%AE-%C6%AE%E2%98%AF%C2%AE%C2%AE%C6%90%C6%9D%E2%98%A8%C2%A7-%E2%98%AE%E2%98%80%E2%98%A0%E2%99%82%E2%99%8B%E2%98%BA?pid=16685#pid16685&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-%E2%98%BA%E2%99%8B%E2%99%82%E2%98%A0%E2%98%80%E2%98%AE-%C6%AE%E2%98%AF%C2%AE%C2%AE%C6%90%C6%9D%E2%98%A8%C2%A7-%E2%98%AE%E2%98%80%E2%98%A0%E2%99%82%E2%99%8B%E2%98%BA?pid=16685#pid16685&lt;/a&gt;","torrent":{"xt":"urn:btih:3cc7a7a8286f4b771699d5630c24b434358faff5","amp;dn":"Complete+Marvel+Chronology++CMC+1972","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cc7a7a8286f4b771699d5630c24b434358faff5","infoHashBuffer":{"type":"Buffer","data":[60,199,167,168,40,111,75,119,22,153,213,99,12,36,180,52,53,143,175,245]},"announce":[],"urlList":[]}}