{"title":"The Lie Behind the Lie Detector","uid":5421881,"size":1032800,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cc89d8f9434d56dc602d3776cd47eba5a116576&amp;dn=The+Lie+Behind+the+Lie+Detector&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zzoob","files":1,"time":1268116343,"description":"The Lie Behind the Lie Detector\nby George W. Maschke and Gino J. Scalabrini\n\nAlso available at http://antipolygraph.org/pubs.shtml or on-line at Scribd.com.\n\nExecutive Summary\n\nPOLYGRAPH &quot;testing&quot; has no scientific basis: it's entirely dependent on your ignorance and fear. Educate yourself. In this book, you will discover the trickery on which polygraph &quot;testing&quot; depends, and learn how to make sure you pass your polygraph &quot;test.&quot;\n\nOur government's reliance on unreliable polygraph &quot;testing&quot; is both a danger to our national security and a hazard to the reputations of law-abiding citizens whose trustworthiness is judged by this voodoo science. The Lie Behind the Lie Detector exposes polygraph waste, fraud, and abuse.\n\nChapter One covers the validity of polygraph &quot;testing.&quot; Polygraphy can have no scientific validity because it is not a scientific procedure.\n\nChapter Two discusses polygraph policy, with special emphasis on the Aldrich H. Ames espionage case. In addition, the false positive problem in polygraph security screening is also discussed in detail.\n\nChapter Three exposes the trickery on which polygraph &quot;testing&quot; depends.\n\nChapter Four provides detailed instructions on how to use polygraph countermeasures to protect yourself against becoming a false positive.\n\nChapter Five discusses grievance procedures for those who have been falsely accused based on polygraph chart readings.\n\nThe Lie Behind the Lie Detector is free for non-commercial use and distribution.","torrent":{"xt":"urn:btih:3cc89d8f9434d56dc602d3776cd47eba5a116576","amp;dn":"The+Lie+Behind+the+Lie+Detector","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cc89d8f9434d56dc602d3776cd47eba5a116576","infoHashBuffer":{"type":"Buffer","data":[60,200,157,143,148,52,213,109,198,2,211,119,108,212,126,186,90,17,101,118]},"announce":[],"urlList":[]}}