{"title":"Oxford Take Off In Russian","uid":7504694,"size":320095296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ccd17231e9d9a5af248543205ca9bf6e4a812b7&amp;dn=Oxford+Take+Off+In+Russian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"obamaladen","files":119,"time":1344131181,"description":"Oxford Take Off in Russian\n\nFor anyone who has ever wanted to learn a language but has been intimidated by the process, Oxford presents this new enjoyable and efficient language learning series. Based on the idea that the easiest and most effective way to learn a foreign language is by developing the key skills of listening and comprehension, each volume in Oxford's new Take off... series features 5 hours of audio content, fully reinforced by a clearly laid-out, grammatically structured course book, giving learners a unique and innovative approach to language learning.\n\nEach Take off... unit is designed specifically to meet the needs of anyone learning a language on their own. The series gives learners the confidence to communicate from the very first lesson by offering more practice in listening to and speaking the language than any comparable course. Here are some of the outstanding features of this series:\n\n* Listening and speaking skills, the building blocks of language learning, are emphasized in 5 hours of audio content\n\n* No prior knowledge of the language is required--this course is designed to be used by an absolute beginner or by anyone who needs to brush up on lost language skills\n\n* The course is made up of carefully structured learning blocks within each unit to break the learning process up into manageable sections\n\n* A continuous story runs throughout the course, showcasing everyday life in the culture, and making language learning more fun\n\n* Cultural information is included in every lesson\n\n* Regular self-assessment sections show learners instantly how far they've progressed\n\n* The course is backed up by a solid grammatical toolkit, which builds step-by-step on the knowledge learners gain as they move through the course\n\n* Business vocabulary and customs are covered as well as general and social vocabulary and situations","torrent":{"xt":"urn:btih:3ccd17231e9d9a5af248543205ca9bf6e4a812b7","amp;dn":"Oxford+Take+Off+In+Russian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ccd17231e9d9a5af248543205ca9bf6e4a812b7","infoHashBuffer":{"type":"Buffer","data":[60,205,23,35,30,157,154,90,242,72,84,50,5,202,155,246,228,168,18,183]},"announce":[],"urlList":[]}}