{"title":"Confessions of an Economic Hitman","uid":5316664,"size":245829972,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3d278f357844242eef02b4907a9641a9e67b6fcd&amp;dn=Confessions+of+an+Economic+Hitman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"snuk11","files":-1,"time":1264732918,"description":"This is the inside story of how America turned from a respected republic into a feared empire.\n\n&quot;Economic hit men,&quot; John Perkins writes, &quot;are highly paid professionals who cheat countries around the globe out of trillions of dollars. Their tools include fraudulent financial reports, rigged elections, payoffs, extortion, sex, and murder.&quot;\n\nJohn Perkins should know; he was an economic hit man. His job was to convince countries that are strategically important to the U.S., from Indonesia to Panama, to accept enormous loans for infrastructure development and to make sure that the lucrative projects were contracted to Halliburton, Bechtel, Brown and Root, and other United States engineering and construction companies. Saddled with huge debts, these countries came under the control of the United States government, World Bank, and other U.S.-dominated aid agencies that acted like loan sharks, dictating repayment terms and bullying foreign governments into submission.\n\nThis extraordinary real-life tale exposes international intrigue, corruption, and little-known government and corporate activities that have dire consequences for American democracy and the world. ","torrent":{"xt":"urn:btih:3d278f357844242eef02b4907a9641a9e67b6fcd","amp;dn":"Confessions+of+an+Economic+Hitman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d278f357844242eef02b4907a9641a9e67b6fcd","infoHashBuffer":{"type":"Buffer","data":[61,39,143,53,120,68,36,46,239,2,180,144,122,150,65,169,230,123,111,205]},"announce":[],"urlList":[]}}