{"title":"Energy, the Subtle Concept [2015] [PDF]","uid":13492273,"size":7512355,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d3c6592f4a1e3c73148e214b94abfe40268075f&amp;dn=Energy%2C+the+Subtle+Concept+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1455139838,"description":"Title: Energy, the Subtle Concept: The discovery of Feynman's blocks from Leibniz to Einstein \r\nAuthor: Jennifer Coopersmith \r\nFormat: PDF \r\nHardcover: 416 pages \r\nPublisher: Oxford University Press; Revised edition (July 14, 2015) \r\nLanguage: English \r\nISBN: 9780198716747 \r\n\r\n\r\nEnergy is at the heart of physics and of huge importance to society and yet no book exists specifically to explain it, and in simple terms. In tracking the history of energy, this book is filled with the thrill of the chase, the mystery of smoke and mirrors, and presents a fascinating human-interest story. Moreover, following the history provides a crucial aid to understanding: this book explains the intellectual revolutions required to comprehend energy, revolutions as profound as those stemming from Relativity and Quantum Theory. Texts by Descartes, Leibniz, Bernoulli, d'Alembert, Lagrange, Hamilton, Boltzmann, Clausius, Carnot and others are made accessible, and the engines of Watt and Joule are explained.\r\n\r\nMany fascinating questions are covered, including:\r\n\r\n- Why just kinetic and potential energies - is one more fundamental than the other?\r\n- What are heat, temperature and action?\r\n- What is the Hamiltonian?\r\n- What have engines to do with physics?\r\n- Why did the steam-engine evolve only in England?\r\n- Why S=klogW works and why temperature is IT.\r\n\r\nUsing only a minimum of mathematics, this book explains the emergence of the modern concept of energy, in all its forms: Hamilton's mechanics and how it shaped twentieth-century physics, and the meaning of kinetic energy, potential energy, temperature, action, and entropy. It is as much an explanation of fundamental physics as a history of the fascinating discoveries that lie behind our knowledge today","torrent":{"xt":"urn:btih:3d3c6592f4a1e3c73148e214b94abfe40268075f","amp;dn":"Energy%2C+the+Subtle+Concept+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d3c6592f4a1e3c73148e214b94abfe40268075f","infoHashBuffer":{"type":"Buffer","data":[61,60,101,146,244,161,227,199,49,72,226,20,185,74,191,228,2,104,7,95]},"announce":[],"urlList":[]}}