{"title":"Esbjorn Svensson Trio - Esbjorn Svensson Trio plays Monk 1996","uid":6666042,"size":285450833,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d70084acc585e4358cdc0de2e093d1bee1a1964&amp;dn=Esbjorn+Svensson+Trio+-+Esbjorn+Svensson+Trio+plays+Monk+1996&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1315685822,"description":"Thelonius Monk was one of the truly great piano geniuses on the international jazz scene.\nEsbjÃƒÂ¶rn Svensson is one of the truly great piano talents on the Scandinavian jazz scene.\n\nIn some way you knew that they had to meet sooner or later. At last spiritually. And musically. Plays Monk, is the telling title of the CD from 1996 by EsbjÃƒÂ¶rn Svensson Trio (EST). Ten of the most beloved songs by Monk, from nocturnal, lovingly caressing Round Midnight, to the gay and sprightly Rhythm-A-Ning, gets here a becomingly shining new colour.\n\nIn EST we have Magnus OstrÃƒÂ¶m on drums, Dan Berglund on double-bass and, of course, EsbjÃƒÂ¶rn Svensson himself, who was an infant when he practically learnt to walk to the sound of In Walked Bud.\n\nMy father was and is a great jazz lover. So I was very young when I first came in touch with Monks music. He is the kind of composer that cannot be avoided, says EsbjÃƒÂ¶rn Svensson. The music of Thelonius Monk is a peculiar mixture of simplicity and and complexity; of larguorous ballads and rhythms turned inside out. The music is a challenge. You can always give it your personal touch, explains EsbjÃƒÂ¶rn.\n\nOn Plays Monk, you notice this over and over again. EST has for instance made is own interpretation of the classic Round Midnight, complete with a new string arrangement signed EsbjÃƒÂ¶rn Svensson. The haunting string section is played by four members of the Swedish radio Symphony Orchestra.\n\nBoth Monk and EST have a common determination to go beyond the sometimes rather narrow items of jazz music. This is noticeable if we take a look at the musical past of the trio, who has played with such diverse luminaries as Rebecka Tornkvist, Nisse Landgren, Svante Thuresson, Lisa Nilsson and Louise Hoffsten.\n\nThis is definitely a trio who seeks challenges; who wants to try the unexpected. And the spirit of Monk is certainly here, hovering over the recordings that were made together with a producer we do normaly not connect with jazz: Johan Ekelund, who is probably most wellknown as one half of the successful soulpop duo Ratata. He brought fresh ideas into this project. I certainly hope we can record together gaian, said EsbjÃƒÂ¶rn, who doesnt want to label himself as a inventerate jazz purist. Soul and pop is often playd at home, when EsbjÃƒÂ¶rn Svensson himself is there.\n\nEST is a bunch of regular tour horses, doing frequent gigs both in and outside Sweden. They have played both small clubs and big festivals in many countries, for instance Chile, Spain, France, Belgium and Germany. And they have won the hearts of both fans and hardened critics.\n\nAfter all, the album is called Plays Monk - a meeting between talent and geniality. The result? Rhythm-A-Ning, pure and simple!\n\n- - -\n\nEsbjÃƒÂ¶rn Svensson Trio - EsbjÃƒÂ¶rn Svensson Trio plays Monk 1996\n(Stockholm Superstudio gul)\n\n 1. I mean you \n 2. Criss cross \n 3. Round midnight \n 4. Bemsha swing \n 5. Rhythm-a-ning \n 6. In walked Bud \n 7. Little rootie tootie \n 8. Eronel \n 9. Evidence \n10. Crepuscule with Nellie\n","torrent":{"xt":"urn:btih:3d70084acc585e4358cdc0de2e093d1bee1a1964","amp;dn":"Esbjorn+Svensson+Trio+-+Esbjorn+Svensson+Trio+plays+Monk+1996","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d70084acc585e4358cdc0de2e093d1bee1a1964","infoHashBuffer":{"type":"Buffer","data":[61,112,8,74,204,88,94,67,88,205,192,222,46,9,61,27,238,26,25,100]},"announce":[],"urlList":[]}}