{"title":"Pontius Pilate Calls Jesus God, Says Jews Conspired - NT Pseud","uid":4639028,"size":281278,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e12053d5a21a43cf5b8da6985c4cc887457a68e&amp;dn=Pontius+Pilate+Calls+Jesus+God%2C+Says+Jews+Conspired+-+NT+Pseud&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CuriousGeorge","files":3,"time":1231654697,"description":"Non-Canon New Testament\n\nHTML File - herpilat\nContents \nLETTERS OF HEROD AND PILATE\nLETTER OF HEROD TO PILATE THE GOVERNOR\nLETTER OF PILATE TO HEROD\nTHE REPORT OF PILATE THE GOVERNOR\nTHE REPORT OF PONTIUS PILATE, GOVERNOR OF JUDEA, WHICH WAS SENT TO TIBERIUS CAESAR IN ROME\nTHE EPISTLE OF PONTIUS PILATE\nTHE TRIAL AND CONDEMNATION OF PILATE\nTHE DEATH OF PILATE, WHO CONDEMNED JESUS\n\n\nThe Letter of Pontius Pilate, Which He Wrote to the Roman Emperor Tiberius, Concerning Our Lord Jesus Christ\n\nThe Letters of Herod\n\n\n(TalmudTimmy: The North American Churches have conveniently ignored the extraordinary writings of the New Testament &quot;Pseudepigrapha,&quot; which shows that Pilate repented of caving into the Sanhedrin and the Jewish lobby that had Jesus crucified. Pilate shows adoration for Jesus and condemnation for the Jews.\n\nProtestant father, Martin Luther must have been well read in these writings which may have lead him to write &quot;The Jews and Their Lies.&quot;\n\nPilate also cleary demonstrates a Preterist, historical, and/or Post Millenial view of Biblical prophecy by saying this about a physical resurrection in his time;\n&quot;And amid the terror dead men were seen rising, so that the Jews who saw it said, We beheld, Abraham, Isaac, and Jacob, and the twelve patriarchs, who died some two thousand five hundred years before, and cleary we beheld Noah in the body.&quot;)\n\nExcerpts:\n\n&quot;I know that thou art God, the Son of God, and I beheld thy humanity and not thy divinity.&quot; -- Letter of Pilate to Herod\n\n\nMany Jews Who Spoke Against Jesus Died\nPilate to Tiberius \n\n&quot;And many of the Jews died, and were engulphed and swallowed up in the chasms in that night, so that not even their bodies appeared. Those, I say, of the Jews suffered that had spoken against Jesus.&quot;\n\nSynagogues That Were Against Jesus Destroyed\nPilate to Tiberius \n\n&quot;And one synagogue was left in Jerusalem, since all those synagogues that had been against Jesus were engulphed.&quot;\n\nThe Light Did Not Cease Shining All Night\nReport of Pilate \n\n&quot;And all that night the light did not cease shining. And many of the Jews died in the chasm of the earth, being swallowed up, so that in the morning most of those who had been against Jesus were not to be found.&quot;\n\nLETTERS OF PONTIUS PILATE\n\nwritten during his Governorship of Judaea to his friend Seneca in Rome \n\n","torrent":{"xt":"urn:btih:3e12053d5a21a43cf5b8da6985c4cc887457a68e","amp;dn":"Pontius+Pilate+Calls+Jesus+God%2C+Says+Jews+Conspired+-+NT+Pseud","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e12053d5a21a43cf5b8da6985c4cc887457a68e","infoHashBuffer":{"type":"Buffer","data":[62,18,5,61,90,33,164,60,245,184,218,105,133,196,204,136,116,87,166,142]},"announce":[],"urlList":[]}}