{"title":"Sonny Rollins And Coleman Hawkins - 1963 - Sonny Meets Hawk! (vi","uid":9525304,"size":954498067,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3e8e95eadb71ee1f0a06d381cfc04da7ee9ce8f0&amp;dn=Sonny+Rollins+And+Coleman+Hawkins+-+1963+-+Sonny+Meets+Hawk%21+%28vi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1390697412,"description":"Sonny Rollins And Coleman Hawkins - 1963 - Sonny Meets Hawk!\nVinyl 24 bits, 96 KHz\n\nThroughout a career that spanned more than 40 years, Coleman Hawkins consistently maintained a progressive attitude, operating at or near the cutting edge of developments in jazz. If Hawk's versatility came in handy when he backed Abbey Lincoln during Max Roach's 1960 We Insist! Freedom Now Suite, he took on an assignment of challenging dimensions when in 1963 he cut an entire album with Sonny Rollins in the company of pianist Paul Bley, bassists Bob Cranshaw and Henry Grimes, and drummer Roy McCurdy. Coleman Hawkins and Sonny Rollins each virtually defined the tenor saxophone for his respective generation. To hear the two of them interacting freely is a deliciously exciting experience. Hawkins is able to cut loose like never before. Sometimes the two collide, locking horns and wrestling happily without holding back. For this reason one might detect just a whiff of Albert Ayler's good-natured punchiness, particularly in the basement of both horns; such energies were very much in the air during the first half of the 1960s. Rather than comparing this date with the albums Hawkins shared with Ben Webster (1957), Henry &quot;Red&quot; Allen (1957), Pee Wee Russell (1961), or Duke Ellington (1962), one might refer instead to Hawk's wild adventures in Brussels during 1962 (see Stash 538, Dali) or Rollins' recordings from around this time period, particularly his Impulse! East Broadway Run Down album of 1965. Check out how the Hawk interacts with Rollins' drawn-out high-pitched squeaking during the last minute of &quot;Lover Man.&quot; On Sonny Meets Hawk!, possibly more than at any other point in his long professional evolution, Hawkins was able to attain heights of unfettered creativity that must have felt bracing, even exhilarating. He obviously relished the opportunity to improvise intuitively in the company of a tenor saxophonist every bit as accomplished, resourceful, and inventive as he was. (AllMusic)\n\nTrack list:\nA1 Yesterdays\nA2 All The Things You Are\nA3 Summertime\nB1 Just Friends\nB2 Lover Man\nB3 At McKies'\n\nPersonnel:\nPiano - Paul Bley\nDrums - Roy McCurdy\nBass - Bob Crenshaw on &quot;Yesterdays,&quot; &quot;All The Things You Are&quot; and &quot;Lover Man.&quot; Henry Grimes on the rest.\n\nEnjoy and share!","torrent":{"xt":"urn:btih:3e8e95eadb71ee1f0a06d381cfc04da7ee9ce8f0","amp;dn":"Sonny+Rollins+And+Coleman+Hawkins+-+1963+-+Sonny+Meets+Hawk%21+%28vi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e8e95eadb71ee1f0a06d381cfc04da7ee9ce8f0","infoHashBuffer":{"type":"Buffer","data":[62,142,149,234,219,113,238,31,10,6,211,129,207,192,77,167,238,156,232,240]},"announce":[],"urlList":[]}}