{"title":"Spawn 221-223 (2012) (1440px &amp; 2048px-HD) (HALOTaru-Novus)","uid":7890486,"size":209251208,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:40614f87751a94ef8cc7d05835259b5f8878d823&amp;dn=Spawn+221-223+%282012%29+%281440px+%26amp%3B+2048px-HD%29+%28HALOTaru-Novus%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1354713724,"description":"This torrent includes both 1440px and 2048px-HD versions  \n*Note: You can download both or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software.  If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n========================================================\n\nEnglish | CBR | 3 Issues\n\nSpawn #221-223\nPublisher:  Image Comics\nPublication Date:  July 4, 2012 - september 5, 2012\n\nStory by:  Todd McFarlane\nArt By:  Szymon Kudranski\nCover By:  Todd McFarlane\n\nSpawn #221\nThe new era that began in the pages of SPAWN's hallmark 220th issue continues! Featuring a classic TODD McFARLANE cover re-imagined by the legendary artist as Image Comics and Todd McFarlane Productions continue SPAWN's 20th Anniversary celebration.\n\nJim Downing is a man possessed by a hellish power he cannot control, by a heavenly secret he doesn't understand, and by an unstoppable drive to piece together the mystery that is his lost past. Balancing the deadly realities of his secret life as the world's newest Hellspawn with the worldwide media frenzy as a new messiah for the Digital Age, Jim begins to embrace his abilities like never before. This all leads to a showdown with a classic Spawn adversary...\n\nTREMOR RETURNS!!!\n\n\nSpawn #222\nSPAWN'S 20th ANNIVERSARY CELEBRATION KICKS INTO HIGH GEAR! THE NEXT CHAPTER IN THE SECRET HISTORY OF JIM DOWNING! AND THE RETURN OF TREMOR!\n\nSPAWN and Tremor join forces to uncover the secrets of the clandestine military project that made them both monsters. The history of the SPAWN universe and Jim's place within its vast mythology continues to unfold as new details and mysteries come to the forefront.\n\n\nSpawn #223\nSPAWN'S LANDMARK 20th ANNIVERSARY CELEBRATION CONTINUES! ALL-NEW TODD MCFARLANE COVER, FEATURING A RARE BLACK-AND-WHITE VARIANT! LONG-AWAITED ANSWERS COME TO LIGHT! PLUS A FAN-FAVORITE CHARACTER IS CHANGED... FOREVER!\n\nSpawn and Tremor take a prisoner in their ongoing war to discover the truth behind The Program - the clandestine military operation that made them both monsters. As the interrogation heats up, the reality of Jim's memories begin to take shape. Was he the architect of his own downfall, or a victim of those with far more sinister intent?\n\nThanks goes to HALO and Tarutaru for this release.\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7890472/Spawn_220_(2012)_(1440px__amp_amp__2048px-HD)_(theFragile-Novus)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7890472/Spawn_220_(2012)_(1440px__amp_amp__2048px-HD)_(theFragile-Novus)&lt;/a&gt;","torrent":{"xt":"urn:btih:40614f87751a94ef8cc7d05835259b5f8878d823","amp;dn":"Spawn+221-223+%282012%29+%281440px+%26amp%3B+2048px-HD%29+%28HALOTaru-Novus%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40614f87751a94ef8cc7d05835259b5f8878d823","infoHashBuffer":{"type":"Buffer","data":[64,97,79,135,117,26,148,239,140,199,208,88,53,37,155,95,136,120,216,35]},"announce":[],"urlList":[]}}