{"title":"Green Day - Dookie (1994) [LOSSLESS FLAC][Tntvillage]","uid":5306931,"size":291666498,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4143e8e3f7122b598e24a180231ad6a97c169cb4&amp;dn=Green+Day+-+Dookie+%281994%29+%5BLOSSLESS+FLAC%5D%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RDaneel20","files":17,"time":1264429252,"description":"Green Day - Dookie (1994) [LOSSLESS FLAC][Tntvillage.Scambioetico]\n\n\n\n\n\nGreen Day - Dookie\n\n\nby RDaneel\n\n\n\n\n\n\n\n\n[::Album Information::]\n\nTitle: Dookie\nYears: 1994\nGenre: Punk\nProduction: Reprise\n\n\n\n[::Tracklist::]\n\n\n1. Burnout - 2:07\n2. Having A Blast - 02:44\n3. Chump - 2:54\n4. Longview - 3:59\n5. Welcome To Paradise - 3:44\n6. Pulling Teeth - 2:31\n7. Basket Case - 3:03\n8. She - 2:14\n9. Sassafrass Roots - 2:37\n10. When I Come Around - 2:58\n11. Coming Clean - 1:35\n12. Emenius Sleepus - 1:44\n13. In The End - 1:46\n14. F.O.D. - 5:47\n\n\n\n[::Review::]\n\nGreen Day is an American rock trio formed in 1987. The band has consisted of Billie Joe Armstrong (vocals, guitar), Mike Dirnt (bass guitar, vocals), and TrÃƒÂ© Cool (drums, percussion) for the majority of its existence.\nGreen Day was originally part of the punk rock scene at 924 Gilman Street in Berkeley, California. Its early releases for independent record label Lookout! Records earned them a grassroots fanbase, some of whom felt alienated when the band signed to a major label. Nevertheless, its major label debut Dookie (1994) became a breakout success and eventually sold over 10 million copies in the U.S. and 15 million worldwide. As a result, Green Day was widely credited, alongside fellow California punk bands The Offspring and Rancid, with reviving mainstream interest in and popularizing punk rock in the United States. Green Day's three follow-up albums, Insomniac, Nimrod and Warning did not achieve the massive success of Dookie, but they were still successful, reaching double platinum, double platinum, and gold status respectively. Green Day's 2004 rock opera American Idiot reignited the band's popularity with a younger generation, selling five million copies in the U.S.The band's eighth studio album, 21st Century Breakdown, was released on May 15, 2009.\nGreen Day has sold over 22 million records in the United States. They have won three Grammy Awards; Best Alternative Album for Dookie, Best Rock Album for American Idiot, and Record of the Year for &quot;Boulevard of Broken Dreams&quot;.\n\nDookie\n\nDookie is the third studio album and the major label debut by American punk rock band Green Day. The album was the band's first collaboration with producer Rob Cavallo. Released on February 1, 1994 through Reprise Records, Dookie became a worldwide commercial success, reaching number two on the U.S. Billboard 200 and charting in seven countries. The album helped to propel Green Day into mainstream popularity, amid claims from the punk rock community that the band had &quot;sold out&quot;.\nDookie produced five hit singles for the band: &quot;Longview&quot;, the re-recorded &quot;Welcome to Paradise&quot;, &quot;Basket Case&quot;, the radio-only single &quot;She&quot; and &quot;When I Come Around&quot;. As of 2008, Dookie is the band's best-selling album, with over 15 million copies sold worldwide. It is Green Day's only diamond album. Dookie won the Grammy Award for Best Alternative Music Album in 1995. Much of the album's content was written by Armstrong, except &quot;Emenius Sleepus&quot; which was co-written by Armstrong and bassist Mike Dirnt, and the hidden track, &quot;All By Myself&quot;, which was composed and written by drummer TrÃƒÂ© Cool. The album touched upon various experiences of the band members and included subjects like anxiety and panic attacks, masturbation, sexual orientation, boredom, and former girlfriends.\nThe single &quot;Longview&quot; had a signature bass line that bass player Dirnt wrote while under the influence of LSD. He originally forgot much of it, but the remembered portions were included in the song. Armstrong stated that the song was mainly about boredom, masturbation, and smoking cannabis, as evident in some of the lyrics (&quot;When masturbation's lost its fun/You're fucking breaking&quot;).\n&quot;Welcome to Paradise&quot;, the second single from Dookie, was originally on the second studio album by the band, Kerplunk. The song was re-recorded, with a less grainy sound for Dookie. The song never had an official music video, however, a certain live performance of the song is often associated as a music video. The video is located on Green Day's official website.\nThe radio-only single, &quot;She&quot;, was written by Armstrong about a former girlfriend who showed him a feminist poem with an identical title. In return, Armstrong wrote the lyrics of &quot;She&quot; and showed them to her. She later moved to Ecuador, prompting Armstrong to put &quot;She&quot; on the album. The same ex-girlfriend is the topic of the songs &quot;Sassafras Roots&quot; and &quot;Chump&quot;.\nAnother song, &quot;Coming Clean&quot;, deals with Armstrong's coming to terms with his bisexuality when he was 16 and 17 years old. In his interview with The Advocate magazine, he says that although he has never had a relationship with a man, his sexuality has been &quot;something that comes up as a struggle in me&quot;. The hit single &quot;Basket Case&quot;, which appeared on many singles charts worldwide, was also inspired by Armstrong's personal experiences. The song deals with Armstrong's anxiety attacks and feelings of &quot;going crazy&quot; prior to being diagnosed with a panic disorder. The music video was filmed in an abandoned mental institution.\nThe final single, &quot;When I Come Around&quot;, was again inspired by a woman, though this time being about Armstrong's wife, then former girlfriend, Adrienne. Following a dispute between the couple, Armstrong left Adrienne to spend some time alone. The video featured the three band members walking around Berkeley and San Francisco at night, eventually ending up back at the original location. Future touring back up guitarist, Jason White, made a cameo in the video with his then-girlfriend.\nBillie Joe Armstrong wrote the song &quot;In The End&quot; about his mother and her boyfriend (similar to Why Do You Want Him). He is quoted saying: &quot;That song is about my mother's husband, it's not really about a girl, or like anyone directly related to me in a relationship. In the End's about my mother.&quot;","torrent":{"xt":"urn:btih:4143e8e3f7122b598e24a180231ad6a97c169cb4","amp;dn":"Green+Day+-+Dookie+%281994%29+%5BLOSSLESS+FLAC%5D%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4143e8e3f7122b598e24a180231ad6a97c169cb4","infoHashBuffer":{"type":"Buffer","data":[65,67,232,227,247,18,43,89,142,36,161,128,35,26,214,169,124,22,156,180]},"announce":[],"urlList":[]}}