{"title":"Private XXX 21: Inside Sex, Sex Inside (2005) - Tiffany Hopkins,","uid":4611635,"size":734343822,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:41eef0613e6d7375b966acd4a05322c0d4cacb96&amp;dn=Private+XXX+21%3A+Inside+Sex%2C+Sex+Inside+%282005%29+-+Tiffany+Hopkins%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pure_screens","files":4,"time":1230658089,"description":"Private XXX 21: Inside Sex, Sex Inside (2005)\n\n\n\n\nActresses\n\n    * Ellen Saint\n    * Alexa Weix (as Linda Shane) [Anal Facial]\n    * Lucy Love [Anal]\n    * Michaela Sabbattini (as Mischelle) [Anal Facial]\n    * Noemi [Facial]\n    * Pirya Tai [Facial]\n    * Tiffany Hopkins [Anal Facial DP]\n    * Vanessa Mae [Anal A2M]\n \n   \nScene Breakdowns\n\n    * Scene 1. Bob Terminator, Michaela Sabbattini, Nick Lang, Noemi\n    * Scene 2. Andrea Moranty, Andy Elias, Tiffany Hopkins\n    * Scene 3. Alexa Weix, Thomas Stone\n    * Scene 4. Jens XP, Marc Duvall, Pirya Tai, Thomas Stone\n    * Scene 5. Ellen Saint, Max Cortes\n    * Scene 6. Gabriel Montoya, Lucy Love, Vanessa Mae\n\n\n\n\n\n\nREVIEW:\n\n\nThis is a combination of individual sex scenes thought up by various directors in the Private stable. \nIt almost seems as if they were placed in a contest to make a single sex scene and show something that you haven't found a good place for in a full-length feature. The winner would get to keep their job. \nAll scenes, although completely separate from one another and in different directorial styles, did not look like last minute contest entrants.\nThere are six scenes featuring a bevy of different sexual activity.\n\n\nScene 1: Meagane Cole &amp; Michelle\n\nCemetery of Sex: The blonde Hungarian actress, Megane Cole &amp; Romanian brunette Michelle are first up to bat and accompanied by two strapping young studs in a creepy smoke filled cemetery. Megane is a very skinny, fake titted little twat that looks like she's got a blossoming addition to plastic surgery. Michelle is a fine body with long legs and a killer natural body. The two couples split up to do some heavy loving with nice oral and anal sex shared by the ladies. In a bit of 'cheating', both guys hand out facials before the two lovely Euro sluts share the cum between them. This scene wasn't the best one comes to expect from Private and the smoke was a little annoying from time to time.\n\n\nScene 2: Tiffany Hopkins\n\nBaroque Fantasy: French actress Tiffany Hopkins generally screams sexuality. Unfortunately, in this scene she's adorning a white wig and a mask that hides her features. She is joined by two gentlemen adorning white wigs and classical Baroque attire. The whole scene is shot with classical music in the background. The sex is plenty hot, as we get to see Tiffany's hot little natural breasts bounce all over the place as the two guys pummel her asshole and snatch. Tiffany is also treated to a double penetration before taking a double helping liquid white wig juice all over her agape mouth. The wigs didn't match well with the tattoos &amp; piercings of the participants and the music was annoying.\n\n\nScene 3: Linda Shane\n\nKiss of Death: Hungarian actress Linda Shane is looking truly edible as she walks into a room wearing an all white see through number. This might be the hottest chick in all of Europe. She's got long blonde hair, naturally beautiful tits and a ass that would make you leave your significant other for. To make this scene ever better, users get to see Linda twitch is ecstasy as she gets her manicured twat eaten out and watch her suck dick, and take it in the ass. Mad props to Angela Di Angelo on this fantastic scene.\n\n\nScene 4: Pirya Tai\n\nGang Bang in the Jacuzzi: Pirya Tai is a Swedish girl who looks like she's got some Asian influence in her background. She's got dark hair and a small, soft body. Not the most attractive woman in the Private stable by any stretch of the imagination. We get to see her in the Jacuzzi of a cheap hotel in raw footage shot that's not overlaid with any sound whatsoever. We watch her suck and fuck a guy in the tub until he comes in her mouth and face. She puts the semen in a large bowl to drink. Next, four other guys come out of the woodwork to get sucked by Pirya and cum on her face. She puts all the demon seed in a bowl, which she happily drinks. This scene did absolutely nothing for me. It didn't look like finished footage and watching a young girl drink a giant load of liquid reproduction out of a bowl doesn't do much for me.\n\n\nScene 5: Ellen Saint\n\nWet Sex: Our Czech cover girl, Ellen Saint is the next model to show off her on camera talent. She's got a great natural body with full breasts. She's getting her picture taken and she poses wearing her light colored lipstick and fishnet fetish stockings. After a few minutes of tease footage, Ellen is given a sack to suck on. Prior to that, however, there is some nice footage with Ellen playing with a green dildo. In a really fun idea there is footage of Ellen sucking cock being filmed Point of View style by the suckee, Pam &amp; Tommy Lee style. The sex is next on the agenda and Ellen gets railed on a chair up the birth canal &amp; up the exit ramp before taking a massive facial on her pretty face. This is the type of high quality scene one comes to expect from Private.\n\n\nScene 6: Vanessa &amp; Lucy Love\n\nCandles for your Mind: Lucy Love &amp; Vanessa are two Czech brunette actress in heavy footage attire. They have their male slave blindfolded with a mask on this back on the floor and are abusing him with playful kicks and slaps and feeding their boots to lick. After the initial abuse, the masked man sees daylight and two whores sucking on his rod. With no attention to the twat, the man goes right for the anal sex with both Eurosluts. There is some major ass to mouth taste testing and plenty of foot play during this scene, including the rare 'footjob'. The Anal sex was entertaining to me, but I'm not huge into the whole foot fetish. The scene ends with the ladies of ill repute sharing the penal extract.\n\n\n\nSummary: \nRent this DVD for the Ellen Saint &amp; Linda Shane scenes as they are very solid. If you're into foot play, the Vanessa &amp; Lucy Love scene is reasonable. At less that $15 on www.adultdvdempire.com, it's hard to go too wrong.\n\n\n\n\n","torrent":{"xt":"urn:btih:41eef0613e6d7375b966acd4a05322c0d4cacb96","amp;dn":"Private+XXX+21%3A+Inside+Sex%2C+Sex+Inside+%282005%29+-+Tiffany+Hopkins%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41eef0613e6d7375b966acd4a05322c0d4cacb96","infoHashBuffer":{"type":"Buffer","data":[65,238,240,97,62,109,115,117,185,102,172,212,160,83,34,192,212,202,203,150]},"announce":[],"urlList":[]}}