{"title":"Notepad++ 5.8.6","uid":6055482,"size":4607330,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:43542286e5e230fadce7253cce48e85cd705aae1&amp;dn=Notepad%2B%2B+5.8.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1292898192,"description":"Copied from the Notepad++ homepage:\n\n\nNotepad++ is a free (as in &quot;free speech&quot; and also as in &quot;free beer&quot;) source code editor and Notepad replacement that supports several languages.\nRunning in the MS Windows environment, its use is governed by GPL License.\n\nBased on the powerful editing component Scintilla, Notepad++ is written in C++ and uses pure Win32 API and STL which ensures a higher execution speed and smaller program size. By optimizing as many routines as possible without losing user friendliness, Notepad++ is trying to reduce the world carbon dioxide emissions. When using less CPU power, the PC can throttle down and reduce power consumption, resulting in a greener environment.\n\nThis project is mature. However, there may be still some bugs and missing features that are being worked on. If you have any questions or suggestions about this project, please post them in the forums.\nAlso, if you wish to make a feature request, you can post it there as well.\nBut there's no guarantee that I'll implement your request.\n\nYou're encouraged to translate Notepad++ into your native tongue if there's not already a translation present in the Binary Translations page.\nAnd if you want, help translating Notepad++ official site into your native tongue would be greatly appreciated.\n\nI hope you enjoy Notepad++ as much as I enjoy coding it.\n\n\nChangelog:\n\n\nNotepad++ v5.8.6 new features and fixed bugs (from v5.8.5) :\n\nFix langs.xml 0 length problem while user ends session without closing Notepad++.\nFix empty line count failure (RegExpr).\nFix task list display glitch under Windows 7.\n\nAdd trim functions (header/trailing/compact feature). \nAdd white space and TAB conversion features.\n\nFix folding margin to be displayed when opening Notepad++ with a new/empty file (Normal text).\nFix auto-completion detection language bug.\nFix the changing theme settings makes switch back to the default theme bug.\n\nMake english.xml customizable.\n\n\nNotepad++ v5.8.5 new features and fixed bugs (from v5.8.4) :\n\nFix Shell Extension icon absent issue.\nFix the crash problem if config.xml is not present.\nFix tab settings not saved under Windows 7 problem.\nFix localization switching under Windows 7 problem.\nFix x64 system files problems : not included in recent file history list while closing a file.\nFix x64 system files problems : not remembered in the next session problem.\nFix the search direction not being memorized problem. \n\nModify File Association dialog UI.\n\nFix the initial document encoding is not set by &quot;New Document Settings&quot;.\n\n\n \nNotepad++ v5.8.4 new features and fixed bugs (from v5.8.3) :\n\nFix memory leak problem while switching tab.\nFix User Defined Language dialog docking problem under Windows 7.\nFix backwards search with Asian codepage problem.\n\nAdd a new capacity in context menu: the menu item and folder item can be renamed (and in whichever language).\n\nAll the supported encoding charsets can be set as default in &quot;New Document Settings&quot;.\n\nRemove Calltip restriction from plugins side.\n\nAdd &quot;-alwaysOnTop&quot; command line argument.\n\nFix icon display glitch in shell extension context menu.\n\n\n\nNotepad++ v5.8.3 new features and fixed bugs (from v5.8.2) :\n\nA new application icon.\n\nAdd the capacity to open x64 system files.\nAdd Edit context menu command.\nAdd a new ability: sub-menus commands can be in the context menu.\n\nFix context menu reload problem (plugin commands reload fails).\nFix searching up fails while code page is set to Chinese/Japnese/Korean bug.\n\nRemove unsupported encodings by Microsoft Windows : ISO-8859-10, ISO-8859-11, ISO-8859-16.\n\nFix move down current lines bug while moving down on the last line.\nFix crash issue : crash in the next launch after setting MS-DOS-Style as default language.\nFix zoom bug on the second view.\nFix a heap corruption of ColourPicker.\n\nDue to UAC issue, doLocalConf.xml is ignored under vista and windows 7, if Notepad++ is installed in &quot;Program files&quot; directory.\n\n\n\nNotepad++ v5.8.2 fixed bugs (from v5.8.1) :\n\nFix windows 7 crash bug while executing update.\nFix macro recording bug for the non-ASCII characters.\nFix C# syntax highlighting disabled problem after reloading.\nFix find performance issue related macro recording.\n\nModify SaveFile dialog behaviour: it browses inside the directory instead of creating the new file with the given directory name.\n\n\n\nNotepad++ v5.8.1 new features and fixed bugs (from v5.8) :\n\nFix Actionscript lexer crash problem.\nFix saving UCS-2 text file corrupted bug.\n\nAdd word count in Summary feature.\n\nFix macro record bug from ANSI document.\nFix hidding/showing status bar bug.\n\n\nNotepad++ v5.8 new features and fixed bugs (from v5.7) :\n\nUpgrade Scintilla to version 2.21.\n\nFix a vulnerability issue: Load ScinLexer.dll with its full path to avoid hijack.\nFix Unicode file corrupted on saving bug (the buffer alignment issue).\nFix DBCS encodings file saving corruption bug.\nFix file containing NULL character loading bug.\nFix php syntax highlighting bug.\nFix dragging undocked window performance issue while using Vista Aero UI style.\nFix dragging undocked window performance issue while using Vista/Windows7 Aero UI style.\nFix large file truncated after loading problem.\n\nImprove file loading performance.\n\nFix Shortcut Mapper inconsistence issue after deleting a macro or an user command.\n\nAdd 2 line wrap methods (default plus aligned and indent).\nAdd 2 menu commands : &quot;Modify Shortcut/Delete Macro&quot; and  &quot;Modify Shortcut/Delete Command&quot;.\nAdd &quot;Modify&quot; and &quot;Delete&quot; buttons on Shortcut mapper dialog.\nAdd macro new ability to record search and replace actions.\n\nFix SaveSession bug.\n\nRemove characters count feature from the status bar due to its performance issue with UTF8 file.\n\nFix crash issue due to themes switching.\n\nMake folding margin hidable.\n\nAdd NPPM_GETCURRENTNATIVELANGENCODING, NPPM_ALLOCATECMDID and NPPM_ALLOCATEMARKER message (to get the current native language enconding).\n\nChange editing settings saving behaviour : one set of settings are applied in 2 scintilla controls (except zoom).\n\nAdd Statistics feature which is accessible from the menu command &quot;Summary...&quot; (under menu &quot;View&quot;) and the 2nd zone of statusbar (double click).\n\n\nNotepad++ v5.7 new features and fixed bugs (from v5.6.8) :\n\nUpgrade Scintilla to version 2.12.\n\nAdd &quot;Inverse bookmark&quot; feature.\nAdd NPPM_SAVECURRENTFILEAS message.\n\nFix premature deallocation bug for import UDL.\n\nAdd import/export User Defined Language features.\n\nFile detection : Switch to modified or deleted file while user is asked to reload or keep the file. \n\nFix closing several detected non-existing files bug.  \nFix language switching to English not working bug.\n\nReduce PostIt/FullScreen restore button size.\n\nFix PostIt wrong restore button position after toggling off fullScreen mode.\nFix crashes on new 11 character long UDL names bug.\nFix &quot;Save all&quot; inconsistent icon state on toolbar.\n\nAdd new keywords of HTML 5 and css.\n\n\nNotepad++ v5.6.8 new features and fixed bugs (from v5.6.7) :\n\nFix comment stream without selection bug.\nFix Find in files results highlighting regression bug.\nFix regression bug (include the correct SciLexer.dll) about insensible case search mode.\n\n\n\nNotepad++ v5.6.7 new features and fixed bugs (from v5.6.6) :\n\nFix &quot;Find in files&quot; crash bug.\n\nFocus (switch to) the dirty document while asking to save unsaved document when user close Notepad++.\n\nFix the bug while giving command C:\\NppDir&gt;notepad++ (w/o quote), npp try to open file &quot;notepad++&quot;.\n\nEnlarge regconition of clickable link from &quot;http://&quot; to any URI.\n\nFix the bug while changing the language list in Style Configurator, the &quot;Save and close&quot; button is enabled.\n\n\n\nIncluded plugins (Unicode):\n\n1.  TextFX v0.26\n2.  Spell Checker v1.3.3\n3.  NppFTP 0.23\n4.  NppExport v0.2.8\n5.  Compare Plugin 1.5.6.1\n6.  Plugin Manager 0.9.3.1\n\n\n\nIncluded plugins (ANSI):\n\n1.  TextFX v0.25\n2.  NppExec v0.4.1\n3.  Spell Checker v1.3.3\n4.  MIME Tools v1.6\n5.  NppExport v0.2.8\n6.  Light Explorer v1.6\n7.  Compare Plugin 1.5.5\n8.  Plugin Manager 0.9.3.1\n\n\neD2k Link:\ned2k://|file|npp.5.8.6.Installer.exe|4607330|77F99AAA50CEB7F30CA533076FA21ECC|h=CSHYXDPQ2GSQ36JGURUMHFII3HRQIHQO|/\n\n\nComments from the uploader (olofolleola4):\nThis is some sick shit that happened in summer 2010:\n&quot;Under the pretext of cryptographic exportation control, US government made the major FOSS hosts (SourceForge, Google code, Fedora, etc...) in USA territory comply with the Export Administration Regulations (http://www.bis.doc.gov/encryption/pubavailencsourcecodenofify.html). As a result they reject the access of FOSS resources from the 5 countries (Cuba, Iran, North Korea, Sudan, and Syria) in the &quot;black list&quot; of US government.\n\nIt's not the first time that a government try to control Internet access to protect its interest. One of most famous examples is the Grand Firewall of China. Obviously the US government is walking into the footsteps of the Chinese government. In our case it's about the violation of FOSS community's right, we cannot just let it happen without doing something. It should never be any government to decide who has the access right to FOSS resource and who has not.\n\nA walk around from SourceForge:\nAfter complying with this law, SourceForge provided an option &quot;Export Control: non-encryption algorithms included&quot;. A mail to make this option explicit was sent to all project managers on SF recently. It's the only FOSS host who offers such walk around as far as I know. We appreciate all their efforts and we will keep our binary releases on SourceForge.&quot;\n\nNOBODY SHOULD CENSOR FOSS!!!","torrent":{"xt":"urn:btih:43542286e5e230fadce7253cce48e85cd705aae1","amp;dn":"Notepad%2B%2B+5.8.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43542286e5e230fadce7253cce48e85cd705aae1","infoHashBuffer":{"type":"Buffer","data":[67,84,34,134,229,226,48,250,220,231,37,60,206,72,232,92,215,5,170,225]},"announce":[],"urlList":[]}}