{"title":"Giants and Toys 1958 Japanese (Big Papi) Yasuzo Masumura","uid":14761013,"size":898166215,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:436229414b8fb1b87718a99f6ecbfdfbbe07d4c2&amp;dn=Giants+and+Toys+1958+Japanese+%28Big+Papi%29+Yasuzo+Masumura&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":3,"time":1464837821,"description":"[img]https://yuq.me/users/15/891/rv4BT0w5kx.jpg[/img]\r\n\r\n[quote]Zack Davisson\r\nFormat: DVD\r\nMasumura Yasuzo is not a name one generally associates with great Japanese film. A director of over 60 films, he has never been an A-lister like Kurosawa, Kobayashi or Ozu. Yet one does not need to be a genius to make good films, and Masumura certainly makes good films.\r\n\r\n&quot;Giants and Toys&quot; (&quot;Kyojin to Gangu&quot; ) is a story of corporate Japan, and the overwhelming drive for success at any costs. It is a tale as common in modern Japan as it was in 1958, and it is amazing to see how little the culture has changed in over 42 years. In fact, this bright, colorful and fast paced film feels far more modern and ahead of its time than films from the 70's and 80's.\r\n\r\nTwo friends, Nishi and Ryuji, begin working for the publicity departments of rival candy companies &quot;World&quot; and &quot;Giant.&quot; They vow to remain true friends, and not let their companies rivalry come between them. However, Nishi's boss Gonda is determined to win the season, and influences Nishi to try to gain insider information into the campaigns using his connections. Nishi begins to date an employee of a third company, &quot;Apollo,&quot; and tries to seduce secrets from his new girlfriend.\r\n\r\nInto this tangles mix comes Shima Kyoko, a slum hillbilly with rotted teeth that Gonda is certain he can turn into a star and manipulate to win the candy war. Kyoko is cute, energetic and has a crush on Nishi. She only agrees to put on the Spacesuit, stick out her tongue and pose for pictures with a promise of future love from Nishi, who is disgusted by her.[/quote]","torrent":{"xt":"urn:btih:436229414b8fb1b87718a99f6ecbfdfbbe07d4c2","amp;dn":"Giants+and+Toys+1958+Japanese+%28Big+Papi%29+Yasuzo+Masumura","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"436229414b8fb1b87718a99f6ecbfdfbbe07d4c2","infoHashBuffer":{"type":"Buffer","data":[67,98,41,65,75,143,177,184,119,24,169,159,110,203,253,251,190,7,212,194]},"announce":[],"urlList":[]}}