{"title":"Boys Life - Discography (1995-1996) [FLAC]","uid":8299057,"size":529802868,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:43f45e3a13eb89c5d4db7e353eb13c9e5c467c45&amp;dn=Boys+Life+-+Discography+%281995-1996%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"politux","files":-1,"time":1364222538,"description":"\n  Boys Life - Discography (1995-1996) [FLAC]\n\n  Released: 1995, 1996\n  Genre: Pop/Rock\n  Style: Emo, Indie Rock, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 950 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  1995 - Boys Life\n  1996 - Departures &amp; Landfalls\n  \n  \n  It's fitting that Boys Life's first full-length was recorded with Mark Trombino, who used to be a member of Drive Like Jehu. Though the band doesn't quite rival Drive Like Jehu's feverish pace, on its first full-length effort they exhibit the same frenetic anger, that sense of disrupting the maddeningly sanitized world of white, middle-class suburbia that Jehu did. This is music that is hardly &quot;tight&quot;, and whether intended or not, it's what set the Kansas City, MO foursome apart from the pack of emo bands surrounding them at the time. If you can see the human error underlying what you're reading about or listening to, it makes things more honest. And this album smacks of brutal honesty from tracks one to nine. From the opening number, &quot;Golf Hill Drive,&quot; guitars are strummed cleanly and off-key, giving way to intentional storms of distorted feedback, then it's back to clean and quiet. \n\n  Brandon Butler's hushed voice rises a tone with the onset of dusk, he screams and then it's back to a near-whisper. This simple formula of alternation seems to work well on every track; whether the band is going haywire like they do for most of &quot;Breaker Breaker&quot; or keeping things (a little) quieter like in &quot;Cloudy and 47,&quot; each song's cadence flows less like a roller coaster than a Moebius strip: the sound goes around in circles infinitely, never collapsing in on itself, but cycling through predictably. This is not to say that Boys Life don't give it their all -- they embody sheer energy. This formula was what made them unique and this album showcases them at their most raw point, before they began to progress musically, lessening the impact of their unrefined beauty.","torrent":{"xt":"urn:btih:43f45e3a13eb89c5d4db7e353eb13c9e5c467c45","amp;dn":"Boys+Life+-+Discography+%281995-1996%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43f45e3a13eb89c5d4db7e353eb13c9e5c467c45","infoHashBuffer":{"type":"Buffer","data":[67,244,94,58,19,235,137,197,212,219,126,53,62,177,60,158,92,70,124,69]},"announce":[],"urlList":[]}}