{"title":"[DC] Sega Bass Fishing [Self-Boot] [NTSC] [CDI]","uid":4717364,"size":94107263,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:4434d471e3dacb83ff5a22e0d1dec338a92ae9a8&amp;dn=%5BDC%5D+Sega+Bass+Fishing+%5BSelf-Boot%5D+%5BNTSC%5D+%5BCDI%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1234350266,"description":"Sega Bass Fishing for Sega Dreamcast                Rel. in 1999\n\n\nFormat:          CD-R NTSC (Self-Boot)\nLang.:           English\nDiscs:           1\nImage:           CDI\nRequirements:    DC Emulator or Sega Dreamcast Console. \n\nNote: (Try to use a DC console that was manufactured before october 2000 to be on the safe side, Because a bios change was made to the console after this date that supposedly disallows utopia or selfboot games, Not sure if this is true or not but don't be surprised if this doesn't work on the later versions of dreamcast. So make sure you check the date on the bottom of your console you should be able to find the manfacture date, in fine print if the sticker is still on it).\n\nGenre:           Fishing/Arcade\n\nCompressed with WinRaR. \n\nCompressed to small size, but has everything there you need.\n\nAny DC Games that you burn make sure you allow overburning option in Alcohol or discjuggler, if your burner supports it.\n\nSega Bass fishing is already well on the net for download but every version seemed to be the non-selfboot.  And I wanted to upload the selfboot version so you don't have to mess around getting out that utopia disc every time you want to play this \ngame.\n\nGame Description:\n\nExplore the exciting sport of bass fishing! Based on the arcade hit, explore eight fishing locations as you try to catch the biggest fish possible! You can choose between fourteen different lures, and compete in four tournaments, starting with \nyou as an amateur, up to a Masters Classic tournament!\n\n\nGame Pics included.\n\n\nDon't forget to seed this.\n\n\nIf you come across problems or have questions, please post a comment.\n\n\nBurn with Alcohol 120% or Discjuggler, Burn at slowest speed possible for compatibility. (Alcohol 120 Included in Download)\n\n\nBest recommended CD Discs to burn this DC game are Tayio Yuden, or Verbatim.\n\nVerbatim is properly your best bet and should work just fine. \n\n\nEnjoy!\n\nYou guys need to seed this don't just leech, I can't seed all the time.","torrent":{"xt":"urn:btih:4434d471e3dacb83ff5a22e0d1dec338a92ae9a8","amp;dn":"%5BDC%5D+Sega+Bass+Fishing+%5BSelf-Boot%5D+%5BNTSC%5D+%5BCDI%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4434d471e3dacb83ff5a22e0d1dec338a92ae9a8","infoHashBuffer":{"type":"Buffer","data":[68,52,212,113,227,218,203,131,255,90,34,224,209,222,195,56,169,42,233,168]},"announce":[],"urlList":[]}}