{"title":"Start Something That Matters","uid":12525877,"size":6402403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44ca2c62e318a8c9374c901a3a17e6d59eb56d97&amp;dn=Start+Something+That+Matters&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1444048150,"description":"Start Something That Matters by Blake Mycoskie\r\n\r\nOverview: What matters most to you? Should you focus on earning a living, pursuing your passions, or devoting yourself to the causes that inspire you? The surprising truth is that you don’t have to choose—and that you’ll find more success if you don’t. That’s the breakthrough message of TOMS’ One for One movement. You don’t have to be rich to give back and you don’t have to retire to spend every day doing what you love. You can find profit, passion, and meaning all at once—right now.\r\nIn Start Something That Matters, Blake Mycoskie tells the story of TOMS, one of the fastest-growing shoe companies in the world, and combines it with lessons learned from such other innovative organizations as method, charity: water, FEED Projects, and TerraCycle. Blake presents the six simple keys for creating or transforming your own life and business, from discovering your core story to being resourceful without resources; from overcoming fear and doubt to incorporating giving into every aspect of your life. No matter what kind of change you’re considering, Start Something That Matters gives you the stories, ideas, and practical tips that can help you get started","torrent":{"xt":"urn:btih:44ca2c62e318a8c9374c901a3a17e6d59eb56d97","amp;dn":"Start+Something+That+Matters","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44ca2c62e318a8c9374c901a3a17e6d59eb56d97","infoHashBuffer":{"type":"Buffer","data":[68,202,44,98,227,24,168,201,55,76,144,26,58,23,230,213,158,181,109,151]},"announce":[],"urlList":[]}}