{"title":"Historical Thinking","uid":8919609,"size":2162187,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48266e06e8b2195656ed442638e57f6190153fa6&amp;dn=Historical+Thinking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"livhre","files":-1,"time":1379221144,"description":"Please make all requests on my very last torrent for today, if I forgot your request, just give it a day and wait for the last torrent. Then let me know.\n\nSince ancient times, the pundits have lamented young people's lack of historical knowledge and warned that ignorance of the past surely condemns humanity to repeating its mistakes. In the contemporary United States, this dire outlook drives a contentious debate about what key events, nations, and people are essential for history students. Sam Wineburg says that we are asking the wrong questions. This book demolishes the conventional notion that there is one true history and one best way to teach it. \n\nAlthough most of us think of history -- and learn it -- as a conglomeration of facts, dates, and key figures, for professional historians it is a way of knowing, a method for developing and understanding about the relationships of peoples and events in the past. A cognitive psychologist, Wineburg has been engaged in studying what is intrinsic to historical thinking, how it might be taught, and why most students still adhere to the &quot;one damned thing after another&quot; concept of history. \n\nWhether he is comparing how students and historians interpret documentary evidence or analyzing children's drawings, Wineburg's essays offer &quot;rough maps of how ordinary people think about the past and use it to understand the present.&quot; Arguing that we all absorb lessons about history in many settings -- in kitchen table conversations, at the movies, or on the world-wide web, for instance -- these essays acknowledge the role of collective memory in filtering what we learn in school and shaping our historical thinking.","torrent":{"xt":"urn:btih:48266e06e8b2195656ed442638e57f6190153fa6","amp;dn":"Historical+Thinking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48266e06e8b2195656ed442638e57f6190153fa6","infoHashBuffer":{"type":"Buffer","data":[72,38,110,6,232,178,25,86,86,237,68,38,56,229,127,97,144,21,63,166]},"announce":[],"urlList":[]}}