{"title":"Beauty Of Britain - S01 &amp; 02 - Audio Comedy - MP3 - Slimoo","uid":6391603,"size":322070659,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:48518f428a5fcd55914892214e62f1404e424e43&amp;dn=Beauty+Of+Britain+-+S01+%26+02+-+Audio+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":12,"time":1305331571,"description":"Beauty Of Britain - Series 01 &amp; 02 - Audio Comedy - BBC Radio 4 \n12 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo\n &lt;a href=&quot;\nhttp://www.comedy.co.uk/guide/radio/beauty_of_britain/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.comedy.co.uk/guide/radio/beauty_of_britain/&lt;/a&gt;\n\nRadio sitcom by Christopher Douglas and Nicola Sanderson. \nJocelyn Jee Esien stars as an upbeat carer of the nation's elderly\n\nBeauty Of Britain is a comedy from Christopher Douglas and Nicola Sanderson with a cast led by Jocelyn Jee Esien.\n\nBeauty Olonga, bargain hunter and star of the Burslem Hope Gospel Choir, works as a carer for the Featherdown Agency and sees herself as an inspiration to other African girls hoping to live the dream in Britain. &quot;There are plenty of opportunities here. The professional classes are always off sick due to binge drinking and the rest are too lazy to get off the couch to answer the pizza delivery man.&quot;\n\nHer journal records her adventures among the nation's elderly - their overheated houses, their cauliflower cheese addiction and their wandering arthritic hands.\n\n The series is about one woman's progress through a foreign country as she searches for personal fulfilment, a sense of belonging and perhaps a pair of Jimmy Choos she can walk to church in. It also presents a perspective on the elderly care process in all its chaotic, tragic-comedy but it does so from the viewpoint of an economic migrant, Beauty, whose Southern African Shona background has taught her to respect age.\n\n\n\n\n\nwww.comedy.org.uk Review: \nChristopher Douglas and Nicola Sanderson have first-hand knowledge of live-in care and have conceived an original, warm and funny way to tackle this difficult subject.\n\n The scripts comment neatly on some of the failings of Britain, whilst remaining funny and upbeat. However, one criticism that was levelled at the show during the first series was the over-the-top voice acting, which took away from the otherwise realistic premise. This has thankfully now been toned down.\n\n\nCast:\nJocelyn Jee Esien\nFelicity Montagu\nIndira Joshi\nPaul Sharma\nNicola Sanderson\n &lt;a href=&quot;\nhttp://www.comedy.co.uk/guide/radio/beauty_of_britain/episodes/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.comedy.co.uk/guide/radio/beauty_of_britain/episodes/&lt;/a&gt;\n\nBeauty Of Britain - S01 - E01 - Seagulls Over Sue Ryder \nBeauty Of Britain - S01 - E02 - The Lord Lieutenant's Lady \nBeauty Of Britain - S01 - E03 - Girl With The Polycotton Tabard \nBeauty Of Britain - S01 - E04 - Pastor Dave \nBeauty Of Britain - S01 - E05 - Colour Me Wow \nBeauty Of Britain - S01 - E06 - Beauty And The Beast \n\nBeauty Of Britain - S02 - E01 - Citroen UXB \nBeauty Of Britain - S02 - E02 - Laurelmead \nBeauty Of Britain - S02 - E03 - The Little Black Shorts \nBeauty Of Britain - S02 - E04 - The Delegate \nBeauty Of Britain - S02 - E05 - Mission Command \nBeauty Of Britain - S02 - E06 - Life In The UK \n\n\n\nAudio Format : MP3\nDuration Approx : 27mn 54s\nBit rate mode : Constant\nBit rate : 128 Kbps \nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits\n\n\n\n\n\n\n\n-----------------------------------------------\n\nI post quite a few torrents if this site is down when I post a new one I don't have time to keep trying.\nIf it's down then it's skipped.\n\nYou can follow me on Twitter so you don't miss any\n\n\nOr add the RSS feed in uTorrent (In FEEDS on the left add)\n\n-----------------------------------------------\n\n","torrent":{"xt":"urn:btih:48518f428a5fcd55914892214e62f1404e424e43","amp;dn":"Beauty+Of+Britain+-+S01+%26+02+-+Audio+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48518f428a5fcd55914892214e62f1404e424e43","infoHashBuffer":{"type":"Buffer","data":[72,81,143,66,138,95,205,85,145,72,146,33,78,98,241,64,78,66,78,67]},"announce":[],"urlList":[]}}