{"title":"QuickVerse 2008atinum v12.0.1 Bible Study","uid":4255025,"size":1736245248,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:487d9f54715f7ea72072ae174e02205a502ecb31&amp;dn=QuickVerse+2008atinum+v12.0.1+Bible+Study&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"quazy3475","files":1,"time":1214193668,"description":"New and Enhanced Features\n\n    * NEW! Ribbon Interface Control: All new look to provide the latest in state-of-the-art user interfaces. All QuickVerse functions are now in one easy-to-use location for quick selection, setting, and reference. The control center for all of your Bible study needs.\n\n\n    * NEW! Preview Panes: Review text font and style settings as you select options ? screen fonts/sizes/text placement change as you preview your selections.\n\n\n    * NEW! Pre-set Study Views: Change your QuickVerse layout with simple, intuitive options for Window layouts.\n\n\n    * NEW! Search entry and results Windows: Provide extended previews for all search results in single or multiple book sources.\n\n\n    * NEW! Autosave Notes: Now save notes automatically as you move through any/all books ? even if you forget.\n\n\n    * Enhanced! Save and Recall Searches: Save all of the attributes of any Book Search and instantly recall the results along with all of the search criteria. Save as many Book Searches as you like and access them immediately from within the QuickVerse Library. Save multiple variations of the same search and instantly compare the results.\n\n\n    * Enhanced! Word Form Search: : Find all forms of a given search word without embedding cryptic symbols like ?*? or ???. Search for ?rise? and receive ?arise?, ?risen?, ?rising?, and ?rise?. Search for ?Love? and receive ?Lovest?, ?Loveth?, ?Loved?, ?Loving?, and ?Love?.\n\n\n    * Enhanced! Integrated Web Pages: Link all of your favorite Web Pages in the QuickVerse Library for instant recall. View them next to your favorite QuickVerse books. Use key QuickVerse resources like Quick Define, Pronunciation, and Search. Your favorite Web Pages fully integrated in QuickVerse.\n\n\n    * Enhanced! Integrated PDF: Add PDF files to QuickVerse for fast retrieval and reference. Local PDF files, network PDF files, or online PDF files are all supported. Place any number of PDF files in the QuickVerse Library for instant retrieval, review, and comparison. Add your favorite PDF files to your User Books for instant recall.\n\n\n    * Enhanced! Integrated RSS: Now you can support your favorite RSS subscriptions directly within QuickVerse. Support for multiple subscriptions, categories, and articles, and refresh frequencies. See your favorite feed articles inside a QuickVerse View Window along will all of your favorite QuickVerse books.\n\n\n    * Enhanced! Web Dictionary Support: Search key online dictionary/encyclopedia resources for key words without ever leaving QuickVerse! Extend your lookups to Wikipedia, Britannica, Encarta, Worldbook, Oxford and other online dictionary resources. Pull definitions from vast online resources immediately. Retain those lookups in a QuickVerse View Window.\n\n\n    * Enhanced! Book Notes: Note Indicators now mark every position in the Table of Contents in all books ? you?ll always know note positions in every book. Autosave now saves notes automatically as you move through any/all books ? even if you forget.\n\n\n    * Enhanced! Study Views: Save an unlimited number of working environments including books, book views, and window positions to handle many study situations.\n\n\n    * Enhanced! QuickVerse Advanced InfoWindow: Mouse-over any verse reference and see the verse in up to four Bible translations. Mouse-over any Strong?s number and review the language definition in all Strong?s resources. Mouse-over a word link and see the definition in all available dictionaries ? all in one powerful InfoWindow.\n\n\n    * Enhanced! Custom Bible Views: You can now select one standard display format for all Bibles.\n\n\n    * Enhanced! Download Library: With an internet connection, you have instant access to hundreds of today?s most sought-after Bible translations and Christian references.\n\n\n    * And much more!\n\n\n\n\nFULLY FUNCTIONAL 1.61 GB ISO file. Burn to DVD or mount to install.\n\nFreely receive, freely give. Please seed after downloading!\n","torrent":{"xt":"urn:btih:487d9f54715f7ea72072ae174e02205a502ecb31","amp;dn":"QuickVerse+2008atinum+v12.0.1+Bible+Study","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"487d9f54715f7ea72072ae174e02205a502ecb31","infoHashBuffer":{"type":"Buffer","data":[72,125,159,84,113,95,126,167,32,114,174,23,78,2,32,90,80,46,203,49]},"announce":[],"urlList":[]}}