{"title":"Brotherhood of War series by W.E.B. Griffin (#1 - 9)","uid":9378099,"size":3655120,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48f1ed78cc9592f44da83e6badaaaad3ac326518&amp;dn=Brotherhood+of+War+series+by+W.E.B.+Griffin+%28%231+-+9%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":13,"time":1387654995,"description":"\n\n\n1. The Lieutenants (1982)\nThey were the young ones, the bright ones, the ones with the dreams. From the Nazi-prowled wastes of North Africa to the bloody corridors of Europe, they answered the call gladly. War. It was their duty, their job, their life. They marched off as boys, and they came back--those who made it--as soldiers and professionals forged in the heat of battle...\n\n2. The Captains (1982)\nIt was more than an incident. It was a deadly assault across the 38th parallel. It was the Korean War. In the fear and frenzy of battle, those who had served with heroism before were called again by America to man the trenches and sandbag bunkers. From Pusan to the Yalu, they drove forward with commands too new and tanks too old: brothers in war, bonded together in battle as they had never been in peace...\n\n3. The Majors (1983)\nDien Bien Phu. Saigon. Hanoi. In 1954, they were only exotic names from a French campaign halfway around the world. But now American fighting men--proven on the bloody beaches of Normandy and in the minefields of Korea--are summoned to help beat back the guerrilla forces of Ho Chi Minh. To some, the &quot;secret&quot; war in Indochina was the depth of folly. To others, like the Majors, it pointed to the heights of glory...\n\n4. The Colonels (1983)\nThey were the professionals, the men who had been toughened by combat in the mine-laden fields of Europe, in Korea, in Greece, in Indochina. Now, in the twilight of a dying decade, they must return to the States to forge a new type of American soldier--one to be tested on the beaches of Cuba and in a new war yet to come...\n\n5. The Berets (1984)\nThey were the chosen ones--and the ones who chose to be the best. Never before had the United States given so select a group of fighting men such punishing preparation. Now they were heading for their ultimate test of skill and nerve and sacrifice, in a war unlike any they or their country had ever fought before ... in a land that most of America still knew nothing about ...Vietnam.\n\n6. The Generals (1986)\nTheir bold decisions changed the outcome of battles ~ and often the fate of a country. The Generals earned their stars in Normandy's spectacular landing, in grueling South Pacific campaigns, on Korea's icy slopes and in the wastelands of Vietnam. It was there they commanded their troops against an unyielding and implacable foe. In a new kind of war, the Generals forged a new kind of army: resilient, tough, unafraid.\n\n7. The New Breed (1987)\nFrom the blistering jungles of Vietnam to the far-flung battlefields of the African Congo, they faced the turmoil of a new era. It was a different kind of war. But the courage and skill of these young fighting men were an American tradition. Like their fathers before them, they rose up to the ultimate challenge of military valor, holding their own in a storm of clashing cultures. They were America's new breed. The proudest and the best...\n\n8. The Aviators (1988)\nIt is 1964. The Vietnam War has begun to escalate, its new style of battle demanding new weapons and tactics, and men who can use them. Overnight, it seems, the United States Army must scramble to create its first-ever Air Assault Division, a force critical to its chances of success. The obstacles are staggering - untrained men, technical mishaps, interservice rivalries. But through sheer courage and dedication, these heroic fighters rise to the challenge. For they are America's bravest - facing the ultimate test...\n\n9. Special Ops (2001)\nIn November 1964, Cuban revolutionary Che Guevara went to the Congo with two hundred men, intent on making it his first step in taking over Africa and South America. He failed, thanks in large part to the efforts of an intrepid band of Green Berets. Licking his wounds he returned to Cuba to recruit more men and try the same thing in Bolivia. He failed there, too. In fact he died there, and thus, despite his incompetence, became a glorious martyr to the cause. But who was trying to kill him, really? And why was the USA trying to keep him alive? W E B Griffin has some surprises up his sleeve, and as he takes us through the twists and turns of Special Ops he spins a story of devilish cunning and thrilling adventure.\n[img]http://images.mobilism.org/?dm=0LX5[/img]\n[img]http://images.mobilism.org/?dm=YYEU[/img]\n[img]http://images.mobilism.org/?dm=Y110[/img]\n[img]http://images.mobilism.org/?dm=8P8Y[/img]\n[img]http://images.mobilism.org/?dm=XHNN[/img]\n[img]http://images.mobilism.org/?dm=WDYY[/img]\n[img]http://images.mobilism.org/?dm=HCB5[/img]\n[img]http://images.mobilism.org/?dm=OF2E[/img]\n[img]http://images.mobilism.org/?dm=KK1J[/img]","torrent":{"xt":"urn:btih:48f1ed78cc9592f44da83e6badaaaad3ac326518","amp;dn":"Brotherhood+of+War+series+by+W.E.B.+Griffin+%28%231+-+9%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48f1ed78cc9592f44da83e6badaaaad3ac326518","infoHashBuffer":{"type":"Buffer","data":[72,241,237,120,204,149,146,244,77,168,62,107,173,170,170,211,172,50,101,24]},"announce":[],"urlList":[]}}