{"title":"Him &amp; Me by Jack &amp; Michael Whitehall","uid":9374262,"size":7493438,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49dfd749b5c6d0866886bc8df2209a73ea0df049&amp;dn=Him+%26amp%3B+Me+by+Jack+%26amp%3B+Michael+Whitehall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":5,"time":1387591976,"description":" Him &amp; Me is a hugely entertaining and irreverent account of a unique relationship between a father and son. Written in two distinctive styles, it reflects the larger-than-life personalities of its authors, Jack and Michael Whitehall.\n\n'This book is a portrait of the pretty odd relationship I have with my elderly father. It's given me an opportunity to share memories of him losing his temper with foreigners on holidays, being rude to my mother's family at Christmas and failing epically during the fathers' race at my prep school. He's also written some stories about me, but can I just say, before you read anything, that I recall being a calm, well-behaved and learned child, not the intellectually subnormal, mal-coordinated dipshit that he paints me as. Nor am I, as he suggests inside, a sex addict, a flasher or a Scientologist.' - Jack\n\n'How dare Jack refer to me as elderly! People always tell me how young I look for my age. In this book, I have at last been able to recount the many occasions when I have been let down by my only son. He failed on the stage, the sports field and he even screwed up the interview for his first boarding school by pretending he had mental health issues. Despite being practically illiterate, he tells stories about me, strewn with grammatical errors and peppered with endless exaggerations and lies. I was a kind, doting father, who guided his son through his formative years with love, care and respect.' - Michael\n\n'I'm not your only son, what about Barnaby?'\n'Oh yes, I forgot about Barnaby.'\n\nPacked with anecdotes, some embarrassing and indiscreet, many warm and touching, Him &amp; Me is lavishly illustrated with family photographs and Jack's original illustrations. Friends, relatives, neighbours, teachers, actors, none are safe once Jack and Michael have opened up the Whitehall archives and shared their hilarious memories with us.","torrent":{"xt":"urn:btih:49dfd749b5c6d0866886bc8df2209a73ea0df049","amp;dn":"Him+%26amp%3B+Me+by+Jack+%26amp%3B+Michael+Whitehall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49dfd749b5c6d0866886bc8df2209a73ea0df049","infoHashBuffer":{"type":"Buffer","data":[73,223,215,73,181,198,208,134,104,134,188,141,242,32,154,115,234,13,240,73]},"announce":[],"urlList":[]}}