{"title":"Torchwood Season 1-3","uid":7416885,"size":12970024553,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4b001330e9b8a8e43090dd760786dd01b281c81b&amp;dn=Torchwood+Season+1-3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"randykim","files":35,"time":1341545111,"description":"Torchwood follows the exploits of a small team of alien-hunters, who make up the Cardiff, Wales branch of the fictional Torchwood Institute, which deals mainly with incidents involving extraterrestrials. Its central character is Captain Jack Harkness (John Barrowman), an immortal former con-man from the distant future; Jack originally appeared in the 2005 series of Doctor Who. Other than Barrowman, the initial main cast of the series consisted of Eve Myles, Burn Gorman, Naoko Mori and Gareth David-Lloyd. Their characters are specialists for the Torchwood team, often tracking down aliens and defending the planet from alien and nefarious human threats. In its first two series, the show uses a time rift in Cardiff as its primary plot generator, accounting for the unusual preponderance of alien beings in Cardiff.\n\nContains the first three seasons of Torchwood.\nTHIS IS NOT MY RELEASE!! I merely want to share it better since i had such a tortorous time downloading it before and hope others dont suffer through it again.  Hope you like it. ","torrent":{"xt":"urn:btih:4b001330e9b8a8e43090dd760786dd01b281c81b","amp;dn":"Torchwood+Season+1-3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b001330e9b8a8e43090dd760786dd01b281c81b","infoHashBuffer":{"type":"Buffer","data":[75,0,19,48,233,184,168,228,48,144,221,118,7,134,221,1,178,129,200,27]},"announce":[],"urlList":[]}}