{"title":"Topgrl--The Audition Devilynne Rain DeGrey High","uid":14193722,"size":2333182354,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4c265d7860e026afb353d34153a61578c92578d2&amp;dn=Topgrl--The+Audition+Devilynne+Rain+DeGrey+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"merzedes","files":1,"time":1459897774,"description":"\nThe Audition | Devilynne | Rain DeGrey \r\n\r\nApril 5, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nThroat slut auditions to join exclusive BDSM brothel  \r\n\r\nI want a new slave girl to keep in my house. A qualified applicant needs to be able to serve clients continuously, faithfully, and completely. Each girl that comes to me, hoping for a position, must be put through rigorous testing. Devilynne is certainly one of the cutest and most enthusiastic little numbers that I have had the pleasure of using in a while. It is time to see exactly what she is made of. \r\n\r\nThe men who come here aren't just looking for a quick lay before they head home. They pay top dollar for these sluts and they expect to be able to use and abuse them in any way that they see fit. Devilynne doesn't just need to be pretty, she needs to be tough. I'm going to flog her ass until it is bright pink from the impacts. She can scream all she wants, beg if she needs to, but the only requirement I have for this part of the test is that she suffer. I won't take quitters into my house. \r\n\r\nI have a thick, hard strap on that I use to test the girls, too. We have some clients with dicks you have to see to believe, and I need to make sure that my stable of sluts is ready to suck and fuck for their pleasure. Devilynne has a deep throat, one of the best in the business, but even it can barely fit the foot long monster I have hanging between my legs. How she handles me punishing her holes is the true test of whether or not she is ready to serve under me. She needs to be tireless when it comes to giving her body over for another person's satisfaction. If she can't keep fucking through multiple, incredible orgasms then I will have to just use her up and throw her away.  \r\n\r\nScreens \nhttp://www.topgrl.com/female/bondage/trailer.php?y=2016&amp;p=04_05devilynne2&amp;u=TopGrl-Devilynne-Rain-DeGrey-The-Audition\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:4c265d7860e026afb353d34153a61578c92578d2","amp;dn":"Topgrl--The+Audition+Devilynne+Rain+DeGrey+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c265d7860e026afb353d34153a61578c92578d2","infoHashBuffer":{"type":"Buffer","data":[76,38,93,120,96,224,38,175,179,83,211,65,83,166,21,120,201,37,120,210]},"announce":[],"urlList":[]}}