{"title":"Kaempferol - Chemistry, Natural Occurrences and Health Benefits","uid":15142196,"size":4887987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d3de543282bb35a60fcd9bf0c52c3b19e342d01&amp;dn=Kaempferol+-+Chemistry%2C+Natural+Occurrences+and+Health+Benefits&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467207497,"description":"Kaempferol - Chemistry, Natural Occurrences and Health Benefits - G. Villers, Y. Fougere (Nova, 2013).pdf\r\n\r\nKaempferol is a flavonol that is relatively abundant in various plants and some edible berries. These compounds have antioxidative, anti-inflammatory, antihypertensive, lipolytic and anti-cancer effects. In this book, the authors discuss the chemistry, natural occurrences and health benefits of kaempferol. Topics include the effect of cyclodextrins complexation on the properties of kaempferol; kaempferitrin and kaempferol as nutraceutical compounds contributing to glucose homeostasis by acting at multiple biological sites; distribution of kaempferol glycosides and their function in plants; analytical approaches for kaempferol determination; chemoprotective effects of kaempferol in colorectal tumorigenesis; multipotent flavonoid kaempferol as molecular targets and mechanism of action in nanotechnology applications in cancer and human health; metal complexes of kaempferol and their speciation in human plasma; the action of kaempferol on oral cavity cancer and airway secretion; kaempferol as it regulates intestinal tight junction permeability; and identification of kaempferol in historical textiles","torrent":{"xt":"urn:btih:4d3de543282bb35a60fcd9bf0c52c3b19e342d01","amp;dn":"Kaempferol+-+Chemistry%2C+Natural+Occurrences+and+Health+Benefits","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d3de543282bb35a60fcd9bf0c52c3b19e342d01","infoHashBuffer":{"type":"Buffer","data":[77,61,229,67,40,43,179,90,96,252,217,191,12,82,195,177,158,52,45,1]},"announce":[],"urlList":[]}}