{"title":"Madonna - Greatest Hits Volume 2 (2001)","uid":4506682,"size":557302238,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4d44a5b4f089101f66a57a78fa4f8f6786832950&amp;dn=Madonna+-+Greatest+Hits+Volume+2+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ToppoGiggio","files":1,"time":1226616838,"description":"Please share and comment. \nThe continuity of peer-to-peer depends on you. \nVisit http://www.finalshare.net\n\n\nThe 90's proved to be an interesting time for MTV's First Lady as she dabbled with different music styles while pursuing movies, music and motherhood (not necessarily in that order). Like its perfect predecessor THE IMMACULATE COLLECTION, GHV2 ...    Full Descriptionfeatures edited and remixed versions of her hits. Run in loosely chronological order, this collection kicks off during Madonna's overtly naughty face (the hypnotic &quot;Erotica&quot; and club anthem &quot;Deeper And Deeper&quot;) to specific film fare (a sweeping &quot;Don't Cry For Me Argentina&quot; and the delightfully psychedelic &quot;Beautiful Stranger&quot;).\n\nMadonna's most impressive moments came as a result of brilliant collaborations with electronica artists William Orbit and Frenchman Mirwais. Orbit's touch on songs from the critically acclaimed RAY OF LIGHT can be heard on the chilly sparseness of &quot;Frozen,&quot; infectious nature of the pulsing title track and ambient brilliance of &quot;The Power Of Good-Bye&quot;. The Gallic producer/performer helped Madonna greet the millennium with MUSIC and a string of hits including stop-and-stutter thump of &quot;Don't Tell Me&quot; and the serpentine electro-funk that is the title track. Constantly changing her image the way most people change clothes, Madonna's equally quirky stylistic unpredictability maintains her hold on being pop's greatest musical chameleon.\n\nThis Maverick retrospective spans 1991-2001, 15 tracks including, 'Erotica', Deeper And Deeper', 'Music', 'Ray Of Light and more. Features many single remix version, in place of LP versions. This collection complements her 1st greatest hits, 'The Immaculate Collection'.","torrent":{"xt":"urn:btih:4d44a5b4f089101f66a57a78fa4f8f6786832950","amp;dn":"Madonna+-+Greatest+Hits+Volume+2+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d44a5b4f089101f66a57a78fa4f8f6786832950","infoHashBuffer":{"type":"Buffer","data":[77,68,165,180,240,137,16,31,102,165,122,120,250,79,143,103,134,131,41,80]},"announce":[],"urlList":[]}}