{"title":"Christoph Andersson - Operation Norrsken (Svensk Retail EPUB)","uid":13018680,"size":1537126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d5d8c3bbb73349f83412c854bf730ae37b4e1dc&amp;dn=Christoph+Andersson+-+Operation+Norrsken+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1450318955,"description":"Författare: Christoph Andersson\r\n       Titel: Operation Norrsken - Om Stasi och Sverige under kalla kriget\r\nUtgivningsår: 2013\r\n       Språk: Svenska\r\n        ISBN: 9789113051352\r\n      Format: Retail EPUB\r\n\r\nFöre Berlinmurens fall var DDR och dess ökända säkerhetstjänst Stasi en maktfaktor i Europa. Journalisten Christoph Andersson har grävt i arkiven och hittat häpnadsväckande uppgifter om dess svenska kopplingar.\r\n\r\nPå 80-talet ville regeringen Palme exportera svensk kärnvapenteknologi till DDR. Ärendet var kontroversiellt, men den enda som började nysta i frågan var Rapportjournalisten Cats Falck. Hon upp­täckte ett mystiskt östtyskt företag som skulle vara mellanhand. I november 1984 försvann hon spårlöst och hittades senare död.\r\n\r\nLika mystiskt dog krigsmaterielinspektören Carl Algernon. Det var under efterdyningarna av Bofors omstridda export av krut och sprängämnen till Iran via DDR. Men också efter att Bofors i hemlighet tillverkat krut till östtyska folkarméns Kalasjnikovgevär. Även här figurerade ett mystiskt östtyskt företag.\r\n\r\nI båda affärerna hade DDR:s säkerhetstjänst Stasi sina fingrar med i spelet. Stasi gav sig även in i frågan om immunsjukdomen aids. Målet var att få aids att framstå som ett hemligt amerikanskt bio­logiskt vapen. Filmregissören Roy Andersson var snabb att svälja betet och bakade in idéerna i en upplysningsfilm, bekostad av Socialstyrelsen.\r\n\r\nMen den kanske största Stasioperationen blev en flopp. Den gick under namnet Operation Norrsken och skulle kompromettera det svenska kungahuset för dess gamla förbindelser med Nazityskland. Allt avblåstes i sista stund när Stasi och DDR insåg att det fanns pengar att tjäna. Närmare bestämt genom att göra ljusskygga affärer med svenska Asea, Bofors - och den socialdemokratiska regeringen Palme","torrent":{"xt":"urn:btih:4d5d8c3bbb73349f83412c854bf730ae37b4e1dc","amp;dn":"Christoph+Andersson+-+Operation+Norrsken+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d5d8c3bbb73349f83412c854bf730ae37b4e1dc","infoHashBuffer":{"type":"Buffer","data":[77,93,140,59,187,115,52,159,131,65,44,133,75,247,48,174,55,180,225,220]},"announce":[],"urlList":[]}}