{"title":"Sonny Stitt - The Champ (1973) [Jazz][flac][schon55]","uid":5951028,"size":257032116,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4d752f28b660afe72a26ee68e61d578740e418fe&amp;dn=Sonny+Stitt+-+The+Champ+%281973%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":21,"time":1289526887,"description":"Sonny Stitt - The Champ \nYear: 1973\nAudio CD: August 25, 1998 \nLabel: 32. Jazz Records \nQuality: flac + cue\n \nOf the three artists whose every recorded moment I can't seem to resist purchasing--Sinatra, Miles, and Stitt--Sonny makes me question my consumer habits most. This album, like the 30+ others I have of him, has all the licks, formulae, cliches that I know by heart. There's hardly a single unpredictable moment from him, but his playing is so precise, polished, and perfect, its presence in varying musical contexts represents a refuge of beauty and sanity in an otherwise unstable world.\nThe rhythm section, though largely unheralded, is arguably second to none. I recall the night at the Vanguard when Roy Brooks launched the Heath brothers into another time zone; and the night at Chicago's long defunct Brown Shoe when a heroic piano set by the neglected Duke Jordan erased the memory of Hank Mobley's embarassing collapse on the bandstand moments earlier; and no one played better walking bass lines than Sam Jones, who was one of the main reasons for the popular success of Cannonball's &quot;live&quot; dates on Riverside. And finally Joe Newman, a former Basie section man who fully understands his role on a session like this, is an ideal complement to Sonny.\n\nThe only slight disappointment is the opening tune, &quot;The Champ,&quot; yet another B flat blues. As much as Sonny loves the tonic note, he loves a B flat tonic note even more for some reason, coming back to it at least 3 times on his first 12-bar chorus. On the other hand, it's nice to know there are still some things that can always be counted on. ~ Samuel Chell\n\nSonny Stitt was in great form in the early '70s. The rhythm section on this release (which has been reissued on CD) is excellent: pianist Duke Jordan, bassist Sam Jones and drummer Roy Brooks. The problem is that trumpeter Joe Newman is not quite up to par and Stitt constantly cuts his own solos short to make room for Newman...There are some good spots for Stitt's tenor and alto...Tune Up is a better introduction to this period. ~ Scott Yanow, All Music Guide\n\nSonny Stitt - The Champ Tracks:\n01  The Champ\n02  Sweet and Lovely\n03  The Midgets\n04  The Eternal Triangle\n05  All the Things You Are\n06  Walkin'","torrent":{"xt":"urn:btih:4d752f28b660afe72a26ee68e61d578740e418fe","amp;dn":"Sonny+Stitt+-+The+Champ+%281973%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d752f28b660afe72a26ee68e61d578740e418fe","infoHashBuffer":{"type":"Buffer","data":[77,117,47,40,182,96,175,231,42,38,238,104,230,29,87,135,64,228,24,254]},"announce":[],"urlList":[]}}