{"title":"The Beach Boys - Little Deuce Coupe &amp; All Summer Long (HDCD Rema","uid":4283186,"size":406756840,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4e7bf0a33c139ac07d7aaec66f346954f83f35a5&amp;dn=The+Beach+Boys+-+Little+Deuce+Coupe+%26+All+Summer+Long+%28HDCD+Rema&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SergioPlayboy","files":48,"time":1215539692,"description":"Little Deuce Coupe (1963)\n-------------------------------------------------------------------------------------\nLittle Deuce Coupe was a concept album of sorts, in that most of the songs had something to do with cars and hot rod culture. That&amp;#039;s a pretty thin train of thought to sustain for most of a record. What&amp;#039;s worse, by the Beach Boys&amp;#039; own standards of hot rod tunes, most of the tracks are pretty trite and unimaginative, rating among their worst early material. Not only that, the three best cuts -- &quot;Little Deuce Coupe,&quot; &quot;409,&quot; and &quot;Shut Down&quot; -- had already been issued on LP. The most noteworthy of the other tracks was the Top Ten hit &quot;Be True to Your School,&quot; whose fine tune and arrangement are marred by breathtakingly sappy lyrics of faith and loyalty to one&amp;#039;s high school. (The album version, oddly, is different from the superior single, which had the Honeys adding female cheerleader chants.) &quot;Spirit of America&quot; and &quot;A Young Man Is Gone&quot; (a James Dean tribute with Four Freshmen-style vocals) are moderately interesting numbers, but on the whole this is probably the worst early Beach Boys album, with the possible exception of Surfin&amp;#039; Safari (and their 1964 Christmas LP, which doesn&amp;#039;t really count).\n\nAll Summer Long (1964)\n-------------------------------------------------------------------------------------\nThe best pre-1965 Beach Boys album featured their brilliant number one single &quot;I Get Around,&quot; as well as other standout cuts in the beautifully sad &quot;Wendy,&quot; &quot;Little Honda&quot; (one of their best hot rod tunes, covered by the Hondells for a hit), and their remake of the late-&amp;#039;50s doo wop classic &quot;Hushabye.&quot; The nostalgic &quot;All Summer Long,&quot; another great production, seemed (whether intentionally or not) like a sort of farewell to the frivolous California beach culture that had supplied the lyrical grist for most of their music up to this point, with a longing, regretful chorus that was totally at odds with the bouncy arrangement. Other relatively little-known treasures are the sumptuous ballad &quot;Girls on the Beach,&quot; with some of their best early harmonizing, and &quot;Don&amp;#039;t Back Down,&quot; with uncommonly anxious lyrics. You can&amp;#039;t give a high rating, however, to an album that also contained such disposable filler as the &quot;Our Favorite Recording Sessions&quot; comedy bit and &quot;Do You Remember?&quot; and a &quot;let&amp;#039;s-pay-tribute-to-rock&amp;#039;s-early-days&quot; number with a sh*t-eating grin wide enough to qualify as an oldies radio ID jingle. [Little Deuce Coupe/All Summer Long, a Capitol two-fer CD, combines this and Little Deuce Coupe onto one disc, adding the 45 version of &quot;Be True to Your School,&quot; alternate takes of &quot;Little Honda&quot; and &quot;Don&amp;#039;t Back Down,&quot; and the previously unreleased &quot;All Dressed Up for School.&quot;]\n\nRichie Unterberger, AMG\n\n\n\nEAC Log, Cue &amp; Complete Artwork Included.\n\nEnjoy!\n\n\n\nP.S.: After you&amp;#039;ve done, please someone upload this to Demonoid. Thanks!","torrent":{"xt":"urn:btih:4e7bf0a33c139ac07d7aaec66f346954f83f35a5","amp;dn":"The+Beach+Boys+-+Little+Deuce+Coupe+%26+All+Summer+Long+%28HDCD+Rema","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e7bf0a33c139ac07d7aaec66f346954f83f35a5","infoHashBuffer":{"type":"Buffer","data":[78,123,240,163,60,19,154,192,125,122,174,198,111,52,105,84,248,63,53,165]},"announce":[],"urlList":[]}}