{"title":"Papa canguro[DVDrip][Spanish]","uid":5486390,"size":730841088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4e7feb20fb9d0b83adc29077c539997e23d24caf&amp;dn=Papa+canguro%5BDVDrip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sahae","files":1,"time":1270743060,"description":"DirecciÃƒÂ³n: Steve Carr.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2003.\nDuraciÃƒÂ³n: 92 min.\nInterpretaciÃƒÂ³n: Eddie Murphy (Charlie Hinton), Jeff Garlin (Phil), Steve Zahn (Marvin), Regina King (Kim), Anjelica Huston (Srta. Harridan), Kevin Nealon (Bruce), Jonathan Katz (Sr. Dan Kubitz), Siobhan Fallon Hogan (Peggy), Lacey Chabert (Jenny), Laura Kightlinger (Sheila), Leila Arcieri (Kelli)\nGuiÃƒÂ³n: Geoff Rodkey.\nProducciÃƒÂ³n: John Davis, Matt Berenson  y Wyck Godfrey.\nMÃƒÂºsica: David Newman.\nFotografÃƒÂ­a: Steven B. Poster.\nMontaje: Christopher Greenbury.\nDiseÃƒÂ±o de producciÃƒÂ³n: Garreth Stover.\nDirecciÃƒÂ³n artÃƒÂ­stica: Chris Cornwall.\nVestuario: Ruth E. Carter.\nEstreno en USA: 4 Mayo 2003\nEstreno en EspaÃƒÂ±a: 5 Septiembre 2003.\n\nSINOPSIS\n\nCharlie (Eddie Murphy) y Phil (Jeff Garlin) es-tÃƒÂ¡n tan absorbidos por sus trabajos como al-tos ejecutivos de publicidad que estÃƒÂ¡n perdiÃƒÂ©n-dose los placeres de la paternidad. Sin embar-go, tras no obtener los resultados esperados en una campaÃƒÂ±a publicitaria sobre cereales vegetales, Charlie y Phil son despedidos de sus trabajos. Esto significa que no podrÃƒÂ¡n volver a enviar a sus hijos a la selecta Academia Chapman para que estÃƒÂ©n controlados por la estricta Srta Gwyneth Harridan (Anjeli-ca Huston). DespuÃƒÂ©s de fracasar en la bÃƒÂºsqueda de un empleo Charlie tiene una idea. Ã‚Â¿Si Phil y ÃƒÂ©l pueden arreglÃƒÂ¡rselas para cui-dar de 2 niÃƒÂ±os, que dificultad puede tener cuidar a 10? . SerÃƒÂ¡ mÃƒÂ¡s duro de lo que nunca hubieran imaginado y Charlie y Phil pronto se dan cuenta de lo que se les viene encima. Pero poco a poco apren-den a llevar a los niÃƒÂ±os y su nueva aventura como canguros crece. A medida que aumenta el nÃƒÂºmero de niÃƒÂ±os se buscan un tercer cu-idador, Marvin (Steve Zahn), que parece hablar el lenguaje de los ni-ÃƒÂ±os. Charlie y Phil se irÃƒÂ¡n acercando a sus hijos hasta que apren-den a apreciar los impagables momentos entre padre e hijo. Sin embargo, la Srta. Gwyneth Harridan, estÃƒÂ¡ dispuesta a acabar con la competencia y se inicia la lucha por hacerse con el cuidado de los niÃƒÂ±os.\n\n","torrent":{"xt":"urn:btih:4e7feb20fb9d0b83adc29077c539997e23d24caf","amp;dn":"Papa+canguro%5BDVDrip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e7feb20fb9d0b83adc29077c539997e23d24caf","infoHashBuffer":{"type":"Buffer","data":[78,127,235,32,251,157,11,131,173,194,144,119,197,57,153,126,35,210,76,175]},"announce":[],"urlList":[]}}