{"title":"Celtic Mythology A to Z (2nd Edition)","uid":6355768,"size":6089779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:521e95606aa4cc4a2482ce8151aa94189d0f22e1&amp;dn=Celtic+Mythology+A+to+Z+%282nd+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lionzbay","files":1,"time":1304144561,"description":"\nAuthor(s):Gienna Matson\nDate:2010\nFormat: PDF\nLanguage:English\nISBN10: 1604134135\nPages: 131\n\nCeltic Mythology A to Z is a clearly written, illustrated guide to the characters, objects, and places that make up the mythic lore of the Celtic peoples. With more than 450 entries providing readable definitions, explanations, and descriptions of the major stories, gods and goddesses, places, and beliefs, this book is the perfect resource for young people who want to know more about ancient Celtic myths.\nThis volume is part of the Mythology A to Z series from Facts On File. Each volume has a similar format: an introduction includes a history of the culture(s), an explanation of the book, and a pronunciation guide, followed by a time line and a map. The main text is an alphabetical listing of names, places, and ideas important to the mythology of the culture. The definitions are mostly brief--a single paragraph--although some are as lengthy as a page. Many black-and-white illustrations, mostly of artifacts, enhance the text. Each volume includes a good bibliography with Internet addresses.\n\nThe series is designed for young people in junior high and high school, and it is appropriate for younger children who are better readers or interested in mythology. Except in the Celtic volume there is not much storytelling since the volumes are intended to be encyclopedias rather than collections of stories. They will help students to make connections between mythological characters and images and compare similarities between cultures. The indexes are constructed to help make those connections, too. Although the pronunciation guides in the introductions are excellent, a young audience also needs pronunciations at appropriate entry headings. It is difficult to remember strange pronunciations or to flip to the front of the book to figure out how to say foreign names. ","torrent":{"xt":"urn:btih:521e95606aa4cc4a2482ce8151aa94189d0f22e1","amp;dn":"Celtic+Mythology+A+to+Z+%282nd+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"521e95606aa4cc4a2482ce8151aa94189d0f22e1","infoHashBuffer":{"type":"Buffer","data":[82,30,149,96,106,164,204,74,36,130,206,129,81,170,148,24,157,15,34,225]},"announce":[],"urlList":[]}}