{"title":"God, Sky and Land - Genesis 1 as the Ancient Hebrews Heard It by","uid":7142705,"size":26370620,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:532c58395604d41923256f17ca4e7ed2c1a11b2b&amp;dn=God%2C+Sky+and+Land+-+Genesis+1+as+the+Ancient+Hebrews+Heard+It+by&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1333053380,"description":"God, Sky &amp; Land - Genesis 1 as the Ancient Hebrews Heard It by Brian Bull &amp; Fritz Guy (2011).  A PDF.\n\n&quot;... a stunning success, forcing us to rethink our assumptions [and] listen with greater sensitivity to what Bible writers originally intended to communicate.&quot; -- Douglas R. Clark, professor of Biblical studies and archaeology, La Sierra University\n\nFrom Amazon.com:\n\nIn God, Sky &amp; Land, theologian Fritz Guy and scientist Brian Bull take us back more than three thousand years and re-create Genesis 1 as it was heard by its original audience. With their unique retro-translation, based explicitly on the Hebrew text and dubbed the Original Hearers' Version, they lead us into the world of Genesis 1 that the post-Exodus Hebrews knew. Guy and Bull explore the explanatory concepts of the ancients and the ones we have added in the millenniums since. Most useful to the science/theology debate, the authors show how unhelpful it is to place modern scientific demands on an ancient text. The authors affirm that Genesis 1 is God's truth but does not and could not include all of the truth we have been given since then. They steer us away from trying to inject Genesis 1 into scientific debate and back to the rock-solid truth it reveals about God.\n\nFRITZ GUY, PhD is a research professor of philosophical theology at La Sierra University. Besides teaching at three universities, he has served as a church pastor, college dean, and university president. He is the author of 80 popular and scholarly articles and the book Thinking Theologically (1999).\n\nBRIAN BULL, MD is professor and chair of the Loma Linda University Medical School department of Pathology and Human Anatomy. He served as editor-in-chief of Blood Cells, an international hematology journal (1984-1993), and as LLU Medical School dean (1994-2003). He is the author of 200 scientific articles, book chapters, and monographs.","torrent":{"xt":"urn:btih:532c58395604d41923256f17ca4e7ed2c1a11b2b","amp;dn":"God%2C+Sky+and+Land+-+Genesis+1+as+the+Ancient+Hebrews+Heard+It+by","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"532c58395604d41923256f17ca4e7ed2c1a11b2b","infoHashBuffer":{"type":"Buffer","data":[83,44,88,57,86,4,212,25,35,37,111,23,202,78,126,210,193,161,27,43]},"announce":[],"urlList":[]}}