{"title":"Tax Assistant for Excel Professional v5.2 with Key [TorDigger]","uid":9518389,"size":9566073,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:54b50318e0158b3e02435f11002730872cc5601c&amp;dn=Tax+Assistant+for+Excel+Professional+v5.2+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":11,"time":1390575836,"description":"Tax Assistant for Excel\n\nTax Assistant for Excel is a custom application written for Microsoft Excel and requires Microsoft Excel 2007/2010/2013. It simplifies your Federal Income Tax preparation by providing Excel workbooks with IRS approved substitutes of Form 1040 and Form 1040A with Schedules A, B, C, C-EZ, D, E, SE, Forms 6251 (AMT), 4952, 6781, 8829 and 8949. There are also a number of worksheets related to deductions and Schedule D including the Social Security Benefits, Qualified Dividends and Capital Gain Tax, and Child Tax Credit worksheets.\n\nYour sources of income, deductions, capital gain transactions as well as partnership and S corporation income are entered on separate worksheets. The data from these worksheets is then automatically entered into the correct forms. Tax Assistant for Excel helps you determine whether to itemize deductions, automatically calculates your tax and provides a computerized record of your tax filing. The program also provides an automated Schedule D and Form 8949 preparation that is especially helpful for active traders and other taxpayers with a large number of trades to report. The program allows you to easily enter or copy and paste your trades into the Capital Gains sheet and print out a Schedule D attachment as a substitute for preparing multiple Form 8949's, although the program will prepare up to 100 Form 8949's.\n\nIn addition to the more common income reporting, you can report income from up to five different businesses, rents, royalties, estates and trusts, as well as income from partnerships and S corporations.\n\nThe trial version will remain fully functional for 7 days and the expiration can be removed with the registration passkey provided upon registering the program. Entering the registration passkey will also revive the program after the 7 day trial period has expired.\n\nThe forms provided in Tax Assistant for Excel are accurate reproductions of the actual forms and are approved by the IRS. While the program will help you with your tax preparation, it does require that you follow some IRS instructions in order to accurately complete your tax return. If you do not feel comfortable with this approach, you should purchase an interview based tax preparation software package or hire a professional to prepare your tax return. Even if you use other tax preparation software or a tax professional, Tax Assistant for Excel can provide IRS approved electronic copies of your tax return in the common Microsoft Excel file format for long term storage. It can also provide an easy way to estimate your taxes based on different scenarios.\n\nSystem Requirements:\n\nWindows All\nrequires Microsoft Excel 2007/2010/2013\n\nHomepage: http://www.djicomputer.com/TaxAssistant.htm\n\nInstallation Instructions. \n\n- Install program.\n- Register application with given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:54b50318e0158b3e02435f11002730872cc5601c","amp;dn":"Tax+Assistant+for+Excel+Professional+v5.2+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54b50318e0158b3e02435f11002730872cc5601c","infoHashBuffer":{"type":"Buffer","data":[84,181,3,24,224,21,139,62,2,67,95,17,0,39,48,135,44,197,96,28]},"announce":[],"urlList":[]}}