{"title":"The Knight by Pierre Pevel (High Kingdom Series #1)","uid":11092280,"size":1375581,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5654586328071e2a3ff36c9e233b537f7217c18a&amp;dn=The+Knight+by+Pierre+Pevel+%28High+Kingdom+Series+%231%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":2,"time":1411541858,"description":"\nAn epic new fantasy story - and an epic war between brothers . . .\n\nPierre Pevel has written a fantasy Dumas novel, and now he's bringing all the skills of a historical fantasy writer to an epic stage. In the wake of Martin and Gemmell, his new project charts a dynastic power struggle between three brothers.\n\nWhen the King dies his will, to everyone's surprise, leaves the throne to the second of his three sons. It's a surprising choice, and a worrying one as it coincides with a prophecy: that the succession will lead to war, chaos and the undoing of the entire nation. \n\nIt's something his eldest son can't allow to happen . . . so he challenges his brother's right to rule - as does the youngest son, with the full support of the Church behind him. But while the prophecy itself is clear, it's not so clear which prince it's referring to.\n\nLorn knows which side he's on: his King chose a sucessor, and Lorn is going to fight to the last to place him on the throne. Honouring that last wish is the right thing to do; Lorn is also fighting for his best friend and the man he believes should be king. \n\nBut belief is one thing, victory in politics and war is another and the odds are against them. Worse: with every passing day the prophecies grow darker, and a land already torn by civil war is easy pickings for an invasion . . .\n\nGenre: Fantasy","torrent":{"xt":"urn:btih:5654586328071e2a3ff36c9e233b537f7217c18a","amp;dn":"The+Knight+by+Pierre+Pevel+%28High+Kingdom+Series+%231%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5654586328071e2a3ff36c9e233b537f7217c18a","infoHashBuffer":{"type":"Buffer","data":[86,84,88,99,40,7,30,42,63,243,108,158,35,59,83,127,114,23,193,138]},"announce":[],"urlList":[]}}