{"title":"All Bar Luke - Series 01 to 03 - Audio Comedy - 128k - MP3 - Sli","uid":5247544,"size":241935412,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:568d5d3dda487e0cf66933d7bd66d803a810098b&amp;dn=All+Bar+Luke+-+Series+01+to+03+-+Audio+Comedy+-+128k+-+MP3+-+Sli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":17,"time":1262220418,"description":"All Bar Luke - Series 01 to 03 - + Special - Audio Comedy - BBC Radio 4 via DVB-T\n17 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nLuke Walsall missed the education boat, never got out of Cheveley, and spends his weekends as the hapless driver for his ungrateful friends. Sipping his coke and chatting hyperactively, while they drink themselves into absurdity, Luke struggles, with excruciating awkwardness, to climb the macho pecking order.\n\nEach episode of All Bar Luke covers the dying minutes of another nightmare evening for Luke. Whether he's trapped with the hen party from hell or pouring his heart out to a cab driver - only Luke's voice is picked out of the late night hubbub.\n\nThis third series finds Luke in the process of rebuilding his social life after a violent fall-out with his so-called friends. But old wounds are re-opened when his brother starts seeing Hayley - the longstanding object of his devotion.\n\n\n[b]www.comedy.co.uk Review: What is most notable about this sitcom is that you only get to hear one voice - that of loser Luke Walsall (played by writer Tim Key). This provides an interesting angle on every situation, as it is through Luke's responses to the questions he is asked that you slowly begin to understand just what an awful situation he has found himself in this time.\n\nKey's performance is spot on, nervous giggle and all. The result is the listener is steered into feeling both frustrated at Luke for not grabbing the most out of life (for example, in one episode it is obvious a woman fancies Luke, but he hasn't spotted it), and also sad on behalf of the character.\n\nOur only criticism of these fifteen minute episodes is that, although amusing, they do manage to leave the more sensitive feeling a bit down, as Luke shows just how bleak and lonely life can be for those without friends and family around them.[/b]\n\n\n\n\nAll Bar Luke - S01 - E01 - Luke In The Pub \nAll Bar Luke - S01 - E02 - Luke And The Kebabs \nAll Bar Luke - S01 - E03 - Luke And The House Party \nAll Bar Luke - S01 - E04 - Luke In Casualty \n\nAll Bar Luke - S02 - E01 - The Stripper \nAll Bar Luke - S02 - E02 - The Curry \nAll Bar Luke - S02 - E03 - The Hounds \nAll Bar Luke - S02 - E04 - The German \nAll Bar Luke - S02 - E05 - The Barbecue \nAll Bar Luke - S02 - E06 - The Nightclub \n\nAll Bar Luke - S03 - E01 - The Prang \nAll Bar Luke - S03 - E02 - The Date \nAll Bar Luke - S03 - E03 - The Engagement \nAll Bar Luke - S03 - E04 - The Hen Night \nAll Bar Luke - S03 - E05 - The Cruise \nAll Bar Luke - S03 - E06 - The Wedding \nAll Bar Luke - S03 - ESP - The Christmas Dinner\n\n\n\nAudio Format    : MP3\nDuration Approx : 27mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps \nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:568d5d3dda487e0cf66933d7bd66d803a810098b","amp;dn":"All+Bar+Luke+-+Series+01+to+03+-+Audio+Comedy+-+128k+-+MP3+-+Sli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"568d5d3dda487e0cf66933d7bd66d803a810098b","infoHashBuffer":{"type":"Buffer","data":[86,141,93,61,218,72,126,12,246,105,51,215,189,102,216,3,168,16,9,139]},"announce":[],"urlList":[]}}