{"title":"[audiobook] Hegemony or Survival - Americas Quest for Global Dom","uid":4138037,"size":464374419,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:573ac262f7e4931baa0ac1189bb14053acec0e91&amp;dn=%5Baudiobook%5D+Hegemony+or+Survival+-+Americas+Quest+for+Global+Dom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hackthegrind","files":67,"time":1208359966,"description":"Editorial Reviews\n\n\n\n\nAmazon.com\n\nNoam Chomsky is considered the father of modern linguistics. In this richly detailed criticism of American foreign policy, he seeks to redefine many of the terms commonly used in the ongoing American war on terrorism. Surveying U.S. actions in Cuba, Nicaragua, Turkey, the Far East and elsewhere over the past half a century along with the modern American war in Iraq, Chomsky indicates that America is just as much a terrorist state as any other government or rogue organization. George W. Bush&amp;#039;s 2003 invasion of Iraq drew worldwide criticism, in part because it seemed to present a new philosophy of pre-emptive war and an appearance of global empire building. But according to Chomsky, such has been the operating philosophy of American foreign policy for decades. Opponents of the Bush administration&amp;#039;s tactics consistently point out how the American government supported Saddam Hussein for many years prior to the 1990 invasion of Kuwait (pictures of Donald Rumsfeld shaking Saddam&amp;#039;s hand are easy to come by) as a means of pointing out how the United States is happy to fund despots when it&amp;#039;s in American interests. But Chomsky, armed with extensive historical notation, takes this notion further, arguing how the repression of other nations&amp;#039; citizenry is, in fact, the very reason Americans support certain foreign leaders. The charges made throughout the book are severe, as are the dire consequences he posits if current trends are not reversed, and Chomsky is no more likely to make friends or gain supporters from the mainstream now than he&amp;#039;s ever been. But Hegemony or Survival is relatively dispassionate. Instead of relying on camp or shock value or personal attacks as some of his contemporaries have done, Chomsky drives his well-supported points steadily forward in an earnest and highly readable style. \n\n-John Moe\n\n\n\nFrom Publishers Weekly\n\nIn this highly readable, heavily footnoted critique of American foreign policy from the late 1950s to the present, Chomsky (whose 9-11 was a bestseller last year) argues that current U.S. policies in Afghanistan and Iraq are not a specific response to September 11, but simply the continuation of a consistent half-century of foreign policy-an &quot;imperial grand strategy&quot;-in which the United States has attempted to &quot;maintain its hegemony through the threat or use of military force.&quot; Such an analysis is bound to be met with skepticism or antagonism in post-September 11 America, but Chomsky builds his arguments carefully, substantiates claims with appropriate documentation and answers expected counterclaims. Chomsky is also deeply critical of inconsistency in making the charge of &quot;terrorism.&quot; Using the official U.S. legal code definition of terrorism, he argues that it is an exact description of U.S. foreign policy (especially regarding Cuba, Central America, Vietnam and much of the Middle East), although the term is rarely used in this way in the U.S. media, he notes, even when the World Court in 1986 condemned Washington for &quot;unlawful use of force&quot; (&quot;international terrorism, in lay terms&quot; Chomsky argues) in Nicaragua. Claiming that the U.S. is a rogue nation in its foreign policies and its &quot;contempt for international law,&quot; Chomsky brings together many themes he has mined in the past, making this cogent and provocative book an important addition to an ongoing public discussion about U.S. policy.\nCopyright 2003 Reed Business Information, Inc.","torrent":{"xt":"urn:btih:573ac262f7e4931baa0ac1189bb14053acec0e91","amp;dn":"%5Baudiobook%5D+Hegemony+or+Survival+-+Americas+Quest+for+Global+Dom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"573ac262f7e4931baa0ac1189bb14053acec0e91","infoHashBuffer":{"type":"Buffer","data":[87,58,194,98,247,228,147,27,170,10,193,24,155,177,64,83,172,236,14,145]},"announce":[],"urlList":[]}}