{"title":"EnigmaT Set Rips { Cuts } - February 15th, 2014","uid":9622066,"size":523938846,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:584ad439d1c0286c217b418de8955896dd161461&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+February+15th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":61,"time":1392517662,"description":"Above &amp; Beyond - Good For Me (Acoustic) (ABGT 066 Rip)-enTc.mp3\nAce Ventura &amp; Freedom Fighters - The Encounter (Cut From Patterson Set)-enTc.mp3\nAirborn - AirBURN (Club Mix) (Cut From Feel Set)-enTc.mp3\nAlex Bastian - Last Gaze (Cut From Ruben Set)-enTc.mp3\nAlex M.O.R.P.H. &amp; Woody van Eyden - A Night Outside (Original Aluminium Mix) (Cut From MORPH Set)-enTc.mp3\nAllen &amp; Envy &amp; Sarah Lynn - Save Your Last Breath (ASOT 650-3 Rip)-enTc.mp3\nAnton Firtich - On Reality (Original Mix) (Cut From 1Touch Set)-enTc.mp3\nArmin van Buuren - Save My Night (Allen Watts Remix) (ASOT 650-3 Rip)-enTc.mp3\nAtaraxia - Another Reason (Ula Remix) (Cut From Above Clouds Set)-enTc.mp3\nBastian Salbart - Yes We Can (Cut From Nifra Set)-enTc.mp3\nBXT - White Lynx (Cut From Ruben Set)-enTc.mp3\nClaudia Cazacu &amp; Matt Williams feat. Brian Molko - Deal With God (Cut From Kihlom Set)-enTc.mp3\nCorti Organ - The Golden Age (Original Mix) (Set Rip)-enTc.mp3\nDennis Sheperd &amp; Cold Blue &amp; Ana Criado - Every Word (Uplifting Mix) (Cut From Feel Set)-enTc.mp3\nDreamy - Gaia (UDM Remix) (Cut From Above Clouds Set)-enTc.mp3\nDreamy - Gaia (UDM Remix) (Cut From MORPH Set)-enTc.mp3\nDriftmoon &amp; Andy Blueman feat. Dsharp - Leviticus (ASOT 650-3 Rip)-enTc.mp3\nECO &amp; Carly Burns - Hurt (Keyworth Oldfresh Remix) (Cut From Ruben Set)-enTc.mp3\nEssonita Feat. Irina Makosh - Assure You (Gradian Vocal Mix) (Cut From Angel Ace Set)-enTc.mp3\nEuphoric Feel - Anguished (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nFedde le Grand and Sultan &amp; Ned Shepard - No Good (Markus Schulz Big Room Reconstruction) (-Short- GDJB Rip)-enTc.mp3\nFlatlex - Faded Memories (Original Mix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nFour3Four - Ligature (Original Mix) (Cut From Reneem Set)-enTc.mp3\nFrank Dueffel &amp; Tekno - Two Faces (Cut From Lange Set)-enTc.mp3\nFreedom Fighters &amp; Outsiders - Dust (Cut From Patterson Set)-enTc.mp3\nGrum - Tears (Grum Club Mix) (ABGT 066 Rip)-enTc.mp3\nIrdi - Statica (Original Mix) (Cut From 1Touch Set)-enTc.mp3\nJuventa - Stella Polare (Original Mix) (ABGT 066 Rip)-enTc.mp3\nKiholm - Soft Collision (Deep Mix) (Cut From Kihlom Set)-enTc.mp3\nKill FM feat. Leah Hayes - Lies (Cut From Kihlom Set)-enTc.mp3\nLaker - Breathing (Original Mix) (Cut From Tero A Set)-enTc.mp3\nLakes - Tomorrow Will Come (Eddie Lung Remix) (Cut From Jerom Set)-enTc.mp3\nLekSin - My Religion (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nMade By Monkeys - I Try (Winkee Remix) (Cut From Templer Set)-enTc.mp3\nMax Freegrant - Oasis (ABGT 066 Rip)-enTc.mp3\nMax Freegrant - Oasis (ASOT 650-3 Rip)-enTc.mp3\nO.B.M Notion - Peacefulness (Original Mix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nOrbion - Escape (Dub Mix) (Cut From Super8 Set)-enTc.mp3\nOrbion - Escape (Original Mix) (Cut From Feel Set)-enTc.mp3\nOrgan Donors &amp; Scot Project - Found Love (Organ Donors Mix) (Cut From Sherry Set)-enTc.mp3\nOxygen feat. Andrea Britton - Am I On Your Mind (Flashtech Remix) (ABGT 066 Rip)-enTc.mp3\nOxygen feat. Andrea Britton - Am I On Your Mind (Flashtech Remix) (Cut From MORPH Set)-enTc.mp3\nPaul Mark feat. MoodLifter - Inspired By Light (Original Mix) (Cut From 1Touch Set)-enTc.mp3\nPaul Oakenfold - Cafe Del Mar (Angry Man Remix) (Cut From Sherry Set)-enTc.mp3\nPaul Oakenfold - Cafe Del Mar (ASOT 650-3 Rip)-enTc.mp3\nPlayme - Phoenix (Cut From Uplift Set)-enTc.mp3\nProyal feat. Al Takekawa - The Orbit (Hazem Beltagui Remix) (Cut From Ruben Set)-enTc.mp3\nRichard Durand - Morning Light (Cut From Lange Set)-enTc.mp3\nRoger Shah Feat. Carla Werner - One Life (Andrew Rayel Remix) (Cut From Shah Set)-enTc.mp3\nRoman Messer feat Christina Novelli - Frozen (Alex M.O.R.P.H. Remix) (ASOT 650-3 Rip)-enTc.mp3\nRonny K - Sequile (Original Mix) (Cut From Uplift Set)-enTc.mp3\nRonski Speed &amp; Syntrobic feat. Elizabeth Egan - One With You (Stoneface &amp; Terminal Dub) (ABGT 066 Rip)-enTc.mp3\nSou Kanai - Liberty (Cut From Team140 Set)-enTc.mp3\nSteven Brooks - Beta-Motion (Original Mix) (Cut From Saux Set)-enTc.mp3\nSunset &amp; Markus Voorn - Valentine (CJ Arthur Remix) (Cut From Above Clouds Set)-enTc.mp3\nThe Blizzard &amp; Omnia - Whiteout (ASOT 650-3 Rip)-enTc.mp3\nTransport - From Here To Eternity (Original Mix) (Cut From EL Jay Set)-enTc.mp3\nTransport - From Here To Eternity (Original Mix) (Cut From Jerom Set)-enTc.mp3\nUtah Saints - Lost Vagueness (Mark Greene Rework) (Cut From Sherry Set)-enTc.mp3\nVassage - Capacitor (Original Mix) (Cut From Feel Set)-enTc.mp3\nVertical Mode - Bad Luck Buffet (Cut From Patterson Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:584ad439d1c0286c217b418de8955896dd161461","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+February+15th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"584ad439d1c0286c217b418de8955896dd161461","infoHashBuffer":{"type":"Buffer","data":[88,74,212,57,209,192,40,108,33,123,65,141,232,149,88,150,221,22,20,97]},"announce":[],"urlList":[]}}