{"title":"The Complete Warlock","uid":11348278,"size":18331008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5898eda7e332e065e454dfb21af1c65f6c81cfcc&amp;dn=The+Complete+Warlock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"queen69","files":1,"time":1414880468,"description":"Paperback: 56 pages (59 in torrent)\nPublisher: Balboa Game Company (1978)\nLanguage: English\nFormat: PDF\n\nDescription (Introduction taken from the book):\n\nA few years ago, the first copies of a new game called Dungeons and Dragons appeared on the market. Fantasy fans and gamers in general were enthralled at the possibilities. Most of them became hooked on the game, due to its unusual and imaginative nature. You could actually do unusual things: slay dragons, rescue the downtrodden, and just grab loot.\n\nWhen out group first started playing the game, our overall reaction was that it had great ideas, &quot;but maybe we should change the combat system, clarify the magic, and re-do the monsters&quot;. Warlock is not intended to replace D&amp;D, and, indeed, would not exist without that classic game. What we have tried to do is to present a way of expanding D&amp;D without the contradictions and loopholes inherent in the original rules and the various supplements. By putting together one set of rule changes and interpretations and playing by them for three years, we have developed something that works pretty well. We spent a considerable amount of time working out  solid combat system, a coherent magic system, and a more flexible way of handling monsters as monsters, rather than as men dressed up in gorilla suits. We have been (rightly) accused of making D&amp;D into a different game altogether, but we think it is an enjoyable one, and hope you do as well","torrent":{"xt":"urn:btih:5898eda7e332e065e454dfb21af1c65f6c81cfcc","amp;dn":"The+Complete+Warlock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5898eda7e332e065e454dfb21af1c65f6c81cfcc","infoHashBuffer":{"type":"Buffer","data":[88,152,237,167,227,50,224,101,228,84,223,178,26,241,198,95,108,129,207,204]},"announce":[],"urlList":[]}}