{"title":"The Philosophy of the Coen Brothers (Mark Conard)","uid":8503610,"size":2530661,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58c43e3ffb70a8154637a6420e089b340e589db2&amp;dn=The+Philosophy+of+the+Coen+Brothers+%28Mark+Conard%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ArielC","files":1,"time":1369366268,"description":"PDF\n304 pages\n\nMany critics agree that Joel and Ethan Coen are one of the most visionary and idiosyncratic filmmaking teams of the last three decades. Combining thoughtful eccentricity, wry humor, irony, and often brutal violence, the Coen brothers have crafted a style of filmmaking that pays tribute to classic American movie genres yet maintains a distinctly postmodern feel. Since arriving on the film scene, the Coens have amassed an impressive body of work that has garnered them critical acclaim and a devoted cult following. \n\nFrom Raising Arizona and Fargo to O Brother, Where Art Thou? and No Country for Old Men, the Coens have left an unmistakable imprint on Hollywood. The Philosophy of the Coen Brothers investigates philosophical themes in the works of these master filmmakers and also uses their movies as vehicles to explore fundamental concepts of philosophy. The contributing authors discuss concepts such as justice, the problem of interpretation, existential role-playing, the philosophy of comedy, the uncertainty principle, and the coldness of modernity. The Philosophy of the Coen Brothers is not just for die-hard Lebowski Fest attendees, but for anyone who enjoys big ideas on the big screen.","torrent":{"xt":"urn:btih:58c43e3ffb70a8154637a6420e089b340e589db2","amp;dn":"The+Philosophy+of+the+Coen+Brothers+%28Mark+Conard%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58c43e3ffb70a8154637a6420e089b340e589db2","infoHashBuffer":{"type":"Buffer","data":[88,196,62,63,251,112,168,21,70,55,166,66,14,8,155,52,14,88,157,178]},"announce":[],"urlList":[]}}