{"title":"Scanner Radio Pro v3.8.2 Final By bobiras2009","uid":7613750,"size":1470171,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:5bb7055246600f63e595d9efefca39116c56c622&amp;dn=Scanner+Radio+Pro+v3.8.2+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1347142072,"description":"For make Requests go here: https://forum.suprbay.org/showthread.php?tid=129845\n\nI will not upload requests that post in the comments in my torrents.           \n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nRequirements: Android 1.6 and up\nOverview: Listen to police and fire departments from around the world on your phone.\n\nListen to live audio from over 2,900 police and fire scanners, weather radios, and amateur radio repeaters from around the world (with more being added daily).\n\nFeatures:\n* Add scanners you listen to the most to your Favorites list for quick access.\n* View scanners that are located nearest you, sorted by distance, by clicking on &quot;Near Me&quot;\n* View the top 50 scanners that have the most listeners (updated every 5 minutes).\n* View list of scanners added most recently (new additions are being added all the time).\n* Browse the directory of scanner feeds by location or by genre (public safety, weather, railroad, etc).\n* Configure alerts to have the app notify you when lots of people are listening to a scanner (indicating that something big may be happening).\n* Add Scanner Radio widgets and/or shortcuts to your phone's home screen for quick access.\n* Add a &quot;Scanner Radio Favorite&quot; shortcut to your home screen to launch a scanner feed via an alarm clock app or automation app.\n\nIn addition to the above features, you also get the following features with this version of the app:\n\n* The ads are removed.\n* Allows you to specify what times of day you want to receive listener alerts.\n* Allows you to setup listener alerts for scanners located near you.\n* The play button at the top of the directory screens and on the widgets is functional.\n* Allows you to listen to archived audio (from the past 30 days) if you have a RadioReference.com Premium Subscription. Their premium subscription is $15 for 6 months, without it you will not be able to access their audio archives using the app.\n\nWhat's in this version:\nAdded a workaround for a problem where the volume control on the player screen didn't update properly after a screen orientation change on some phones.\nAdded a &quot;Listener threshold&quot; setting for use in specifying the number of listeners a scanner feed should have before a RadioReference.com alert notification is displayed.\nVersion 3.8:\nAdded support for RadioReference.com's feed provider-provided alerts (support for displaying them in the directory as well as receiving notifications for them).\n\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:5bb7055246600f63e595d9efefca39116c56c622","amp;dn":"Scanner+Radio+Pro+v3.8.2+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bb7055246600f63e595d9efefca39116c56c622","infoHashBuffer":{"type":"Buffer","data":[91,183,5,82,70,96,15,99,229,149,217,239,239,202,57,17,108,86,198,34]},"announce":[],"urlList":[]}}