{"title":"So You Want to Start a Brewery? -  The Lagunitas Story","uid":13167930,"size":4765552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c42b7f8a2a9b53d0602e57c260d1d15cf092ae9&amp;dn=So+You+Want+to+Start+a+Brewery%3F+-++The+Lagunitas+Story&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hheyyouguys","files":4,"time":1452216140,"description":"\nSo You Want to Start a Brewery?: The Lagunitas Story\r\n\r\nby Tony Magee\r\n\r\n\r\nIn 1993, Tony Magee, who had foundered at every job he'd ever had, decided to become the founder of a brewery. So You Want to Start a Brewery? is the thrilling first-person account of his gut-wrenching challenges and heart-warming successes. Based in Petaluma, California, the Lagunitas Brewing Company makes simple and flavorful craft beer that defies categorization. The same could be said for this book. \r\n\r\nEqual part memoir, narrative, and business story, with liberal dashes of pop culture and local color, this illuminating yet hilarious account of a one-of-a-kind made-in-America journey just happens to culminate with the success of one of the nation's most popular craft beer brands. In twenty years, Lagunitas has grown from a seat-of-the-pants one-man operation to be the fifth largest-and the fastest-growing-craft brewer in the United States. So You Want to Start a Brewery? is a look behind the curtain rather than a simple business story. \r\n\r\nIt's unglamorous and full of hilarious digressions, but it's never afraid to mess with the nuts and bolts. Devoted to details but never boring, this is a must-read for all who have considered starting their own business-or have sweated blood working to get one on its feet. \r\n\r\nTold in the vibrant voice of the man closest to the process-and with the most to lose-this illuminating volume should quench the thirst of anyone who has ever tried a Lagunitas beer. Tony Magee is the founder \r\n\r\n--------------------------------------------------------------\r\n--------------------------------------------------------------\r\n\r\n\r\nHope you enjoy this. And if you find any errors please \r\nemail me at  beermags (AT) gmail dot com \r\n\r\nCheck out my other Brewing Books, Zymurgy and BYO torrents\r\n                                                     \nhttp://thepiratebay.se/user/hheyyouguys\t(NOTE: If TPB keeps changing domains (ie... .org to .sx to .se), you will have to change it yourselves to see my other torrents)\t \r\n\r\n\r\n***************************************\r\n\t\t\t\r\nAlways looking for new brewing books digital or otherwise. If you have ones you want to share, use email above to contact me.\r\n\r\n***************************************","torrent":{"xt":"urn:btih:5c42b7f8a2a9b53d0602e57c260d1d15cf092ae9","amp;dn":"So+You+Want+to+Start+a+Brewery%3F+-++The+Lagunitas+Story","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c42b7f8a2a9b53d0602e57c260d1d15cf092ae9","infoHashBuffer":{"type":"Buffer","data":[92,66,183,248,162,169,181,61,6,2,229,124,38,13,29,21,207,9,42,233]},"announce":[],"urlList":[]}}