{"title":"Batman:  GCPD  Gotham City Police Department","uid":7829562,"size":38318353,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5c55cb4fede46e4edf3941b3afb42dc1d21cb765&amp;dn=Batman%3A++GCPD++Gotham+City+Police+Department&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1353017545,"description":"The Gotham City Police Department (GCPD) is a fictional police department servicing Gotham City, as depicted in comic books published by DC Comics, in particular those tied into the Batman books.\n\nActing as both ally and opponent of Batman (the superhero long-established in Gotham) the GCPD has long been steeped in corruption, with numerous officers, both high-and-low ranking, involved in bribery and even more serious offenses such as drug-trafficking and murder.\n\nThe strongest blow against police corruption came when an increasing amount of conspiracy charges against Commissioner Gillian B. Loeb forced him to resign his position, replaced by Peter Grogan. The Falcone crime family, which had had a stranglehold on Gotham's underground for generations, finally crumbled when a series of killings shook the structure of the mafia organization. After the death of Carmine Falcone, the mob lashed out in sloppy, retaliatory crimes, which, in combination with rising gang violence, severely crippled organized crime in Gotham City. Simultaneously, the ebbing presence of corrupt police officers allowed James Gordon to become the new commissioner, a man determined to eradicate crime wherever it existed.\n\nThe GCPD has had a long love-hate relationship with the city's vigilante known as Batman. Commissioner Gordon went along with him because Batman got the job done. His successor, Commissioner Michael Akins ordered the arrest of Batman and had the Bat-signal removed from the roof of Gotham Central. Corruption and rot within the police department also rose during Akins' tenure as Commissioner.\n\nAs of DC's One Year Later, James Gordon has been reinstated as Commissioner, along with Harvey Bullock. Harvey came back on disciplinary probation after helping expose a criminal drug ring. Relations with Batman, including the Bat-Signal, have been re-established. Other characters from Gotham Central have appeared in the recent Tales of the Unexpected miniseries, featuring Crispus Allen as the Spectre. Thus far, Detective Driver has appeared in a speaking role. It is unknown what has happened to Commissioner Akins, but it is implied that, following revelations of massive corruption within the department, there has been a drastic cleaning-of-house within the department.\n\nKate Kane referred to Akins as police commissioner in the weekly 52 series, which reveals the events of the missing year. A later issue, however, showed a brief snapshot of Commissioner Gordon's welcome back party. The circumstances of Akins's departure and Gordon's reinstatement have yet to be explained. Maggie Sawyer is still the commander of the MCU department, and has ended her relationship with former lover Toby Raines.\n\nThis torrent was created to honor a request.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and authors/artists/publishers,) please.\n\nNOTE2:  I realize this is redundant, but the other GCPD torrent was NOT seeding.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:5c55cb4fede46e4edf3941b3afb42dc1d21cb765","amp;dn":"Batman%3A++GCPD++Gotham+City+Police+Department","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c55cb4fede46e4edf3941b3afb42dc1d21cb765","infoHashBuffer":{"type":"Buffer","data":[92,85,203,79,237,228,110,78,223,57,65,179,175,180,45,193,210,28,183,101]},"announce":[],"urlList":[]}}