{"title":"Bulawayo Jazz~Zimbabwe 1950 '51 '52 (SWP) [FLAC] {MKOP}","uid":7724853,"size":361305691,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5c8666291483eb86bf0cc1893cf40f9329e3ab74&amp;dn=Bulawayo+Jazz%7EZimbabwe+1950+%2751+%2752+%28SWP%29+%5BFLAC%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mudmashers","files":24,"time":1350180785,"description":"Bulawayo Jazz~Southern Rhodesia (Zimbabwe) 1950, '51, '52 (SWP) [FLAC] {MKOP}\n\nBulawayo jazz is a style of afro-jazz that emerged from the city of Bulawayo, Zimbabwe in the early 1950s. The lead is assured by the alto sax in ensembles including tenor sax, trumpet, guitars, double bass, tubas and trombones. Bulawayo jazz has been brought in the occidental world by Hugh Tracey, who recorded the material of Bulawayo Jazz: Southern Rhodesia, Zimbawbe 1950, '51, '52 in the early 1950s. Along with Gypsy Jazz, it's the sole jazz scene existing outside of the USA in the late-1940s/early-1950s.\n\n''This is an incredible album, not only for the music, but also for the work that went into recording it, to finding it, restoring it, and bringing it to us today, a small time capsule from a world most of use know little about. For more than two decades beginning in the 1930's, Rhodesian Hugh Tracey traveled across sub-Saharan Africa recording local musicians in local settings, capturing on aluminum disc and on tape thousands of hours of material from artists the world never knew. For years those tapes have been on deposit at a South African university, where Zambian born musician Michael Baird set out to listen to, sort, annotate, and compile for cd a collection of some of Tracey's best recordings, now numbering 21 volumes. Many of Tracey's recordings have been previously released on LPs, but apparently this is the first time this music has ever been issued. Featuring jazz bands from Rhodesia, this CD is a monumental addition to the history of jazz recordings not only in Africa but in the world for allowing us to listen in on a style of jazz unlike any that was being played anywhere in the 1950's. Here we have bands still playing jazz with tubas and banjos, but far from being preservation outfits these musicians are living in the present, making fresh music out of local traditions, laying down the roots that will bring forth the flowering of modern South African jazz. This disc deserves the attention of jazz fans everywhere.'' \n\n''Swing your heart out!''\n\t\t\n01. The Cold Storage Band - Ndakurakura Mai\n02. The Cold Storage Band - Mafambira E Wai\n03. The Los Angeles Orchestra - Hamba Hamba Madala\n04. The Chaminuka Band - Chaminuka's Magic Jive\n05. The Cold Storage Band - Skokiaan\n06. Dick Ncube Trio - N'ga Ngile Ntombi Yami\n07. The Cold Storage Band - Ududuzela\n08. The Cold Storage Band - Ndipe Dza Kwangu\n09. The Cold Storage Band - Misiwezi\n10. The Los Angeles Orchestra - Icharlie Jive\n11. The Los Angeles Orchestra - Ungityela Manga\n12. The Cold Storage Band - Rhumba\n13. The Cold Storage Band - Hondo Chivutsi\n14. The Dark Brownies - Hlabelani Ke Bafana\n15. The Cold Storage Band - Klara Tsotsi Umba\n16. The Cold Storage Band - Tsuku Kunema\n17. The Cold Storage Band - Siqonda Emaquswini\n18. The Umtali Chipisa Band - Zuwa Rashona (Ilonga Lashona)\n19. The Umtali Chipisa Band - Kuenda Namwendo\n20. The Umtali Chipisa Band - Machipisa Watere Muchikunda\n21. The Chaminuka Band - Johnny's Getting Married\n22. The Chaminuka Band - I May Jump\n23. The Chaminuka Band - Tipemba Fodya\n\nMusic Keep On Playing*Thank You Seeders","torrent":{"xt":"urn:btih:5c8666291483eb86bf0cc1893cf40f9329e3ab74","amp;dn":"Bulawayo+Jazz%7EZimbabwe+1950+%2751+%2752+%28SWP%29+%5BFLAC%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c8666291483eb86bf0cc1893cf40f9329e3ab74","infoHashBuffer":{"type":"Buffer","data":[92,134,102,41,20,131,235,134,191,12,193,137,60,244,15,147,41,227,171,116]},"announce":[],"urlList":[]}}