{"title":"Rosemary's Baby (1968) Mia Farrow Eng multisubs","uid":6417969,"size":1690547737,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5ca7c3fd1e40aa8285363be960dbc55893b6c6c6&amp;dn=Rosemary%5C%27s+Baby+%281968%29+Mia+Farrow+Eng+multisubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"johnefp","files":-1,"time":1306226714,"description":"SUBS\n\nDutch, English, German, Arabic, Bulgarian, Czech, Icelandic, Hungarian, Norwegisn, Polish, Romanian, Finnish, Swedish, Turkish, \n\n\nIn Roman Polanski's first American film, adapted from Ira Levin's horror bestseller, a young wife comes to believe that her offspring is not of this world. Waifish Rosemary Woodhouse (Mia Farrow) and her struggling actor husband, Guy (John Cassavetes), move into the Bramford, an old New York City apartment building with an ominous reputation and only elderly residents. Neighbors Roman and Minnie Castevet (Sidney Blackmer and Ruth Gordon) soon come nosing around to welcome the Woodhouses to the building; despite Rosemary's reservations about their eccentricity and the weird noises that she keeps hearing, Guy starts spending time with the Castevets. Shortly after Guy lands a plum Broadway role, Minnie starts showing up with homemade chocolate mousse for Rosemary. When Rosemary becomes pregnant after a mousse-provoked nightmare of being raped by a beast, the Castevets take a special interest in her welfare. As the sickened Rosemary becomes increasingly isolated, she begins to suspect that the Castevets' circle is not what it seems. The diabolical truth is revealed only after Rosemary gives birth, and the baby is taken away from her. Polanski's camerawork and Richard Sylbert's production design transform the realistic setting (shot on-location in Manhattan's Dakota apartment building) into a sinister projection of Rosemary's fears, chillingly locating supernatural horror in the familiar by leaving the most grotesque frights to the viewer's imagination. This apocalyptic yet darkly comic paranoia about the hallowed institution of childbirth touched a nerve with late-'60s audiences feeling uneasy about traditional norms. Produced by B-horror maestro William Castle, Rosemary's Baby became a critically praised hit, winning Gordon an Oscar for Best Supporting Actress. Inspiring a wave of satanic horror from THE EXORCIST (1973) to The Omen (1976), Rosemary's Baby helped usher in the genre's modern era by combining a supernatural story with Alfred Hitchcock's propensity for finding normality horrific.\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 02:11:06\nMovie complete : Yes\n\n[Video]\nResolution : 672x368  1.83:1\nCodec : DivX (4 / 5 / 6)\nFPS : 25,00\nBitRate : 1366 Kbps\nQuality Factor : 0,23 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps","torrent":{"xt":"urn:btih:5ca7c3fd1e40aa8285363be960dbc55893b6c6c6","amp;dn":"Rosemary%5C%27s+Baby+%281968%29+Mia+Farrow+Eng+multisubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ca7c3fd1e40aa8285363be960dbc55893b6c6c6","infoHashBuffer":{"type":"Buffer","data":[92,167,195,253,30,64,170,130,133,54,59,233,96,219,197,88,147,182,198,198]},"announce":[],"urlList":[]}}