{"title":"1988 Handbuch des Geographieunterrichts. Bd. 10.1. Physische Geo","uid":5357367,"size":38676888,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d484cac783f4bfcf8929013b748e11111250d0c&amp;dn=1988+Handbuch+des+Geographieunterrichts.+Bd.+10.1.+Physische+Geo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zelmut","files":1,"time":1265987141,"description":"1988 Nolzen et al. - Handbuch des Geographieunterrichts. Bd. 10, Teil I. Physische Geofaktoren\n\nDieses Handbuch wurde fuer alle Geographielehrer der Sekundarstufen I und II geschaffen sowie fÃƒÆ’Ã‚Â¼r alle Geographen, die in der Aus- und Fortbildung tÃƒÆ’Ã‚Â¤tig sind. Ziel des Werkes ist es, eine fachwissenschaftlich fundierte, kompetente, umfassende und auf die Unterrichtspraxis zugeschnittene Handreichung anzubieten. Als breit angelegtes Grundlagenwerk erfÃƒÆ’Ã‚Â¼llt es mehrere Funktionen:\n# eine Entlastungsfunktion, indem die FÃƒÆ’Ã‚Â¼lle der Einzelpublikationen auf ihre unterrichtspraktische Bedeutung gefiltert und dann dargestellt wird\n# eine Fundierungsfunktion, die den Unterrichtenden in einer nach Breite und Tiefe ausgewogenen Darstellung der jeweiligen Sachverhalte die SouverÃƒÆ’Ã‚Â¤nitÃƒÆ’Ã‚Â¤t und Sicherheit gegenÃƒÆ’Ã‚Â¼ber dem Stoff vermittelt\n# eine Fortbildungsfunktion als unabdingbare Voraussetzung fÃƒÆ’Ã‚Â¼r einen aktuellen und kompetenten Geographieunterricht\n# eine Transformationsfunktion mit einer auf die Umsetzung im Unterricht abzielenden Darstellung der wissenschaftlichen Vorgaben\n# eine Stabilisierungsfunktion mit einer angesichts der verwirrenden FÃƒÆ’Ã‚Â¼lle curricularer Elemente inhaltlichen BeschrÃƒÆ’Ã‚Â¤nkung auf einen fÃƒÆ’Ã‚Â¼r den Unterricht relevanten Kernbereich von Sachverhalten. Diese anspruchsvolle Konzeption trÃƒÆ’Ã‚Â¤gt sowohl dem fachwissenschaftlichen Informations- und FortbildungsbedÃƒÆ’Ã‚Â¼rfnis von GeographielehrkrÃƒÆ’Ã‚Â¤ften Rechnung als auch deren Interesse an konkreten, unterrichtspraktischen Handreichungen. In dieser Doppelfunktion hat sich das Handbuch schon als unentbehrlicher Ratgeber und umfassendes Standardwerk der Schulgeographie erwiesen. \n\nEingescannte Version des Buches von 1988. Keine farbigen Abbildungen, komplett grau-schwarz-weiÃƒÆ’Ã…Â¸. 280 Seiten.\n\nBitte hinterlasst ne kleine RÃƒÆ’Ã‚Â¼ckmeldung und kommentiert den Torrent. Und natÃƒÆ’Ã‚Â¼rlich nicht vergessen: SEEDEN!\n-&gt; ansonsten kann ich keine anderen Torrents hochladen, weil meine Bandbreite dann mit alten Torrents, die von anderen nicht weiter geseedet werden, &quot;verstopft&quot; ist..!","torrent":{"xt":"urn:btih:5d484cac783f4bfcf8929013b748e11111250d0c","amp;dn":"1988+Handbuch+des+Geographieunterrichts.+Bd.+10.1.+Physische+Geo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d484cac783f4bfcf8929013b748e11111250d0c","infoHashBuffer":{"type":"Buffer","data":[93,72,76,172,120,63,75,252,248,146,144,19,183,72,225,17,17,37,13,12]},"announce":[],"urlList":[]}}