{"title":"Dune 2000 Online Work!! 2009","uid":4783672,"size":70180047,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5d607a6244d2978a05f30969d19360e066fccc64&amp;dn=Dune+2000+Online+Work%21%21+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Filglut","files":8,"time":1237476533,"description":"This Dune2000 work an Windows Xp 100% ! Vista no tested :/ &amp; Multiplayer online work 100%\n\nGameplay\n\nThe player takes control of one of the three Houses and must fight for control of the spice melange on the planet Arrakis, or Dune. The player harvests spice for &quot;solaris,&quot; the in-game currency, and uses the solaris to make units to supply his forces. The game uses a similar engine as Command and Conquer: Red Alert; however, unlike Dune II, the player can control more than one unit at a time.\nIn-game screenshot\n\nLike most real-time strategy games, the game map initially starts with a fog of war, better known as &quot;shroud&quot;, covering the entire map, with an exception to your current units' line of sight. As the units explore the map, the darkness is removed for the duration of the game.\n\nLike Dune II, the player may construct concrete before placing buildings. In Dune II, all buildings would deteriorate regardless, but the concrete foundations slowed the process. However, in Dune 2000, the buildings do not deteriorate over time.\n\nAlthough each house has many common units, such as infantry, Wind Traps, and Mobile Construction Vehicles, each House also has its own set of units, such as the Atreides Sonic Tank, the Ordos Deviator and the Harkonnen Devastator. Houses Harkonnen and Atreides share the Trike, while House Ordos has an upgraded version, the Raider. Like many games of the Westwood franchise, a player can gain access to other Houses' special units by capturing an enemy building and manufacturing the desired units. House Ordos can obtain the Missile Tank by ordering it from the Starport when it would otherwise be inaccessible. After patch 1.06, the Harkonnens can eventually train the Sardaukar, which are soldier-fanatics loyal to the Corrino Emperor.","torrent":{"xt":"urn:btih:5d607a6244d2978a05f30969d19360e066fccc64","amp;dn":"Dune+2000+Online+Work%21%21+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d607a6244d2978a05f30969d19360e066fccc64","infoHashBuffer":{"type":"Buffer","data":[93,96,122,98,68,210,151,138,5,243,9,105,209,147,96,224,102,252,204,100]},"announce":[],"urlList":[]}}