{"title":"Texe Marrs - Rothschild's Choice &amp; The Eagle Has Landed","uid":8503608,"size":1514943106,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5da9c104bd4bf3b368f3293e4cf145b98d02fd09&amp;dn=Texe+Marrs+-+Rothschild%27s+Choice+%26amp%3B+The+Eagle+Has+Landed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mikem777","files":8,"time":1369366137,"description":"Texe Marrs - Rothschild's Choice &amp; The Eagle Has Landed\n\n\nThe Eagle Has Landed - Magic, Alchemy, and the Illuminati Conquest of Outer Space\n\nTexe Marrs, bestselling author and researcher is a retired career U.S. Air Force officer, who has taught at the University of Texas at Austin and for two other universities.\n\nThe Eagle Has Landed! has a staggering two hours of powerful documentation, investigative film footage, and persuasive scenes revealing the Illuminati magic, alchemy, and Masonic ritual of NASAs U.S. space program. You will be as shocked to realize how so many minds are being programmed through the Grand Theater of master hypnotists and Illuminist mind controllers.\n\n\nRothschild's Choice: Barack Obama and the Hidden Cabal Behind the Plot to Murder America\n\nTexe Marrs, bestselling author and researcher is a retired career U.S. Air Force officer, who has taught at the University of Texas at Austin and for two other universities.\n\n&quot;The man Rothschild chooses that man will become President of the United States,&quot; Texe Marrs was told by an insider. So, who was Rothschild's Choice in 2008? The answer is obvious: Barack Hussein Obama!\n\nThe fourth Baron de Rothschild, Lord Jacob Rothschild of Great Britain, has been called the 21st Century's &quot;King of Israel.&quot; He and other Rothschilds preside over the planet's greatest banking cartel, and Wall Street firms Goldman Sachs, Morgan Stanley, Citibank, and others bow to Rothschild dictates. Politicians in world capitals, Washington, D.C., London, Paris, and Tokyo grovel before their awesome power.\n\nRothschild's Choice documents the astonishing rise of a young, half blood &quot;Prince&quot; of Jerusalem, a Communist adept named Barack Obama who won Rothschilds' favor and was rewarded for his slavish devotion to their sinister Agenda.\n\nHere are the revelations that dissolve the mystery of Obama's meteoric, virtually unheralded rise to global prominence and his elevation to the highest seat of superpower government the White House.\n\n\ntags: illuminati, magic, alchmemy, NASA, ritual, America, Obama, Rothschild, nwo","torrent":{"xt":"urn:btih:5da9c104bd4bf3b368f3293e4cf145b98d02fd09","amp;dn":"Texe+Marrs+-+Rothschild%27s+Choice+%26amp%3B+The+Eagle+Has+Landed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5da9c104bd4bf3b368f3293e4cf145b98d02fd09","infoHashBuffer":{"type":"Buffer","data":[93,169,193,4,189,75,243,179,104,243,41,62,76,241,69,185,141,2,253,9]},"announce":[],"urlList":[]}}