{"title":"Planet Earth: Great Plains 1080i.DivX.AC3.mkv","uid":3673393,"size":2434105579,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:5e3e0a737c8ecab21da3c106b921c50e2f9cae46&amp;dn=Planet+Earth%3A+Great+Plains+1080i.DivX.AC3.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bell0q","files":1,"time":1177571304,"description":"Planet Earth: Great Plains\nVideo: MKV, 3viX 4.5.1 (DivX), 1080i HD\nResolution: 1920x1080 (1.77:1)\nFPS: 29.97 fps, 6181kbps\nAudio: AC3 5.1+LFE, 48kHz, 384kbps\nBitrate: 6.41Mbps\nDuration: 49:24\nSource: HDTV, Discovery HD Theater\n\nThe vast open wildernesses of African savannah, Asian steppe, Arctic tundra and North American prairie are the great plains of the planet.\n\nTogether they cover more than a quarter of the land on Earth and one living thing is at their heart ? grass. This humble plant feeds the greatest gatherings of wildlife found anywhere on Earth.\n\nThe most abundant bird in the world ? red-billed quelea ? swarm across the African savannah devouring grass seeds; while every year herds of wildebeest mass in East Africa in search of new grass; and on the Arctic tundra caribou migrate for 2,000 miles on a quest for good grazing.\n\nAfter filming for three years, Planet Earth finally captures the most mysterious herd of all ? the shy Mongolian gazelle.\n\nIt&amp;#039;s thought that there are two million on this remote corner of Asia, but no one really knows. And only a handful of people have witnessed their annual migration.\n\nThe highest living mammals exist 6,000 metres above sea level on the highest grasslands in the world ? the Tibetan Plateau.\n\nAlthough the plateau is frozen and parched, wild yak and ass and a ground dwelling relative of the rabbit ? the pika ? inhabit these spartan plains.\n\nThe elusive and bizarre looking Tibetan fox is captured on film for the first time here as it hunts the pika.\n\nSoaked in monsoon rains and bathed in tropical sun, the tallest grassland plains of Northern India hide a diverse range of animals from elephants and rhino, to the smallest of all wild pigs ? the rare pygmy hog.\n\nLike the Indian plains, the tropical savannahs of Africa grow lush in the wet season, but during the dry season they can become a dust bowl.\n\nIn Botswana, massive herds of buffalo and elephant trek hundreds of miles in search of water and new grass.\n\nOver six weeks, Planet Earth follows a pride of 30 lions ? one of the largest in Africa ? as they attempt to hunt elephants around one of the few remaining waterholes.\n\nNight after night, and driven by hunger, the lions size up different elephants. Using the latest night vision equipment, the crew film the chaotic battles that ensue at close quarters until, finally, the pride pursue and overwhelm a thirsty adolescent elephant.","torrent":{"xt":"urn:btih:5e3e0a737c8ecab21da3c106b921c50e2f9cae46","amp;dn":"Planet+Earth%3A+Great+Plains+1080i.DivX.AC3.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e3e0a737c8ecab21da3c106b921c50e2f9cae46","infoHashBuffer":{"type":"Buffer","data":[94,62,10,115,124,142,202,178,29,163,193,6,185,33,197,14,47,156,174,70]},"announce":[],"urlList":[]}}