{"title":"Neil Young &amp; Crazy Horse - Zuma (1975) 2014 24-192","uid":11762743,"size":1355683317,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5ecacac57004d631e2a1e8333480ab7f78d08724&amp;dn=Neil+Young+%26amp%3B+Crazy+Horse+-+Zuma+%281975%29+2014+24-192&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"sidmal","files":12,"time":1426629889,"description":"Neil Young &amp; Crazy Horse - Zuma (1975/2014)\n FLAC (tracks) 24 bit/192 kHz | Time - 36:32 minutes | 1,33 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Zuma is the seventh studio album by Canadian musician Neil Young, released on Reprise Records in 1975. Co-credited to Crazy Horse, it includes &quot;Cortez the Killer,&quot; one of Young's best-known songs. It peaked at #25 on the Billboard 200, and has been certified a gold record by the RIAA.\n\n\n Having apparently exorcised his demons by releasing the cathartic Tonight's the Night, Neil Young returned to his commercial strengths with Zuma (named after Zuma Beach in Los Angeles, where he now owned a house). Seven of the album's nine songs were recorded with the reunited Crazy Horse, in which rhythm guitarist Frank Sampedro had replaced the late Danny Whitten, but there were also nods to other popular Young styles in &quot;Pardon My Heart,&quot; an acoustic song that would have fit on Harvest, his most popular album, and &quot;Through My Sails,&quot; retrieved from one of Crosby, Stills, Nash &amp; Young's abortive recording sessions. Young had abandoned the ragged, first-take approach of his previous three albums, but Crazy Horse would never be a polished act, and the music had a lively sound well-suited to the songs, which were some of the most melodic, pop-oriented tunes Young had crafted in years, though they were played with an electric-guitar-drenched rock intensity. The overall theme concerned romantic conflict, with lyrics that lamented lost love and sometimes longed for a return (&quot;Pardon My Heart&quot; even found Young singing, &quot;I don't believe this song&quot;), though the overall conclusion, notably in such catchy songs as &quot;Don't Cry No Tears&quot; and &quot;Lookin' for a Love,&quot; was to move on to the next relationship. But the album's standout track (apparently the only holdover from an early intention to present songs with historical subjects) was the seven-and-a-half-minute epic &quot;Cortez the Killer,&quot; a commentary on the Spanish conqueror of Latin America that served as a platform for Young's most extensive guitar soloing since his work on Everybody Knows This Is Nowhere.  \n\n\nTracklist:\n\n 01 - Don't Cry No Tears\n 02 - Danger Bird\n 03 - Pardon My Heart\n 04 - Lookin' For A Love\n 05 - Barstool Blues\n 06 - Stupid Girl\n 07 - Drive Back\n 08 - Cortez The Killer\n 09 - Through My Sails\n\n 2014 Remaster","torrent":{"xt":"urn:btih:5ecacac57004d631e2a1e8333480ab7f78d08724","amp;dn":"Neil+Young+%26amp%3B+Crazy+Horse+-+Zuma+%281975%29+2014+24-192","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ecacac57004d631e2a1e8333480ab7f78d08724","infoHashBuffer":{"type":"Buffer","data":[94,202,202,197,112,4,214,49,226,161,232,51,52,128,171,127,120,208,135,36]},"announce":[],"urlList":[]}}