{"title":"Religion and Law in Classical and Christian Rome _F1_","uid":6495802,"size":4202475,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f3555879636e636b4b84a79d65572f281ae085d&amp;dn=Religion+and+Law+in+Classical+and+Christian+Rome+_F1_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309064480,"description":"Clifford Ando, &quot;Religion and Law in Classical and Christian Rome (Potsdamer Altertumswissenschaftliche Beitrage (PAwB))&quot;\nPublisher: Franz Steiner Verlag | 2006 | ISBN: 3515088547 | PDF | 176 pages | 4 MB\n\nLaw is a particularly fruitful means by which to investigate the relationship between religion and state. It is the mechanism by which the Roman state and its European successors have regulated religion, in the twin actions of constraining religious institutions to particular social spaces and of releasing control over such spaces to those orders. This volume analyses the relationship from the late Republic to the final codification of Roman law in JustinianAes Constantinople. Contents John Scheid: Oral tradition and written tradition in the formation of sacred law in Rome Jorg Rupke: Religion in the lex Ursonensis James B. Rives: Magic, religion, and law: The Case of the Lex Cornelia de sicariis et veneficiis Elizabeth DePalma Digeser: Religion, Law and the Roman Polity: The era of the Great Persecution Andrew S. Jacobs: oPapinian Commands One Thing, Our Paul Anothero: Roman Christians and Jewish Law in the Collatio Legum Mosaicarum et Romanarum Dorothea Baudy: Prohibitions of religion in antiquity: Setting the course of EuropeAes religious history Karl Leo Noethlichs: Revolution from the top? oOrthodoxyo and the persecution of heretics in imperial legislation from Constantine to Justinian Clifford Ando: Religion and ius publicum Bibliography - Abstracts - Index locorum - Index of subjects, places and persons ","torrent":{"xt":"urn:btih:5f3555879636e636b4b84a79d65572f281ae085d","amp;dn":"Religion+and+Law+in+Classical+and+Christian+Rome+_F1_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f3555879636e636b4b84a79d65572f281ae085d","infoHashBuffer":{"type":"Buffer","data":[95,53,85,135,150,54,230,54,180,184,74,121,214,85,114,242,129,174,8,93]},"announce":[],"urlList":[]}}