{"title":"Super Smash Bros. (N64) ROM","uid":7786041,"size":12585210,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:5fc2c2b961e86a940312b54630330454fbd95512&amp;dn=Super+Smash+Bros.+%28N64%29+ROM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tizmaster","files":1,"time":1351894813,"description":"Super Smash Bros. was introduced in 1999 for the Nintendo 64. It was released worldwide after selling over a million copies in Japan.[1] It featured eight characters from the start, with four unlockable characters, all of them created by Nintendo or one of its second-party developers.\nUp to four people can play in multiplayer (Versus) mode, with the specific rules of each match being predetermined by the players. There are two different types that can be chosen: Time, where the person with the most KOs at the end of the set time wins; and stock, where each person has a set amount of lives, and when they are gone, the player is eliminated.\nThis game's one-player mode included one adventure mode that always followed the same series of opponents although the player could change the difficulty. Other single player modes exist such as Training and several mini-games, including &quot;Break the Targets&quot; and &quot;Board the Platforms&quot;. All of these were included in the sequel, with the exception of &quot;Board the Platforms&quot;.\nThere are nine playable stages in Versus mode, eight based on each of the starting characters (such as Princess Peach's Castle for Mario, Zebes for Samus, and Sector Z for Fox) and the unlockable Mushroom Kingdom, based around motifs from the original Super Mario Bros. (from which the English-language name of the Smash series comes), even containing original sprites and the original version of the Overworld theme from that game.\n\n-from http://en.wikipedia.org/wiki/Super_Smash_Bros._(series)#Super_Smash_Bros._.281999.29","torrent":{"xt":"urn:btih:5fc2c2b961e86a940312b54630330454fbd95512","amp;dn":"Super+Smash+Bros.+%28N64%29+ROM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc2c2b961e86a940312b54630330454fbd95512","infoHashBuffer":{"type":"Buffer","data":[95,194,194,185,97,232,106,148,3,18,181,70,48,51,4,84,251,217,85,18]},"announce":[],"urlList":[]}}