{"title":"Cadaver - In Pains","uid":7175990,"size":331149174,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5fc4dfd540a7afa64a5343899857af48fb1e3ddf&amp;dn=Cadaver+-+In+Pains&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Trashthrasher","files":14,"time":1334116326,"description":"CADAVER - ...In Pains CD\n1992 Relativity / Earache  88561-1144-2\n\n01 - Bypassed\n02 - Mr Tumour's Misery\n03 - Into The Outside\n04 - Blurred Visions\n05 - Runaway Brain\n06 - Inner Persecution\n07 - In Distortion\n08 - The Misanthrope\n09 - Ins-Through-Mental\n10 - During The End\n\n\nCD -&gt; EAC (Offset Configured) -&gt; FLAC (with Log and Cue)\nCover scan included.\n\nMorbid...it's not just for describing Angels anymore, it can also be applied to Cadaver's In Pains. And that's about the best one-word description I can give on this album: MORBID. Not as overtly suicidal as Bethlehem or Silencer, but you really get the feeling that this is the product of abnormal minds that is reflected in the bizarre structures, warped riffing and odd uses of cellos and violins.\n\nThe general style is progressive death metal, but this is not the linear form of Death's later work or the jazzy experiments of Atheist and Cynic. Even though I love all those bands, there was something keeping their feet on the ground, something that kept their music from being dangerous. Cadaver is really unpredictable and sick. The guitar riffs could best be compared to maybe Coroner, but much choppier with masses of unorthodox chording thrown in. I would agree with the last review that there is a good bit of Voivod influence in here.\n\nThe drumming is very skilled, quite jazzy with lots of fills and odd timings. The dry, high ended production on this highlights the cymbals and snare, which give it kind of a jazzy black metal feel. And the vocals are more of a rasp, rather than a growl, further adding to the black metal feel. By the way...what the hell is going on with the lyrics? Some sort of strange psychological study?\n\nOdd time changes, bizarre chords and a few creepy melodies certainly add a degree of individuality to this, but then they have to throw in cellos and violins. Most of the time, that means that the result is going to suck balls, but these are done more like the violin on At The Gate's first album, ie: effectively! I would say that they're even better performed here, as they really fit in with the music, and are rather used to emphasize certain passages rather than act as the melody.\n\nThis album certainly does get better with repeated listens, but that doesn't mean you ever really get used to it. In Pains is one of the most unique albums in death metal, and one that was never big enough to warrant a slew of copycats, and even Cadaver themselves never made anything like this before or after.\n- Metal Archives","torrent":{"xt":"urn:btih:5fc4dfd540a7afa64a5343899857af48fb1e3ddf","amp;dn":"Cadaver+-+In+Pains","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc4dfd540a7afa64a5343899857af48fb1e3ddf","infoHashBuffer":{"type":"Buffer","data":[95,196,223,213,64,167,175,166,74,83,67,137,152,87,175,72,251,30,61,223]},"announce":[],"urlList":[]}}