{"title":"A Richer Tradition - Blues+String Band 1923-1937 (4CD-JSP)","uid":7313464,"size":738583848,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5fc87d96099a25c16422b4a104ab78cb8769ebef&amp;dn=A+Richer+Tradition+-+Blues%2BString+Band+1923-1937+%284CD-JSP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"mudmashers","files":108,"time":1338412578,"description":"A Richer Tradition: Country Blues and String Band Music 1923-1942 [JSP] (4CD320kb)\n\nReview by Steve Leggett\nThe 1920s is perhaps the only time when we hear what America was actually singing of its own accord, and since record companies at the time had little idea what might actually sell, they went out and recorded seemingly anyone and everyone who had a tune in their head. This, coupled with an increasingly awareness of the black record buying market, meant a time of unparalleled diversity in the kind of product labels put out there. By the mid-'30s, this amazing window began to close and labels, starting a process that still plays out nearly a hundred years later, started to dictate rather than reflect what America would be singing. That initial diversity, though, is well apparent on this four-disc, 100-track set of country-blues pieces and maverick black string band releases recorded between 1923 and 1942. \n\nThere are all sorts of blues forms here, from Richard Rabbit Brown's harrowing and stark &quot;James Alley Blues&quot; (which was completely unlike anything else in his repertoire) from 1927, Big Boy Cleveland's cane fife workout &quot;Quill Blues,&quot; also from 1927, the Johnson Boys' &quot;Violin Blues&quot; (that's crack guitarist Lonnie Johnson playing the fiddle and singing) from 1928, Long &quot;Cleve&quot; Reed and Harvey Hull's rare &quot;Original Stack O'Lee Blues,&quot; released by Black Patti Records in 1927, Mattie Delaney's harrowing &quot;Tallahatchie River Blues,&quot; apparently the only record she ever released, from 1930, and Bogus Ben Covington's version of the odd &quot;I Heard the Voice of a Pork Chop,&quot; which had been originally tracked by Big Jim Jackson and was itself a parody of the hymn &quot;I Heard the Voice of Jesus Say.&quot; Also definitely worth pointing out here are two absolute gems from guitarist and singer George Carter, &quot;Rising River Blues&quot; and &quot;Weeping Willow Blues,&quot; both from 1929 and both full of Carter's lyrical singing and understated but powerfully elegant slide guitar work. \n\nEconomics in America as the '30s opened meant that record labels could no longer afford to record anything and everything, and the concept of market planning began to rear its opportune head. It just made better business sense to target an audience and then force-feed that audience the records created for it rather than seek out homegrown musicians in the hopes that they had a song or two that might hit home. America, from that moment on, sang what was presented to it. Thank God for sets like this.","torrent":{"xt":"urn:btih:5fc87d96099a25c16422b4a104ab78cb8769ebef","amp;dn":"A+Richer+Tradition+-+Blues%2BString+Band+1923-1937+%284CD-JSP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc87d96099a25c16422b4a104ab78cb8769ebef","infoHashBuffer":{"type":"Buffer","data":[95,200,125,150,9,154,37,193,100,34,180,161,4,171,120,203,135,105,235,239]},"announce":[],"urlList":[]}}