{"title":"Peter Joback - Personliga val 1997","uid":6904887,"size":243844723,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6076edd50f68a00f708e9714db39eda8b5ff3e6a&amp;dn=Peter+Joback+-+Personliga+val+1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"barber9","files":-1,"time":1324549635,"description":"Already when Kristina frÃƒÂ¥n DuvemÃƒÂ¥la was released on CD I said to Sony Music that I wanted to do my own musicals album. Partly because its seldom done, partly because songs from musicals are grateful to sing and hold narrative lyrics. I wasnt really interested in doing hit songs like Cabaret and Anthem, but in finding songs that could be performed with a more personal touch, to be more my own. Neither did I want to work with a traditional musicals producer but instead with someone with a focus on pop music. Johan Ekelund. Together with him and Hans Marklund I chose thirteen songs that I really like and that arent too associated with other artists - at least not for the Swedish audience.\nIt felt important to do the songs in Swedish. Every song is a personal choice, just like the lyrics writers that I worked with: Ture RangstrÃƒÂ¶m, BjÃƒÂ¶rn Ulvaeus, Bosse Cargren, Calle Norlen and Hans Marklund.\nI want to touch people, make people feel, but to be able to do that you yourself have to believe in the songs you sing. And thats why the lyrics are so important to me. I have scanned every word over and over again. Almost all translations are newly made for this album.\nIm especially proud to be able to present the first song from the musical Chess in a Swedish translation: Pity the child/Vem ser ett barn that BjÃƒÂ¶rn Ulvaeus translated solely for my album.\nVariation is important. The goal was that no track should resemble any of the other tracks. To make this possible we have used a mix of musicians coming from every corner of Sweden, from symphony orchestras via Mikael RÃƒÂ¥berg Big Band to EsbjÃƒÂ¶rn Svensson Trio. All together over 80 musicians contribute to the album.\nThe album got a warm welcome by both press and audience. I was awarded with a Grammy nomination for Artist of the year. (peterjoback.com)\n\n- - -\n\nPeter JÃƒÂ¶back - Personliga val 1997\n(Bromma Columbia)\n\n 1. Nu eller aldrig. \n 2. Led hans vÃƒÂ¤g. \n 3. VarfÃƒÂ¶r Gud? \n 4. En sÃƒÂ¥ng om oss. \n 5. Spindelkvinnans kyss. \n 6. Det mÃƒÂ¥ste finnas bÃƒÂ¤ttre liv ÃƒÂ¤n det hÃƒÂ¤r, PÃƒÂ¥ vÃƒÂ¤g. \n 7. Ut mot ett hav. \n 8. Jag vill inte ha nÃƒÂ¥t regn pÃƒÂ¥ min parad. \n 9. NÃƒÂ¥t fint som pÃƒÂ¥gÃƒÂ¥r, Varje dag som gÃƒÂ¥r. \n10. Vem ser ett barn. \n11. Ett hÃƒÂ¶rn av himlen\n","torrent":{"xt":"urn:btih:6076edd50f68a00f708e9714db39eda8b5ff3e6a","amp;dn":"Peter+Joback+-+Personliga+val+1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6076edd50f68a00f708e9714db39eda8b5ff3e6a","infoHashBuffer":{"type":"Buffer","data":[96,118,237,213,15,104,160,15,112,142,151,20,219,57,237,168,181,255,62,106]},"announce":[],"urlList":[]}}