{"title":"Jim Hensons Muppets The Tale of the Bunny Picnic","uid":9611833,"size":7601372682,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:60f3ca14df00bf0d4c1ce8151d9d2927efa3bf81&amp;dn=Jim+Hensons+Muppets+The+Tale+of+the+Bunny+Picnic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":215,"time":1392334113,"description":"The Tale of the Bunny Picnic, starring Jim Henson's Muppets, first aired on HBO on March 26, 1986 in the U.S, and three days later on the BBC in the UK.\n\nCarrying an anti-bullying message, the special features songs by Fraggle Rock's Philip Balsam and Dennis Lee, and was written by another Fraggle Rock veteran, Jocelyn Stevenson.\n\nThis one-hour storybook special tells the story of Bean Bunny, who learns that he is worthwhile even though he seems too insignificant to be of much help to anyone. As the story begins, a group of bunnies in a forest meadow make preparations for the annual Bunny Picnic, a special celebration of the first day of spring marked by a visit from the Storyteller Bunny.\n\nBean wants to help with the preparations, but his older siblings, Lugsy and Twitch, consider him to be a nuisance. When Bean wanders off into the forest, he becomes alarmed when he sees a dog, and goes back to warn the others. But a dog has not been seen in the area for many years, and because Bean has a reputation for daydreaming and pretending, no one in the warren will believe him.\n\nThis special was the first appearance of Bean Bunny, who would join the Muppet cast in The Jim Henson Hour, and would take a featured role in Muppet*Vision 3D.\n\nThe special is not commercially available on DVD, and is here presented in full DVD quality for the first time. This is a PAL DVD - the British video system - which is how the special was shot.\n\nThis DVD also includes the Hebrew and German versions of the special, Jim Henson's original introduction, and a 25-minute Sing-along titled Billy Bunny's Animal Songs, presented in both PAL and NTSC formats.\n\nThere is also an image gallery and additional images on the disc, as well as the book adaptation of the special, in full.\n\nBilly Bunny's Animal Songs was released direct-to-video on May 21, 1993. It was the first of the titles in the Muppet Sing-Alongs series.\n\nKevin Clash played the starring role of Billy Bunny, who sings his way through the forest as he runs across a swamp full of frogs, a cave full of rapping bears and a singing porcupine (and even an appearance by one of the ever-present Muppet penguins). Jerry Nelson, Richard Hunt, and Fran Brill performed various animals of the forest, and Carmen Osbahr is credited in one of her first productions with the Muppets.\n\nBilly Bunny's Animal Songs was notable at the time for being the first video release featuring Steve Whitmire performing Kermit. (The Muppet Christmas Carol was released on video later in the year.) It was also the first production filmed after Jim Henson's death in 1990 and was immediately followed by production on The Muppets Celebrate Jim Henson. This was also one of the last projects Muppeteer Richard Hunt participated in. The video was released over a year after Hunt's passing.\n\n\n\nThe Tale of the Bunny Picnic\n\n    Executive Producer: Diana Birkenfield\n    Producer: Jim Henson\n    Directors: Jim Henson and David G. Hillier\n    Writer: Jocelyn Stevenson\n    Music by: Philip Balsam\n    Lyrics by: Dennis Lee\n    Muppet Performers: Steve Whitmire, Richard Hunt, Camille Bonora, Ron Mueck, Jim Henson, Karen Prell, Kevin Clash, Louise Gold, Martin P. Robinson, Mike Quinn, David Rudman\n    Co-producer: Martin G. Baker\n    Designer: John Bristow\n    Musical Director: Don Gillis\n    Conceptional Designer: Diane Dawson-Hearn\n    Puppet Design: Polly Smith, Jane A. Gootnick, Rollin Krewson, Joann Green, Jan Rosenthal, Connie Peterson, Norman Tempia, Cheryl Henson, Edward G. Christie, Ross Hill, Marian Keating, Jerry Gum, Will Morrison\n    Creative Advisor: Bonnie Erickson\n    Mechanical Design: Larry Jameson, Leigh Donaldson, Fred Buchholz, Thom Flowers, Tom Newby\n    Executive in Charge of Production: Duncan Kenworthy ","torrent":{"xt":"urn:btih:60f3ca14df00bf0d4c1ce8151d9d2927efa3bf81","amp;dn":"Jim+Hensons+Muppets+The+Tale+of+the+Bunny+Picnic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60f3ca14df00bf0d4c1ce8151d9d2927efa3bf81","infoHashBuffer":{"type":"Buffer","data":[96,243,202,20,223,0,191,13,76,28,232,21,29,157,41,39,239,163,191,129]},"announce":[],"urlList":[]}}