{"title":"Nisus Writer Pro 2.0+Patch.zip","uid":6424369,"size":158558846,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:61a555eed7f8393bb005f2dff2e48328dc97170a&amp;dn=Nisus+Writer+Pro+2.0%2BPatch.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1306406840,"description":"Nisus Writer Pro is a powerful multilingual word processor, similar to its entry level products, but brings new features such as Table of Contents, Indexing, Bookmarks, Widow and Orphan control, Cross References, Line Numbering, and Text Wrap around images. Familiar Classic features are also on board, like attribute sensitive Find and Replace, an upgraded Nisus Macro Language, and Glossaries. We have also improved a number of existing features. For example, we've added a variety of additional options to control the display of notes. Footnotes can now also span across pages.\n\nVersion 2.0\nThis big update adds often requested and long awaited features like track changes, drawing tools, and watermarks. Read the release notes for all the details on this major release.\n\nFriendly &amp; Flexible\nOur tools are right wherever you want them. Customize which palettes are seen and when. Organize your files with our Document Manager, or hide it completely. Assign any keyboard shortcut to any menu. Add any menu the toolbar. You're in control.\n\nFeatures\nWe've got them: styles, multilingual support, tables, comments, track changes, drawing tools, footnotes &amp; endnotes, bookmarks, cross-references, table of contents, full screen mode, and more.\n\nCompatible\nOur native file format (RTF) is understood by just about everyone. Nisus Writer also opens and saves Microsoft Word files, as well as other file formats.\n\nDepth\nOur find &amp; replace is unmatched: search by text pattern or applied formatting. Use our macro language to automate your workflow. Email our free customer support. Learn tips from our dedicated user community. We're here to help you grow into powerful tools.\n\n\nenjoy and have fun with it - thnx in advance for help out seeding\n\n=====&gt;&gt;&gt;&gt;&gt; PLS SEED &lt;&lt;&lt;&lt;&lt;===== _ =====&gt;&gt;&gt;&gt;&gt; PLS SEED &lt;&lt;&lt;&lt;&lt;=====\n","torrent":{"xt":"urn:btih:61a555eed7f8393bb005f2dff2e48328dc97170a","amp;dn":"Nisus+Writer+Pro+2.0%2BPatch.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61a555eed7f8393bb005f2dff2e48328dc97170a","infoHashBuffer":{"type":"Buffer","data":[97,165,85,238,215,248,57,59,176,5,242,223,242,228,131,40,220,151,23,10]},"announce":[],"urlList":[]}}