{"title":"Legend-Tripping Online: Supernatural Folklore and the Search for","uid":8786229,"size":1646017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61ac02ec565c80685e0a15ee1b27f391e52408ba&amp;dn=Legend-Tripping+Online%3A+Supernatural+Folklore+and+the+Search+for&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"celine23","files":-1,"time":1375834678,"description":"On the Internet, seekers investigate anonymous manifestos that focus on the findings of brilliant scientists said to have discovered pathways into alternate realities. Gathering on web forums, researchers not only share their observations, but also report having anomalous experiences, which they believe come from their online involvement with these veiled documents. Seeming logic combines with wild twists of lost Moorish science and pseudo-string theory. Enthusiasts insist any obstacle to revelation is a sure sign of great and wide-reaching efforts by consensus powers wishing to suppress all the liberating truths in the Incunabula Papers (included here in complete form).\n\nIn Legend-Tripping Online, Michael Kinsella explores these and other extraordinary pursuits. This is one of the first books dedicated to legend-tripping, ritual quests in which people strive to explore and find manifest the very events described by supernatural legends. Through collective performances, legend-trippers harness the interpretive frameworks these stories provide and often claim incredible, out-of-this-world experiences that in turn perpetuate supernatural legends.\n\nLegends and legend-tripping are assuming tremendous prominence in a world confronting new speeds of diversification, connection, and increasing cognitive load. As guardians of tradition as well as agents of change, legends and the ordeals they inspire contextualize ancient and emergent ideas, behaviors, and technologies that challenge familiar realities. This book analyzes supernatural legends and the ways in which the sharing spirit of the Internet collectivizes, codifies, and makes folklore of fantastic speculation.\n\nPublisher University Press of Mississippi, 2011\nISBN 1604739843, 9781604","torrent":{"xt":"urn:btih:61ac02ec565c80685e0a15ee1b27f391e52408ba","amp;dn":"Legend-Tripping+Online%3A+Supernatural+Folklore+and+the+Search+for","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61ac02ec565c80685e0a15ee1b27f391e52408ba","infoHashBuffer":{"type":"Buffer","data":[97,172,2,236,86,92,128,104,94,10,21,238,27,39,243,145,229,36,8,186]},"announce":[],"urlList":[]}}