{"title":"Despicable Me: Minion Rush 3.4.0j mod","uid":13091380,"size":78935555,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:62e583a5ca310e76f29e63e0bb24b5516c4269a3&amp;dn=Despicable+Me%3A+Minion+Rush+3.4.0j+mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1451047764,"description":"\nIt’s hard to dislike a game when it’s filled with adorable, quirky little yellow creatures who only want a banana and some fun. Despicable Me: Minion Rush invites you in with the colorful characters, who you may or may not know from the movie Despicable Me and its upcoming sequel, but knowing these characters’ filmography isn’t a prerequisite for playing. In fact, the game surprisingly relies on good design instead of familiar characters to keep you playing.\r\n\r\nThe game is modeled after the popular endless runner genre of games, Temple Run in particular. You control a single Minion running through a dangerous world filled with obstacles, and you watch this Minion run from a 3D, third-person perspective. To move your Minion, you can swipe left or right. Doing so causes him to move to another track, thereby dodging a road block. You can also swipe up to jump over a hurdle or down to slide underneath an overhead obstacle. Hitting a single obstacle spells game over.\r\n\r\nThe goal here is to run for as long as possible, hopefully surpassing your last distance. There are also power-ups littered along your path, which you can collect to improve your distance. Some power-ups shield you from damage, while others jump you across a distance. You should also try to collect the bananas that almost cover the levels.\r\n\r\nWhat's new:\r\nCatch the spirit of the holidays with Minion Rush in this festive new update!\r\n- Collect Holiday-themed items such as the Holiday Bell, Santa Hat and Bag of Gifts to win Dave's Snowboarder costume in the new Special Mission!\r\n- Don't miss out on festive treats such as the re-decorated Jelly Lab and the new Bobsleigh mini-game!\r\n- Race against other players in the Arctic and take advantage of new costume skills available for Dave's Santa and Firefighter costumes in Minion Races!\r\n\r\nWhat’s In The MOD:\r\nFree shopping\r\nRequires Android: 2.3 and Up","torrent":{"xt":"urn:btih:62e583a5ca310e76f29e63e0bb24b5516c4269a3","amp;dn":"Despicable+Me%3A+Minion+Rush+3.4.0j+mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62e583a5ca310e76f29e63e0bb24b5516c4269a3","infoHashBuffer":{"type":"Buffer","data":[98,229,131,165,202,49,14,118,242,158,99,224,187,36,181,81,108,66,105,163]},"announce":[],"urlList":[]}}