{"title":"Dayna Kurtz - Postcards from downtown","uid":3438642,"size":79943311,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:63059e42baace5d7da3bbd626a4c497432137460&amp;dn=Dayna+Kurtz+-+Postcards+from+downtown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rzilla","files":10,"time":1138793626,"description":"From Acoustic Guitar Magazine:\n\nA longtime denizen of the singer-songwriter underground emerges at last with a full studio CD, and it&amp;#039;s potent stuff. Dayna Kurtz&amp;#039; singing is deep and dramatic, at times hair-raisingly intense, on songs that touch on folk, alt-rock, classic crooner pop, and even cabaret jazz. Her strong, soulful guitar work underpins the arrangements, which skillfully add strings, accordion, and such things as &quot;weird ass ambient guitar&quot; without obscuring the basic sound of the solo troubadour. Those drawn to the dark shades of Tom Waits, Chris Whitley, and Amy Ray will find much to admire in these vivid musical postcards. (Kismet, www.daynakurtz.com) \n\n?Jeffrey Pepper Rodgers\n\n \nFrom All Music Guide:\n\nClearly, downtown is where the heart of Dayna Kurtz beats. With a throaty delivery that ranges from tuneless recitation to Annie Lennox-like declamation, Kurtz sings her heartbreak epics over an intriguing combination of empathetic rhythm section and string quartet, with accordion, violin, and other bohemian touches added for spice. It&amp;#039;s easy to imagine her on a stool in a cigarette-swirled spotlight, eyes closed, whispering &quot;you&amp;#039;re scared to fly, and I&amp;#039;m scared to land&quot; as bluesy piano and full-bodied acoustic bass cast noir shadows over &quot;Last Good Taste.&quot; References to &quot;stage diving on &amp;#039;Miss Liberty&amp;#039;&quot; nod toward contemporary elements, but Kurtz&amp;#039;s language more often evokes a timeless cabaret ambience, its fatalistic nostalgia underscored by primarily non-electric instrumentation, melodramatic dynamics, and frequent use of a sensuous waltz or 6/8 meter. When her mentor, Richie Havens, makes a guest appearance on &quot;Somebody Leave the Light On,&quot; his sandpapery timbre works as an orchestral element within an unusually turbulent changor; even as he chants &quot;Shit, this town is nowhere,&quot; the familiarity of his voice provides a beacon for the listener, like a soulful sax sounding within a wash of atonality. Yet this album is entirely Kurtz&amp;#039;s; while possibly too arty to curry widespread success, Postcards From Downtown is more than enough evidence of a major talent at work. \n\n-Robert L. Doerschuk, All Music Guide\n","torrent":{"xt":"urn:btih:63059e42baace5d7da3bbd626a4c497432137460","amp;dn":"Dayna+Kurtz+-+Postcards+from+downtown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63059e42baace5d7da3bbd626a4c497432137460","infoHashBuffer":{"type":"Buffer","data":[99,5,158,66,186,172,229,215,218,59,189,98,106,76,73,116,50,19,116,96]},"announce":[],"urlList":[]}}