{"title":"San Andreas Mafia - The Movie Dub (2015 Remaster)","uid":13695800,"size":501914613,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6370172cccf07c3f9618b5e3e2d5b20b71f01018&amp;dn=San+Andreas+Mafia+-+The+Movie+Dub+%282015+Remaster%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1456699279,"description":"This content is freely available. Downloadable at the Internet Archive or streamed on YouTube!\r\n\r\n---\r\n\r\nThings I fixed:\r\n\r\n- the dub is one big movie instead of broken up into four parts\r\n- episodes are meant to be seamlessly connected to each-other, so there is no &quot;End of Part 1/2/3&quot;\r\n- 1080p\r\n- some lines were missing in the original renders, this adds them back.\r\n- no re-recorded or new dialogue, all of this dialogue is from 2011/2012\r\n\r\n---\r\n\r\nDirected by: DexeN\r\nVoicework by: beatstar / imavoidingmyblock\r\n\r\nOriginal Movie Used Courtesy of DexeN Productions\r\n\r\n____\r\n\r\nI first caught light of the original &quot;SAM Movie 3&quot; just when I was brainstorming the trailer for What's My Name. As you can see, I used some content from their trailer. To be honest though, my sampling of their content wasn't envious in any way. I just wanted to see how pissed off they would get... and they got pretty pissed off.\r\n\r\nDespite the video enraging most of the SAM community, half a year later the beef was over. It was then when I suppose DexeN found it most suitable to release the last SAM Movie, so he did. I watched about 6 minutes of it, and found it lacking in that there were no fucking voices. Seriously, who the fuck goes through all that work just to have some captioned shit on their YouTube, no offense to anyone.\r\n\r\nI went ahead and took the liberty of making a dub for the SAM Movie. Instead of whatever the point of the original story was, I decided to make it a borat version of Reservoir Dogs, you know, without the rat. All characters are voiced by me.\r\n\r\n\r\n\r\nThe first video was received positively by DMH and SAM alike, and that inspired me to make more of these dubs, and while the black &amp; white effect wasn't intentional in the second, I decided to keep it. After exactly two months, I decided to release the third part. Three months later, I released the fourth to conclude the quadrilogy","torrent":{"xt":"urn:btih:6370172cccf07c3f9618b5e3e2d5b20b71f01018","amp;dn":"San+Andreas+Mafia+-+The+Movie+Dub+%282015+Remaster%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6370172cccf07c3f9618b5e3e2d5b20b71f01018","infoHashBuffer":{"type":"Buffer","data":[99,112,23,44,204,240,124,63,150,24,181,227,226,213,178,11,113,240,16,24]},"announce":[],"urlList":[]}}