{"title":"Krypto the Superplete Series (S1 720p)","uid":13679156,"size":7249906811,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:642ce195718087967f8ab8490ebad9cee9e5b6b6&amp;dn=Krypto+the+Superplete+Series+%28S1+720p%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":null,"files":39,"time":1456450515,"description":"As the planet Krypton is about to be destroyed, Superman's father Jor-El makes a ship and puts a white puppy named Krypto into it for a test flight to see if it is safe enough for interstellar travel. While aboard the ship, Krypto accidentally destroys several wires and causes the ship to put him into a deep sleep while it heads on to Earth.\r\n\r\nUpon landing on Earth, Krypto is a fully grown dog, possessed of superpowers similar to those of Superman's (since all Kryptonian life-forms gain superpowers from exposure to a yellow sun, such as Earth's sun). Later, Krypto is adopted by Kevin Whitney, a 9-year-old boy, with whom Superman arranges for him to stay (as Superman himself is often too busy saving the world to take care of him). Krypto poses as an ordinary dog while living with Kevin's family, but adopts the secret identity of Superdog for his superheroic deeds; Kevin is aware of Krypto's dual identity, but the rest of Kevin's family is not. (Excluding Kevin's spoiled cousin Bailey, however accidental.)\r\n\r\nIn the series, the various animals, including Krypto, all are capable of speaking to each other, but not to humans, except for Kevin (who is able to communicate with Krypto and the other animals thanks to a universal translator Kevin wears, known as an intergalactic communicator) and, of course, the viewers","torrent":{"xt":"urn:btih:642ce195718087967f8ab8490ebad9cee9e5b6b6","amp;dn":"Krypto+the+Superplete+Series+%28S1+720p%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"642ce195718087967f8ab8490ebad9cee9e5b6b6","infoHashBuffer":{"type":"Buffer","data":[100,44,225,149,113,128,135,150,127,138,184,73,14,186,217,206,233,229,182,182]},"announce":[],"urlList":[]}}