{"title":"Judaism's Strange Gods - Hoffman -  Racial Hatred Talmudic","uid":6948915,"size":173520192,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:663878aeee6fc6b298d8a0026a4c2c9c5ddc981d&amp;dn=Judaism%5C%27s+Strange+Gods+-+Hoffman+-++Racial+Hatred+Talmudic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":17,"uploader":"UnviolentPeacemaker","files":29,"time":1326330517,"description":"1. URGENT, PLS, SEED, SEED, SEED ALL, ALL, ALL ...\nUnviolentPeaceMaker's TPB uploads        &lt;a href=&quot;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&lt;/a&gt; .  \nSOON I MAY BE PREVENTED.  DO IT.  \nKEEP THESE TORRENTS ALIVE.  Thanks.  All of them.\n\n2. NOTE:  High Quality ATT Voice. Dont like it?  Dont download it.  Dont complain.  Dont get in the way.\n\n-----------------------\n\nThe sharing of this book is NOT an endorsement in any way or form of its accuracy, veracity or intention.  \n\nThe one sharing this work is 100% devoted in life to averting another Holocaust, on anyone, by anyone, and is thereby living testament (not propagandistic lip-service) to the Holocaust perpetrated by the Nazi's, with ample help from US / IBM and US Jew bystanders.  \n\nFor the record:  The person sharing this book detests equally and completely the sham-religion 'christianity', made up by Paul, John, and others to Crucify Jesus' teachings - brotherhood, the one, only True religion, by whatever name; and sham-judaism, maybe somewhat earlier made up, as described in this book, to displace what Good, Humanity, Brotherhood... there might have been in the earlier teachings and practices of the earlier adherents of the old testament.  In fact, for parallel reasons the person sharing this book detests all 'religions' - islam, buddhism, socialism, democracy, atheism, capitalism, communism.... In every case, whatever their Good founding roots may have been, they have quickly become little more than their own brand of replacing the one, true, only 'Religion' -  Brotherhood, Universal Love, Universal Family... by whatever name, the only and entire hope for Humanity, for all of Creation now.\n\nBut make no mistake, all men, all women, all creatures are my family, now, and forever, and too, should be yours, unconditionally.\n\nWhy then share this book and author?  There are two issues that are on the verge of shattering the world today, and any, every and all future worth living, depending on whether allowed, or averted in this year 2012 - \n\n1. Environmental Suicide and \n\n2. Global Moral Suicide by allowing the Right Wing-nuts, clinically insane, of Israel and the world's superpower, the US, to cower the rest of us, as they are doing with total success, into supporting the genocide / holocaust / apartheid perpetrated on the Palestinians.  If we citizens of the world continue to cower, if we continue to allow the Treasonous subordination of US Government, Constitution, Might, Values, Treasury... to the will of Nazi-Rightwing-Israelis, we deserve what we get, but our youngest children do not, Creation does not, innocent bystanders in the 3rd world, do not, Palestinians with few exceptions, do not; all born in the future, do not, whatever species.  THE ONLY SOLUTION, THAT YOU SHOULD STAND FOR WITH EVERY SECOND YOU ARE NOT STANDING FOR AVERTING ENVIRONMENTAL SUICIDE IS:\na.  Safe and secure Israel within the '67 borders as explicitly called for by International Law.  Safety and security fully guaranteed by whatever force, including military by the UN and or US, period.\nb.  Safe and secure Palestine recognized by the United Nations and the US within the'67 borders as explicitly called for by International Law.  Safety and security fully guaranteed by whatever force, including military by the UN and or US, period.\nc.  Immediate and total termination of any and all military and financial support for Israel until they unmistakably begin rapid withdrawal from the 'occupied' territories as designated and demanded by International Law, Right-wing-nut-Israel's objections not withstanding.\n\nI wish there were a vastly more scholarly, more authoritative, non-christian-perspective version of this book to help fill the void.  But testament to the evil phenomenon (Right-wing-nut reign of Terror, Left-wing-nut Cowardice) mentioned above, all potential authors for this have been cowered, thus far.  So this seems to have more than a few grains of truth - responsibly uncover them, discard the rest, step up, step out, and make your part of the contribution.  Hurry.\n","torrent":{"xt":"urn:btih:663878aeee6fc6b298d8a0026a4c2c9c5ddc981d","amp;dn":"Judaism%5C%27s+Strange+Gods+-+Hoffman+-++Racial+Hatred+Talmudic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"663878aeee6fc6b298d8a0026a4c2c9c5ddc981d","infoHashBuffer":{"type":"Buffer","data":[102,56,120,174,238,111,198,178,152,216,160,2,106,76,44,156,93,220,152,29]},"announce":[],"urlList":[]}}