{"title":"The Fog of Forgetting by G A Morgan (retail) {dwg}","uid":11325494,"size":5927356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:674108410568be695012278fad2dca843f3d02f5&amp;dn=The+Fog+of+Forgetting+by+G+A+Morgan+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1414624598,"description":"In The Fog of Forgetting, the beginning of a new adventure-fantasy trilogy, five children wash up on the shores of an foreign land, unwitting agents of destiny in a realm struggling to withstand a force that could change their world -- and ours -- forever.\n\nMove over, Narnia. The journey to Ayda has begun. \n\nSneaking out for a quick boat ride on a summer day, five children find themselves engulfed in a curtain of dense, powerful fog that transports them from the rocky Maine coast to the mysterious island of Ayda. Rescued by Seaborne, a machete-toting wayfarer of few words, the children suddenly find themselves at the center of a centuries-old battle between Dankar, the ruler of Exor, and three siblings that rule the other realms of Ayda. At stake are the four stones of power and the elusive Fifth Stone that binds them all.\n\nWhen 9-year-old Frankie is kidnapped by Dankar, her older sister Evelyn and the three Thompson brothers must learn to harness the powers of the daylights, ancient forces of earth, fire, water, and air, to navigate their way through the realms of Ayda, rescue her, and find a way home.\n\nG.A. Morgan is a powerful new voice in the young adult adventure-fantasy genre, telling a story full of myth and mystery, action and peril. In Ayda, she has created a land rich with history and steeped in lore, one that exists not just in imagination but unnervingly, realistically, parallel to ours","torrent":{"xt":"urn:btih:674108410568be695012278fad2dca843f3d02f5","amp;dn":"The+Fog+of+Forgetting+by+G+A+Morgan+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"674108410568be695012278fad2dca843f3d02f5","infoHashBuffer":{"type":"Buffer","data":[103,65,8,65,5,104,190,105,80,18,39,143,173,45,202,132,63,61,2,245]},"announce":[],"urlList":[]}}