{"title":"The Wallflowers - 2005 - Rebel, Sweetheart  [EAC - FLAC]","uid":4637234,"size":362070582,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:67708e287723b022ab508afa18e5856b7bef2754&amp;dn=The+Wallflowers+-+2005+-+Rebel%2C+Sweetheart++%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bludStain","files":-1,"time":1231597123,"description":"Review    by Stephen Thomas Erlewine\n\nThe Wallflowers, particularly their leader, Jakob Dylan, can't catch a break. They're not only bound to be compared -- not entirely fairly but certainly understandably -- to Jakob's father, Bob, but an equally large burden is that they're a straight-ahead rock band in a time that doesn't value straight-ahead rock bands. They were able to ride the post-alternative wave to the top of the charts in the mid-'90s, when all guitar bands were lumped into a nebulous alt-rock scene, but just a few years later, in the aftermath of trip-hop, MTV Amp, and OK Computer, all big rock bands were expected to tackle the serious challenge of electronica, since that was the wave of the future and all. Didn't matter if they were groups as singularly unequipped to fuse loops and guitars as R.E.M. or Oasis -- they all made tentative attempts to reconcile classicist rock with futurist electronica. Not the Wallflowers. They stuck to their guns and made driving, songwriter-oriented rock &amp; roll in the vein of Springsteen, Tom Petty, and John Mellencamp. This stubbornness served their music well, but it won them no new fans, either among critics or the general public, who criticized them for being what they are: a working rock band, pure and simple. On each record, they have variations on their signature sound, given a slightly different spin depending on what producers they work with, but that's what most rock bands, good or bad, do -- they make records and go on tour. This happened more in the '70s and '80s than in the '90s and 2000s, when dwindling audiences and corporatization kept bands off the road and out of the studio for long stretches of time, but the Wallflowers remain a rock band in the traditional sense, mining a similar vein on Rebel, Sweetheart, their fifth album, as they did on their first. While there are no musical surprises here, this is a better album than its predecessor, Red Letter Days, not just because it's a stronger, more varied set of songs, but because they finally have a perfectly matched producer in Brendan O'Brien. Like his recent productions for Bruce Springsteen, O'Brien helps focus and revitalize the Wallflowers, opening up the music through subtly textured overdubs but also giving the band a harder attack than they've ever had. Simply put, they've never sounded better as a band than they do here, and they've never had a record as robust and interesting on a pure sonic level as they do here. Not that Rebel, Sweetheart offers anything all that different from previous Wallflowers albums -- they just do what they do better than they have before. Ultimately, there's a certain comfort in knowing that the Wallflowers can deliver sturdy, engaging classicist rock like this, since it makes them different from other rock bands of their time in yet another way: they're reliable.\n\nTracks\n01  Days of Wonder     Dylan     5:11\n02  The Passenger     Dylan     2:54\n03  The Beautiful Side of Somewhere     Dylan     4:00\n04  Here He Comes (Confessions of a Drunken Marionette)     Dylan     3:40\n05  We're Already There     Dylan     4:37\n06  God Says Nothing Back     Dylan     4:46\n07  Back to California     Dylan     3:33\n08  I Am a Building     Dylan     3:47\n09  From the Bottom of My Heart     Dylan     6:11\n10  Nearly Beloved     Dylan     4:00\n11  How Far You've Come     Dylan     3:27\n12  All Things New Again     Dylan     3:44 ","torrent":{"xt":"urn:btih:67708e287723b022ab508afa18e5856b7bef2754","amp;dn":"The+Wallflowers+-+2005+-+Rebel%2C+Sweetheart++%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67708e287723b022ab508afa18e5856b7bef2754","infoHashBuffer":{"type":"Buffer","data":[103,112,142,40,119,35,176,34,171,80,138,250,24,229,133,107,123,239,39,84]},"announce":[],"urlList":[]}}