{"title":"How to Seduce Your Teacher","uid":4134712,"size":736233472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67a0b521a51683256c05c01e77f01cc714ee44a2&amp;dn=How+to+Seduce+Your+Teacher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"circlensess","files":1,"time":1208207650,"description":"Another lame &quot;teenage&quot; Italian sex comedy with Gloria Guida\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0077852/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0077852/&lt;/a&gt;\n\nPlot Summary: There&amp;#039;s a new girl in school, Angela, the Headmaster&amp;#039;s neice. Every male will try to seduce her, even her uncle...\n\nThis is the last of a series of Italian sex comedies where Gloria Guida portrayed an increasing long-in-the-tooth &quot;liceale&quot; or high school co-ed. This time her character, the ironically named &quot;Angela&quot;, is sent away to attend a school where her uncle is principal. As usual she drives all the adolescent and adult males (including blood relatives) into paroxysms of lust before eventually setting her sights on her handsome history teacher. While sex between teachers and under-age students is not quite the hilarious knee-slapper today that it once was, it should be said the Guida never was believable as an actual &quot;liceale&quot; when she started this series four years earlier and she certainly wasn&amp;#039;t here when she was pushing 25. The real problem with this movie is that there aren&amp;#039;t nearly enough scenes of Guida showering, stripping, etc., and WAY too many scenes of unfunny funnyman Lino Banfi (who co-starred with GG in all these films) cross-dressing or sitting on the toilet. At least here, they finally gave up trying to pass the practically middle-age Banfi off as a student and made him a music teacher instead (although why any school would hire this incompetent and annoying idiot to teach anything really beggars belief).\n\nLorraine DeSalle also shows up here in an early role. She would go to become a minor cult celebrity after appearing in some of the more appalling Italian cannibal and WIP films directed by the likes of Umberto Lenzi and Bruno Mattei. This is probably her best film (and she has even more nude scenes than Guida), but don&amp;#039;t necessarily take that as a recommendation.","torrent":{"xt":"urn:btih:67a0b521a51683256c05c01e77f01cc714ee44a2","amp;dn":"How+to+Seduce+Your+Teacher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a0b521a51683256c05c01e77f01cc714ee44a2","infoHashBuffer":{"type":"Buffer","data":[103,160,181,33,165,22,131,37,108,5,192,30,119,240,28,199,20,238,68,162]},"announce":[],"urlList":[]}}