{"title":"Gerbil Physics v1.1","uid":8494130,"size":21579981,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:684f9b270d8b854da90fac96a36a8c144b951531&amp;dn=Gerbil+Physics+v1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1369085544,"description":"\nAdorable gerbil destruction! Remember how much fun it was to kick down a sandcastle when you were 10 years old? This game is that feeling made digital.\n\nReviews:\n&quot;as adorable as it is enthralling&quot; - Kotaku, &quot;dangerously, hypnotically addictive&quot; - Den of Geek, &quot;fantastic... fell in love with it from the first play&quot;, &quot;ridiculously fun to play&quot;, &quot;brilliant fun, it has everything you need&quot;.\n\nBuildings formed of gerbils await destruction for your amusement using a variety of demolition tools. Use bombs, explosives and disintegrators to wreak havoc across multiple danger-packed worlds. A powerful physics engine ensures that gerbils respond to your mass detonations exactly as real gerbils might. No gerbils were hurt in the making of this game.\n\nFeatures:\n- Engaging, destructive, game-play featuring huge explosions and cute flying gerbils.\n- State-of-the-art physics engine ensures that gerbils respond to your explosives exactly as real gerbils might.\n- Gorgeous and charming art design.\n- Cunning puzzles with multiple solutions across 84 glorious, lovingly handcrafted levels.\n- Achievements reward your clever insights.\n- Optimized for Android phones and tablets.\n- Suitable for all ages.\n- One low price gets you the whole game, no annoying adverts and no rip-off in-app purchase.\n\nYes, the indie smash title Gerbil Physics has finally arrived on Android! Join almost half a million other players who downloaded the game on other platforms and see why Gerbil Physics is consistently one of the highest ranking and most critically acclaimed indie titles available.\n\nWhat's in this version:\nVersion 1.1 is the first public Android release. This version has been optimized for Android Phones and Android 7&quot; and 10&quot; Tablets.\nIf you experience any issues with art looking corrupted when you start the game for the very first time, please close and restart the game to fix it. You should only need to do this once (and we're working on a fix).\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.pencelgames.gerbilphysics&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.pencelgames.gerbilphysics&lt;/a&gt;\n","torrent":{"xt":"urn:btih:684f9b270d8b854da90fac96a36a8c144b951531","amp;dn":"Gerbil+Physics+v1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"684f9b270d8b854da90fac96a36a8c144b951531","infoHashBuffer":{"type":"Buffer","data":[104,79,155,39,13,139,133,77,169,15,172,150,163,106,140,20,75,149,21,49]},"announce":[],"urlList":[]}}