{"title":"The Hill Fights - First Battle of Khe Sanh (Big Papi) Viet Nam","uid":13098042,"size":82278075,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6910a0c2043f1471c3b21b4718577795a2a88b42&amp;dn=The+Hill+Fights+-+First+Battle+of+Khe+Sanh+%28Big+Papi%29+Viet+Nam&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":26,"time":1451166022,"description":"[img]https://yuq.me/users/15/891/mnZMIwFTyd.jpg[/img]\r\n\r\nBy Rick Johnson on May 9, 2004\r\nFormat: Hardcover\r\nA profoundly detailed account of what we lived through and the often bitter circumstances that we faced in combat. Murphy lets you taste the bitterness of circumstances gone wrong and smell the sweet victory when it works well. I could never understand why we were given the M-16 rifle with serial no's that began with EM16-E1XXXXXXXX (experimental model) until the truth of the politics behind it was revealed in this work. They were next to worthless as originaly issued. The research on the book was exhaustive and done with a heart to reveal the truth without being mean spirited in conveying the truth. When Ed interviewed me and I had a foggy recollection, he challenged me with facts that made the memory come clear or proved to me that I was not recalling it correctly. Brilliant insight into why we fought some of the battles we fought and who thought we had to fight over what turf and why. The names in print alongside mine are all correct, a testament to the authors thoroughness. He did a good job weaving our comments together into an integrated story that is exciting to read. I've enjoyed reading it and still go back to it. Have given it as a gift on several ocasions","torrent":{"xt":"urn:btih:6910a0c2043f1471c3b21b4718577795a2a88b42","amp;dn":"The+Hill+Fights+-+First+Battle+of+Khe+Sanh+%28Big+Papi%29+Viet+Nam","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6910a0c2043f1471c3b21b4718577795a2a88b42","infoHashBuffer":{"type":"Buffer","data":[105,16,160,194,4,63,20,113,195,178,27,71,24,87,119,149,162,168,139,66]},"announce":[],"urlList":[]}}