{"title":"eBook dump may 2013","uid":8484916,"size":1667151319,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6996f2d18d30c2e79a7f6f77f637ea4fb4403554&amp;dn=eBook+dump+may+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"angelos2225","files":97,"time":1368830895,"description":"e-book dump 18th May 2013\n==============================\n\nThe zip file within the torrent contains about 1500 fiction e-books in ePub format.\n\nA list of select books with not perfectly clear filenames:\nEveryday Barbecue: At Home with America's Favorite Pitmaster\nFood: Vegetarian Home Cooking\nThe Ultimate Healthy Snack List including Healthy Snacks for Adults &amp; Healthy Snacks for Kids: Discover over 130 Healthy Snack Recipes - Fruit Snacks, ... Recipes, Gluten-Free Snacks and more!\nJoy of Cooking: All About Salads &amp; Dressings\nLinear Programming, Second Edition - Foundations and Extensions\nUnderstanding and Using Linear Programming (Universitext)\nIntroduction to Linear Optimization (Athena Scientific Series in Optimization and Neural Computation, 6)\nMathematical Introduction to Linear Programming and Game Theory (Undergraduate Texts in Mathematics)\nThe CPO: Transforming Procurement in the Real World\nManaging Startups: Best Blog Posts\nA Primer on Scientific Programming with Python (Texts in Computational Science and Engineering)\nGraph Theory with Algorithms and its Applications: In Applied Science and Technology\nOpenStack Cloud Computing Cookbook\nCompTIA A+ Rapid Review (Exam 220-801 and Exam 220-802)\nWindows Server 2012 Inside Out\nExcel 2013 Power Programming with VBA (Mr. Spreadsheet's Bookshelf)\nAbsolute OpenBSD: UNIX for the Practical Paranoid\nApplied Cyber Security and the Smart Grid: Implementing Security Controls into the Modern Power Infrastructure\nThe Most Effective Ways to Live Longer: The Surprising, Unbiased Truth About What You Should Do to Prevent Disease, Feel Great, and Have Optimum Health and Longevity\nUnderstanding and Using the Controller Area Network Communication Protocol: Theory and Practice\n\nand many more.......\n\nAs always, i understand that there is ridiculous amounts of work that can be done to improve this torrent, and everyone is welcome to give it a shot and re-upload an improved version of this one.\n\nenjoy and seed!","torrent":{"xt":"urn:btih:6996f2d18d30c2e79a7f6f77f637ea4fb4403554","amp;dn":"eBook+dump+may+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6996f2d18d30c2e79a7f6f77f637ea4fb4403554","infoHashBuffer":{"type":"Buffer","data":[105,150,242,209,141,48,194,231,154,127,111,119,246,55,234,79,180,64,53,84]},"announce":[],"urlList":[]}}