{"title":"Waist Deep (2006) DVDRip XviD","uid":4601656,"size":735334447,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:69bfb4c11362d9344cb291f164007ce2e9043888&amp;dn=Waist+Deep+%282006%29+DVDRip+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":2,"time":1230241388,"description":"His son. His life. His freedom. He's taking them all back\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0456020/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0456020/&lt;/a&gt;\n\n&quot;I'll always come back for you,&quot; single father O2 tells his young son Junior. This parental promise is put to the test when O2 is suddenly plunged into a do-or-die situation; trying to go straight for Junior's sake, this recently paroled ex-con is forced to go back outside the law after his son is kidnapped in a carjacking. The resulting chase and shootout have left Junior in the hands of Meat, the vicious leader of the Outlaw Syndicate. O2's shady cousin Lucky tries to mediate, but is caught between criminal and family loyalties. The only person who can or will help O2 get his son back is wily street-smart hustler Coco, whose path fatefully crossed O2's just moments before the kidnapping. When Lucky gets word to O2 that Meat expects $100,000 for Junior's freedom, O2 and Coco seize the opportunity to pit rival elements of the South Los Angeles underworld against each other. &quot;It's either all or nothing,&quot; realizes O2. With the clock ticking down, the heat between O2 and Coco rises as they become a lawbreaking couple, on an tear through a range of Los Angeles neighborhoods. Can they outwit the underworld and save Junior and themselves?","torrent":{"xt":"urn:btih:69bfb4c11362d9344cb291f164007ce2e9043888","amp;dn":"Waist+Deep+%282006%29+DVDRip+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69bfb4c11362d9344cb291f164007ce2e9043888","infoHashBuffer":{"type":"Buffer","data":[105,191,180,193,19,98,217,52,76,178,145,241,100,0,124,226,233,4,56,136]},"announce":[],"urlList":[]}}