{"title":"1 Firestorm v1 [1978] (Catseye2001) [h33t]","uid":4106039,"size":65265803,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:69c90fb3026ee3e7f5acdf76d2e71880bde2b25c&amp;dn=1+Firestorm+v1+%5B1978%5D+%28Catseye2001%29+%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Catseye2001","files":7,"time":1206811618,"description":"This is the first Firestorm series, which ran for 5 issues in 1978. Included is the black and white issue #6 from Cancelled Comic Cavalcade.\n\nSnipped from Wikipedia: Firestorm (Ronald &quot;Ronnie&quot; Raymond) is a fictional character, a DC Comics superhero. Created by writer Gerry Conway and artist Al Milgrom, he first appeared in Firestorm #1 (March 1978).\n\nThe original Firestorm was distinguished by his integrated dual identity. High school student Ronald Raymond and Nobel Prize-winning physicist Martin Stein were caught in a nuclear accident that allowed them to fuse into the &quot;nuclear man&quot; Firestorm. Due to Stein&amp;#039;s being unconscious during the accident, Raymond was prominently in command of the Firestorm form with Stein a voice of reason inside his mind. Banter between the two was a hallmark of their adventures.\n\nFirestorm possesses great powers, including flight, superhuman strength, and control over matter itself. He also stands out visually, with (literally) flaming hair and a distinctive red and yellow costume.\n\nAfter the accident that created him, Firestorm took to defending New York from such threats as Multiplex (created in the same nuclear accident that produced Firestorm) and Killer Frost. The 1978 series was cancelled abruptly in a company-wide cutback (the &quot;DC Implosion&quot;) with #5 (the first part of a multiple-issue story) the last to be distributed, and #6 included in Cancelled Comic Cavalcade. \n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:69c90fb3026ee3e7f5acdf76d2e71880bde2b25c","amp;dn":"1+Firestorm+v1+%5B1978%5D+%28Catseye2001%29+%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69c90fb3026ee3e7f5acdf76d2e71880bde2b25c","infoHashBuffer":{"type":"Buffer","data":[105,201,15,179,2,110,227,231,245,172,223,118,210,231,24,128,189,226,178,92]},"announce":[],"urlList":[]}}