{"title":"[Patrick_McGuinness]Other People's Countries A Journey into Memo","uid":11100209,"size":7723433,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a1bee4f28dae28c9318c4d6e0e3981708dcca94&amp;dn=%5BPatrick_McGuinness%5DOther+People%27s+Countries+A+Journey+into+Memo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1411662042,"description":"Book Description\nPublication Date: March 20, 2014\n\nDisarming, eloquent and illuminating, this meditation on place, time and memory, could only have been written by a poet, or a novelist, or a professor. Happily, Patrick McGuinness is all three, and Other People's Countries is a marvel: a stunning piece of lyrical writing, rich in narrative and character - full of fresh ways of looking at how we grow up, how we start to make sense of the world.\n\n\n\nThis book evolved out of stories the author told his children: stories about the Belgian border town of Bouillon, where his mother came from, and where he has been going three times a year since he was a child - first with his parents and now with his son and daughter. This town of eccentrics, of charm, menace and wonder, is re-created beautifully - 'Most of my childhood,' he says, 'feels more real to me now than it did then'. For all its sharp specifics, though, this is a book about the common, universal concerns of childhood and the slowly developing deep sense of place that is the bedrock for our memories.\n\n\n\nAlert and affectionate, full of great curiosity and humour, Other People's Countries has all the depth and complexity of its own subject - memory - and is an unfashionably distilled, resonant book: unusual and exquisite.\n\n2014 | ISBN-10: 0224098306 | 208 pages | EPUB | 7 MB\n","torrent":{"xt":"urn:btih:6a1bee4f28dae28c9318c4d6e0e3981708dcca94","amp;dn":"%5BPatrick_McGuinness%5DOther+People%27s+Countries+A+Journey+into+Memo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a1bee4f28dae28c9318c4d6e0e3981708dcca94","infoHashBuffer":{"type":"Buffer","data":[106,27,238,79,40,218,226,140,147,24,196,214,224,227,152,23,8,220,202,148]},"announce":[],"urlList":[]}}