{"title":"Shrimad Valmiki Ramayana - Uttara Kanda[RESEEDED]","uid":6921785,"size":22327408,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a84deebaa4d090a04ffa10ace7c03099919354b&amp;dn=Shrimad+Valmiki+Ramayana+-+Uttara+Kanda%5BRESEEDED%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"594mgnav","files":-1,"time":1325300135,"description":"Shrimad Valmiki Ramayana - Uttara Kanda [Team Nanban][TPB]\n\n\n\nAbout Valmiki:\n\n\n\n&quot;Valmiki&quot; (during Lord Rama's time) is celebrated as the poet harbinger \nin Sanskrit literature. \n\nHe is the author of the epic Ramayana, based on the attribution in the text of \nthe epic itself.\n\nHe is revered as the Adi Kavi, which means First Poet, for he discovered the first sloka \ni.e. first verse, which set the base and defined the form to Sanskrit poetry.\n\nThe Ramayana, originally written by Valmiki, consists of 24,000 verses in seven cantos \n(some say six i.e. excluding the Uttara Ramayana) (Kandas). \n\nThe Ramayana tells the story of a prince, Rama of Ayodhya, whose wife Sita is abducted \nby the demon (Raakshasa) king of Lanka, Ravana. \n\nThe Valmiki Ramayana is dated variously from 500 BC to 100 BC, or about co-eval with \nearly versions of the Mahabharata.\n\nAs with many traditional epics, it has gone through a long process of interpolations \nand redactions, making it impossible to date accurately.\n\n\n\nSHORT DESCRIPTION ON Shrimad Valmiki Ramayana - Uttara Kanda:\n\n\nThe Uttara Kanda is regarded to be a later addition to the original story by Valmiki.\n\nand concerns the final years of Rama, Sita, and Rama's brothers. \n\nAfter being crowned king, many years passed pleasantly with Sita. \n\nHowever, despite the agni pariksha (fire ordeal) of Sita, \nrumors about her purity are spreading among the populace of Ayodhya.\n\nRama yields to public opinion and banishes Sita to the forest, \nwhere sage Valmiki provides shelter in his ashrama (hermitage). \n\nHere she gives birth to twin boys, Lava and Kusha, \nwho became pupils of Valmiki and are brought up in ignorance of their identity.\n\nValmiki composes the Ramayana and teaches Lava and Kusha to sing it. \n\nLater, Rama holds a ceremony during Ashwamedha yagna, which the sage Valmiki, \nwith Lava and Kusha, attends. \n\nLava and Kusha sing the Ramayana in the presence of Rama and his vast audience. \n\nWhen Lava and Kusha recite about Sita's exile, Rama becomes grievous, \nand Valmiki produces Sita. \n\nSita calls upon the Earth, her mother, to receive her and as the ground opens, \nshe vanishes into it.\n\nRama then learns that Lava and Kusha are his children. \nLater a messenger from the Gods appears and informs Rama that the mission of \nhis incarnation was over. \n\nRama returns to his celestial abode.\n\n\n\nI WILL POST ALL THE KANDAS ONE BY ONE...\n\nPLZ SEED THIS DIVINE TORRENT AS MUCH AS POSSIBLE..\n\nYOU WILL BE ONE OF THE GOOD PEOPLE WHO SPREAD THE MESSAGE OF RAMAYANA THROUGHOUT THE WORLD..\n\nTHIS TORRENT IS NOT RESTRICTED TO HINDUS ONLY...\n\nANY ONE CAN SPREAD GOOD MESSAGE IF THEY HAVE NICE, PEACEFUL HEART..\n\nPLZ SEED GUYZ...\n\nTHANK YOU..\n\n\nPLZ SEED AS MUCH AS POSSIBLE..I AM LACKING SEEDS...","torrent":{"xt":"urn:btih:6a84deebaa4d090a04ffa10ace7c03099919354b","amp;dn":"Shrimad+Valmiki+Ramayana+-+Uttara+Kanda%5BRESEEDED%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a84deebaa4d090a04ffa10ace7c03099919354b","infoHashBuffer":{"type":"Buffer","data":[106,132,222,235,170,77,9,10,4,255,161,10,206,124,3,9,153,25,53,75]},"announce":[],"urlList":[]}}