{"title":"Train - Drops Of Jupiter","uid":4777530,"size":150939652,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6a8c56d47eb847b26d691da5cccb385628890590&amp;dn=Train+-+Drops+Of+Jupiter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1237264819,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Drops of Jupiter (Tell Me)&quot; is an alternative rock song by California rock band Train on their second album Drops of Jupiter (2001). It was their first single from the album, and hit the top 5 of the Billboard Hot 100 chart, peaking at number 5 and remaining in the Top 40 for 38 weeks. The single from Europe held the tracks &quot;It's Love,&quot; &quot;This Is Not Your Life,&quot; and &quot;Sharks&quot;. The song has spent over 100 weeks on the Adult Contemporary charts, and is still charting on the Recurrents chart. Although the song was released years before digital download became commonplace, the song has sold over 100,000 downloads (giving it a Gold certification by the RIAA), and hit the top 50 of the Digital Downloads charts five years after its release due to Ace Young singing it on the fifth season of American Idol.\n\nThe song won 2 Grammy Awards for &quot;Best Rock Song&quot; and &quot;Best Instrumental Arrangement Accompanying Vocalist(s)&quot;.\n\nOn March 29, 2005, Judy Collins released a cover version of this song on her Portrait of an American Girl album.\n\nMishavonna Henson sang a rendition of this song on Season 8 of American Idol during the Top 36 round, which caused it to briefly reappear on the Top 100 Hot Digital Songs list.\n\nThe second video, widely considered the &quot;proper&quot; one shows Pat Monahan performing the song on a stage, backed by the band and a strings group. As the video progresses, people come in to watch the song performed.\n\nDue to its unique and enigmatic lyrics, the meaning of song has been the subject of speculation since its release. Lead singer Pat Monahan has stated that the song was inspired by the death of his mother, and that the opening lines came to him in a dream. The song, which started as a song about his mother, has evolved into a love song, according to Monahan in 2006.\n\nPoetically, the use of references to planets, stars, galaxies and so on gives an ethereal feel to the music, contributing to its popularity. The lyrics propose a lost lover who has 'found a shooting star', explored the Universe, but comes home.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6a8c56d47eb847b26d691da5cccb385628890590","amp;dn":"Train+-+Drops+Of+Jupiter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a8c56d47eb847b26d691da5cccb385628890590","infoHashBuffer":{"type":"Buffer","data":[106,140,86,212,126,184,71,178,109,105,29,165,204,203,56,86,40,137,5,144]},"announce":[],"urlList":[]}}