{"title":"The discovery of India","uid":5932340,"size":6213284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ab1e64040ce071fc06503165163616f376f0b17&amp;dn=The+discovery+of+India&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mindhunter84","files":2,"time":1288820908,"description":"The Discovery of India was written by India's first Prime Minister Jawaharlal Nehru during his imprisonment in 1942-1946 at Ahmednagar in the Ahmednagar Fort.\nNehru was jailed for his participation in the Quit India movement along with other Indian leaders, and he used this time to write down his thoughts and knowledge about India's history. The book is widely regarded as a classic in India since its first publication in 1946, and provides a broad view of Indian history, philosophy and culture, as viewed from the eyes of a liberal Indian fighting for the independence of his country [1].\nIn The Discovery of India Nehru argued that India was an historic nation with a right to sovereignty. (Calhoun, Craig, Nations Matter: Culture, History and the Cosmopolitan Dream, Routledge, p. 63.)\nIn this book Pandit Jawaharlal Nehru tries to study the history of India starting from the Indus Valley Civilization, and then covers the country's history from the arrival of the Aryans to government under the British Empire. The effect of these various people on Indian culture and their incorporation into Indian society is examined. This book also analyses in depth the philosophy of Indian life.\nThis book was dedicated to the Prisoners of Ahmednagar jail.","torrent":{"xt":"urn:btih:6ab1e64040ce071fc06503165163616f376f0b17","amp;dn":"The+discovery+of+India","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ab1e64040ce071fc06503165163616f376f0b17","infoHashBuffer":{"type":"Buffer","data":[106,177,230,64,64,206,7,31,192,101,3,22,81,99,97,111,55,111,11,23]},"announce":[],"urlList":[]}}