{"title":"Just for Kicks [2005] Thibaut de Longeville","uid":7058485,"size":733635261,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6ade389dc75d087d5fb6a2789d25bd9946d466b2&amp;dn=Just+for+Kicks+%5B2005%5D+Thibaut+de+Longeville&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1330250342,"description":" &lt;a href=&quot;http://bayimg.com/bAmCEAADO&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/bAmCEAADO&lt;/a&gt;\n\nJust for Kicks (2005) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0451090/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0451090/&lt;/a&gt;\n\nDirector: Thibaut de Longeville\n\nRunning time: 82 minutes\n\nLanguage: English \n\nIt's funny how sometimes a film will think it's one thing when actually it's something else entirely. Take, for example, &quot;Just For Kicks.&quot; This MTV-affiliated documentary directed by Thibaut de Longeville is under the impression that it's about sneakers, sneaker mania and hip-hop. But anyone who watches this film will walk away with a different impression: This is clearly a document of mental illness.\n\n&quot;How's that?&quot; I hear you say. Well, just take a look at some of the interviewees here. There's Damon Dash (from Rocawear) saying, &quot;I don't like to wear the same thing twice.&quot; Regarding sneakers, he says &quot;you got to have at least 365 different pairs.&quot; A shoe-store owner in NYC describes how police escorts were necessary for customers buying a certain limited-edition pair of Nike shoes (NYC Pigeons) as gangsters with machetes were lining the streets outside waiting to ambush kids for their shoes. Then there's sneaker collector and otaku Tommy Rebel, who notes how &quot;it just gets crazy when you want everything.&quot;\n\nIndeed. And Rebel, a textbook case of Obsessive Compulsive Disorder, has several hundred pairs of athletic shoes to his name, despite looking like the sort of guy who actively avoids any activity that would make him break into a sweat. His madness is par for the course, though. It's positively scary to see rap unit Cold Crush Brothers explain how &quot;you gotta wash your shoe strings while they're still white.&quot; (Thus further demonstrating the inherent idiocy of wearing all white shoes, originally designed for the tennis or basketball court, on grimy urban streets.)\n\nAll this irony and insanity flies right by director de Longeville, though. An industry cheerleader whose cross-media consulting agency boasts clients like Nike and Sony Music, de Longeville seems positively thrilled by the idea that people can &quot;want everything,&quot; and that hip-hop starts like Damon Dash or Missy Elliot have sneaker closets to rival Imelda Marcos' shoe collection. De Longeville looks at the rabid consumer culture of manufactured needs and media-fed desires and says, &quot;Hey, the Matrix is a damn cool place, ain't it? Have another blue pill.&quot;\n\n&quot;Just For Kicks&quot; sticks pretty close to this street-capitalist triumphalist tone, presenting a cultural history of Harlem entrepreneurism, how hip-hop dictated fashion tastes globally. The film focuses on Run-DMC as the instigators of brand-name footwear fetishism, with their high-profile use of Adidas Superstars as part of their look. (They even wrote a song about their kicks, 1986's &quot;My Adidas.&quot;) The film notes how the band wore them &quot;felon&quot; style, without any laces, adopting a just-out-of-prison look. (Laces could be used to hang or garrote someone, and hence were a no-no in the joint.)\n\nDespite their bad-ass street cred, Run-DMC were quick to sign a million-dollar deal with Adidas, and the company was soon able to move $122 million worth of products in a single week to a new, urban market. As French movie director and kind of B-boy Matthieu Kassovitz notes, only slightly tongue-in-cheek, &quot;the Adidas is to hip-hop like the crucifix is to Christianity.&quot;\n\n&quot;Just For Kicks&quot; moves on through the phenomena of Air Jordans and celebrity endorsements of sneakers, the wave of ghetto violence in which kids were jacked for their sneakers, and the current trend toward hip-hop ownership of their own brands. \n\nDe Longeville is so high on selling the idea of hip-hop success as its own corporate brand in creating this sneaker market that he's blissfully unaware of the ironies he's throwing up on the screen. Repeated references are thrown about as to hip-hop and sneaker fetishism being &quot;underground culture&quot;; at the same time the film is telling us about a $20 billion market controlled by megabrands like Nike and Reebok and sold by superstars like Jay-Z and 50 Cent. Underground? In your dreams, Thibaut. \n\nThere was a lot of talk back in the 1980s about the wisdom of programming inner-city youth with limited means to worship over-priced brand footwear for the dubious status it conferred. You won't hear any such skeptical talk in &quot;Just For Kicks,&quot; which treats the phenomena of kids getting killed for their Air Jordans as just another example of brand desirability.\n\nThen we get treated to Damon Dash's closet with its hundreds of pairs of sneakers. &quot;Imagine having all these colors,&quot; he says, &quot;and all this stuff to wear,&quot; as the camera pans over row upon row of sneakers. One almost feels like screaming, &quot;Dude, they all look the freakin' same!&quot; But then one feels that ol' blue pill kicking in. \n\n\n","torrent":{"xt":"urn:btih:6ade389dc75d087d5fb6a2789d25bd9946d466b2","amp;dn":"Just+for+Kicks+%5B2005%5D+Thibaut+de+Longeville","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ade389dc75d087d5fb6a2789d25bd9946d466b2","infoHashBuffer":{"type":"Buffer","data":[106,222,56,157,199,93,8,125,95,182,162,120,157,37,189,153,70,212,102,178]},"announce":[],"urlList":[]}}