{"title":"The Downtown Fiction - Losers &amp; Kings (2014) [FLAC]","uid":10503733,"size":289280459,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6ded62cb219317d4095010daa78b397693118e05&amp;dn=The+Downtown+Fiction+-+Losers+%26amp%3B+Kings+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1404692895,"description":"\n  The Downtown Fiction - Losers &amp; Kings (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Pop Punk, Alternative\n  Source: Scene CD (forsaken)\n  Codec: FLAC\n  Bitrate: ~ 1,100 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Some Place On Earth \n  02 Hope I Die On A Saturday Night \n  03 Don't Count Me Out \n  04 Kiss My Friends \n  05 Santa Cruz \n  06 No Generation \n  07 Cool Kids \n  08 So-Called Life\n  09 Big Mistakes \n  10 Right Where We Left Off \n  11 Sometimes \n\n  The Downtown Fiction's debut album, Let's Be Animals, was a little overcooked and a little underwhelming, by-the-book stadium-sized emo pop with high production values swamping the sprightly melodies and an overly slick sound dampening the band's youthful enthusiasm. After a label change and some shifting of the lineup, the group's second album, Losers &amp; Kings, is a big improvement. The lads (especially vocalist Cameron Leahy) sound like they've matured a bit, the record sounds less processed, and the songs are stronger overall. Subtract a couple clunkers, like the corny, punk-lite &quot;No Generation&quot; (&quot;There's no generation like our generation&quot;) and the mawkish acoustic ballad &quot;Right Where We Left Off,&quot; and they've made a really solid, really fun album. It's filled with lots of songs about growing up and being confused, lots of huge, hooky singalong choruses, lots of energy and loud guitars. At its best, the band rates among the top emo poppers plying their trade and the record provides songs that could slip into a happy summertime road-trip playlist (&quot;Cool Kids,&quot; the spunky &quot;Don't Count Me Out,&quot; or &quot;So Called Life&quot;) or a melancholy, no-one-understands-me mix (&quot;Santa Cruz,&quot; &quot;Hope I Die on a Saturday Night,&quot; or &quot;Big Mistakes&quot;) with the same ease. There's even a track that sounds like a big fat hit single, the almost painfully jumpy &quot;Call Me Maybe&quot;-quoting, mall punk anthem &quot;Kiss My Friends.&quot; The Downtown Fiction aren't rewriting the emo pop playbook here or contributing to the evolution of the sound in any way. In fact, Losers &amp; Kings is about as generic as they come. That's not a slam on them or the album, though; every genre needs bands that play it straight and deliver exactly what fans expect and desire. The trick is to do it with enough energy and verve to make it sound fresh, and that's what the Downtown Fiction do. It might not be enough as their career moves forward, but for now it's just fine.\n","torrent":{"xt":"urn:btih:6ded62cb219317d4095010daa78b397693118e05","amp;dn":"The+Downtown+Fiction+-+Losers+%26amp%3B+Kings+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ded62cb219317d4095010daa78b397693118e05","infoHashBuffer":{"type":"Buffer","data":[109,237,98,203,33,147,23,212,9,80,16,218,167,139,57,118,147,17,142,5]},"announce":[],"urlList":[]}}