{"title":"Sex, Needs and Queer Culture (2016).pdf Gooner","uid":15129400,"size":2452074,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e093c6bcb52cd2d3eb3a6c62c6cdd1a6c821b07&amp;dn=Sex%2C+Needs+and+Queer+Culture+%282016%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1467139178,"description":"Sex, Needs and Queer Culture From Liberation to the Post-Gay (2016).pdf Gooner\r\n\r\nPublisher: Zed Books (15 April 2016)\r\nLanguage: English\r\nISBN-10: 178360512X\r\nISBN-13: 978-1783605125\r\n\r\nThe belief of many in the early sexual liberation movements was that capitalism's investment in the norms of the heterosexual family meant that any challenge to these norms was invariably anti-capitalist. In recent years, however, queer and gay subcultures have become increasingly mainstream and commercialised (as seen for example, in corporate backing for gay pride events) while the initial radicalism of the gay rights movement has given way to relatively conservative goals such as marriage and adoption rights.\r\n\r\nThe response of queer theorists has largely focused on the notion of 'homonormativity' or the assimilation of gay rights, as if some act of betrayal has occurred. In From Sexual Liberation to the Post-Gay, David Alderson seeks to account for these shifts in both the gay movement and wider society while also offering a new and radically different interpretive framework. \r\n\r\nThrough a critical reassessment of the work of the heterodox Marxist Herbert Marcuse, as well as of the cultural theorists Raymond Williams and Alan Sinfield, Alderson interrogates our understanding of neoliberalism and sexuality, and reaffirms the gay rights movement's countercultural origins. In doing so, Alderson's work represents a bold new direction for queer theory, one which offers hope that the movement's early liberationist spirit can be rekindled","torrent":{"xt":"urn:btih:6e093c6bcb52cd2d3eb3a6c62c6cdd1a6c821b07","amp;dn":"Sex%2C+Needs+and+Queer+Culture+%282016%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e093c6bcb52cd2d3eb3a6c62c6cdd1a6c821b07","infoHashBuffer":{"type":"Buffer","data":[110,9,60,107,203,82,205,45,62,179,166,198,44,108,221,26,108,130,27,7]},"announce":[],"urlList":[]}}