{"title":"Half-Real: Video Games Between Real Rules and Fictional Worlds b","uid":10618676,"size":8462994,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e4902d6c26af9187da2af32395c4e60a66b83e4&amp;dn=Half-Real%3A+Video+Games+Between+Real+Rules+and+Fictional+Worlds+b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1406150382,"description":"A video game is half-real: we play by real rules while imagining a fictional world.We win or lose the game in the real world, but we slay a dragon (for example) only in the world ofthe game. In this thought-provoking study, Jesper Juul examines the constantly evolving tensionbetween rules and fiction in video games. Discussing games from Pong to The Legend of Zelda, fromchess to Grand Theft Auto, he shows how video games are both a departure from and a development oftraditional non-electronic games. The book combines perspectives from such fields as literary andfilm theory, computer science, psychology, economic game theory, and game studies, to outline atheory of what video games are, how they work with the player, how they have developed historically,and why they are fun to play.Locating video games in a history of games that goes back to AncientEgypt, Juul argues that there is a basic affinity between games and computers. Just as the printingpress and the cinema have promoted and enabled new kinds of storytelling, computers work as enablersof games, letting us play old games in new ways and allowing for new kinds of games that would nothave been possible before computers. Juul presents a classic game model, which describes thetraditional construction of games and points to possible future developments. He examines how rulesprovide challenges, learning, and enjoyment for players, and how a game cues the player intoimagining its fictional world. Juul's lively style and eclectic deployment of sources will makeHalf-Real of interest to media, literature, and game scholars as well as to game professionals andgamers.","torrent":{"xt":"urn:btih:6e4902d6c26af9187da2af32395c4e60a66b83e4","amp;dn":"Half-Real%3A+Video+Games+Between+Real+Rules+and+Fictional+Worlds+b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e4902d6c26af9187da2af32395c4e60a66b83e4","infoHashBuffer":{"type":"Buffer","data":[110,73,2,214,194,106,249,24,125,162,175,50,57,92,78,96,166,107,131,228]},"announce":[],"urlList":[]}}