{"title":"Billy Bragg - Life's a Riot with Spy vs Spy [1983][EAC/FLAC]","uid":10185268,"size":250017397,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6e4f67f0250ea4bad903e1f8b80af640a1c59a96&amp;dn=Billy+Bragg+-+Life%27s+a+Riot+with+Spy+vs+Spy+%5B1983%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":25,"time":1400572610,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: 2006 - Bonus Disc - Yep Rock 2601\nCountry: UK\nYear: February 21, 2006\nGenre: Folk,punk\nFormat: 2xCD,Album\n\n\n\nLife's A Riot With Spy Vs Spy\nOriginally released May 1983 on Utility Records\n\n1.1\t The Milkman Of Human Kindness\t2:49\n1.2\t To Have And To Have Not\t2:33\n1.3\t Richard\t2:51\n1.4\t A New England\t2:14\n1.5\t The Man In The Iron Mask\t2:13\n1.6\t The Busy Girl Buys Beauty\t1:58\n1.7\t Lovers Town Revisited\t1:19\n\nReissue Bonus CD\n2.1\t Strange Things Happen (Alternative Version)\t3:19\n2.2\t The Cloth (1)\t2:50\n2.3\t Love Lives Here\t1:42\n2.4\t Speedway Hero\t2:39\n2.5\t Loving You Too Long\t2:51\n2.6\t This Guitar Says Sorry (Alternative Version)\t2:14\n2.7\t Love Gets Dangerous (Alternative Version)\t2:32\n2.8\t The Cloth (2)\t2:47\n2.9\t The Man In The Iron Mask (Alternative Version)\t2:17\n2.10\t A13, Trunk Road To The Sea\t2:27\n2.11\t Fear Is A Man's Best Friend\t2:32\n\n\nBilly Bragg launched his career as a recording artist in 1983 with Life's a Riot with Spy vs. Spy, a seven-song EP that somehow sounded modest and wildly ambitious at the same time. Recorded fast, rough, and cheap (and often sounding like it), Life's a Riot presented Bragg as an unlikely cross between Woody Guthrie and Joe Strummer -- one guy with a handful of songs, a powerful belief in the common people, and a big distorted electric guitar, blasting out songs about love and politics just loud enough to drown out the street traffic and the chatter at the pub. While the straight-to-stereo recording doesn't always do Bragg any favors (especially his warm but rough-edged bellow of a voice), the results put the emphasis squarely on the songs, and they're good enough to merit the scrutiny. While Bragg was willing and able to write marching anthems (&quot;To Have and Have Not&quot;), he was just as interested in the ongoing war between the sexes, as folks on the block either look for love (&quot;The Milkman of Human Kindness&quot;) or try to figure out what to do once they've found it (&quot;The Man in the Iron Mask&quot;), and while he wasn't above pointing out the foibles of others, Bragg's best songs spoke about the details of everyday life with clarity, compassion, and genuine humor. Running just a shade over 16 minutes, in its original form Life's a Riot was short and simple, but it made clear that Bragg was inarguably a first-class songwriter. In 2006, Yep Roc Records reissued Life's a Riot in expanded form with the addition of an 11-track bonus disc (though the two CDs combined include less than 45 minutes of music, making one wonder why they didn't slap all the songs on a single disc). The bonus disc is dominated by six outtakes from the Life's a Riot sessions, and a few early demos and home recordings. The alternate unreleased version of &quot;Strange Things Happen&quot; and both takes of &quot;The Cloth&quot; are especially interesting, as they feature Bragg accompanied by a low-tech drum machine, suggesting his &quot;guitar/vocal&quot; style was not set as strongly in stone as imagined early on (the same can also be said of the phased-out guitars on the outtake of &quot;This Guitar Says Sorry&quot;), though the fact this stuff went unreleased for so long makes it clear Bragg knew what worked best and what didn't. However, crackling covers of &quot;Fear Is a Man's Best Friend&quot; and &quot;Route 66&quot; (the latter given an Anglocentric remake as &quot;A13, Trunk Road to the Sea&quot;) close out the bonus CD in style, and make for a solid repackaging of a fine record.","torrent":{"xt":"urn:btih:6e4f67f0250ea4bad903e1f8b80af640a1c59a96","amp;dn":"Billy+Bragg+-+Life%27s+a+Riot+with+Spy+vs+Spy+%5B1983%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e4f67f0250ea4bad903e1f8b80af640a1c59a96","infoHashBuffer":{"type":"Buffer","data":[110,79,103,240,37,14,164,186,217,3,225,248,184,10,246,64,161,197,154,150]},"announce":[],"urlList":[]}}