{"title":"The Five Stages of Collapse (2013) by Dmitry Orlov","uid":10482995,"size":1636168,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f1b9b4715e85f92b598143bfe11ca1d5bbecaf1&amp;dn=The+Five+Stages+of+Collapse+%282013%29+by+Dmitry+Orlov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"huck53","files":-1,"time":1404421014,"description":"The Five Stages of Collapse - Survivors' Toolkit (2013) by Dmitry Orlov.pdf\n\nIn the face of political impotence, resource depletion, and catastrophic climate change, many of us have become reconciled to an uncertain future. However, popular perception of how this future might actually unfold varies wildly from &quot;a severe and prolonged recession,&quot; to James Howard Kunstler's &quot;long emergency,&quot; to the complete breakdown of civilization. In The Five Stages of Collapse, Dmitry Orlov posits a taxonomy of collapse, offering a surprisingly optimistic perspective on surviving the sweeping changes of the day with health and sanity intact.\n\nArguing that it is during periods of disruption and extreme uncertainty that broad cultural change becomes possible, Orlov steers the reader through the challenges of financial, commercial, and political collapse. He suggests that if the first three stages are met with the appropriate responses, further breakdown may be arrested before the extremes of social and cultural collapse are reached.\n\nDrawing on a detailed examination of post-collapse societies, including the Somali people of Africa, the Pashtuns of Afghanistan, the Roma of Central and Eastern Europe, and even the Russian mafia, The Five Stages of Collapse describes successful adaptations in areas such as finance, self-governance, and social and cultural organization. These fascinating case studies provide a unique perspective on the characteristics that determine highly resilient communities. Shot through with Orlov's trademark dark humor, this is an invaluable toolkit for creating workable post-collapse solutions.\n\n288 pages\nPublisher: New Society Publishers (May 28, 2013)\nLanguage: English\nISBN-10: 0865717362\nISBN-13: 978-0865717367","torrent":{"xt":"urn:btih:6f1b9b4715e85f92b598143bfe11ca1d5bbecaf1","amp;dn":"The+Five+Stages+of+Collapse+%282013%29+by+Dmitry+Orlov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f1b9b4715e85f92b598143bfe11ca1d5bbecaf1","infoHashBuffer":{"type":"Buffer","data":[111,27,155,71,21,232,95,146,181,152,20,59,254,17,202,29,91,190,202,241]},"announce":[],"urlList":[]}}