{"title":"Four Feather Falls 01-39 DVDrip complete 1950s TV series","uid":3809841,"size":3626549351,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:704979e3b748607565f67926f828dd21ae39b71a&amp;dn=Four+Feather+Falls+01-39+DVDrip+complete+1950s+TV+series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"mike18xx","files":40,"time":1190048173,"description":"Classic 1950s Gerry Anderson puppetry-animation. Black and White.\n\nSynopsis:\nLong, long ago, somewhere in the desert of Kansas, USA, was a town called Four Feather Falls. It was full of mighty nice people There was Ma Jones, the general store proprietor; Marvin Jackson, the town bank manager-, Dan Morse. the telegraphist, Doc Haggerty, the medic and Slim Jim, the owner and bartender of Denison Saloon. Then there was Little Jake, and his grampa Twink. Most importantly, there was Sheriff Tex Tucker.\n\nSheriff Tex wasn&amp;#039;t alone in his lawman&amp;#039;s status - he had two unofficial deputies in the form of his dog, Dusty, and his horse, Rocky. Tex owed a lot to his two faithful friends .... he owed everything, though, to four rather special feathers....\n\nOnce, when Tex was crossing a desolate trail with his dog and horse he came across a little Indian boy. Night was drawing in and, with it, the cold. At night the Indian boy woke from his sleep screaming &amp;#039;Kalamakooya&amp;#039; and a great Indian chief appeared. He caused great magical things to happen. As a reward for finding and caring for his son, he gave Tex four magic feathers. One gave Dusty the power of speech, another did the same for Rocky, and the remaining two made Tex&amp;#039;s guns swivel and fire automatically whenever he was in danger.\n\nWith these four magic feathers safely in his hat, Tex maintained peace in Four Feather Falls. Mind you, many was the time when villains such as Pedro and Fernando the Mexican bandits made times hard for him. They&amp;#039;d try anything from robbing the bank to kidnapping Doc Haggerty to get themselves more dollars. Needless to say, they didn&amp;#039;t succeed.\n\nTV Times featuring Four Feather FallsThen there was Red Scalp, the renegade Indian Chief, and Big Bad Ben the bandit. Both were nasty characters and their notable schemes included trapping Little Jake and Makooya in a dangerous mine, and gun-running for enemy tribes.\n\nTex would be a man of steel at times, when his job commanded it. He was one of the nicest guys you&amp;#039;d ever meet, also. He&amp;#039;d break into a song singing the likes of &amp;#039;Happy Trail&amp;#039;. Then, of course, there was his favourite song about himself - &amp;#039;Two Gun Tex&quot;.\n\nThe sets for the series were probably the largest ever made for a puppet programme at the time, with a &amp;#039;Prairie&amp;#039; stretching some thirty feet and a full main street, where the twenty-inch high characters could act out their Western dramas. ","torrent":{"xt":"urn:btih:704979e3b748607565f67926f828dd21ae39b71a","amp;dn":"Four+Feather+Falls+01-39+DVDrip+complete+1950s+TV+series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"704979e3b748607565f67926f828dd21ae39b71a","infoHashBuffer":{"type":"Buffer","data":[112,73,121,227,183,72,96,117,101,246,121,38,248,40,221,33,174,57,183,26]},"announce":[],"urlList":[]}}