{"title":"Cinematic Titanic - Santa Claus Conquers the Martians","uid":4630839,"size":1097368492,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:71f567ee21d279f35cde83eafc3c84465d1357a5&amp;dn=Cinematic+Titanic+-+Santa+Claus+Conquers+the+Martians&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"-Marcus-","files":1,"time":1231382575,"description":"The children of Mars are in a funk, and nothing on the red planet seems to be able to cheer them up. Martian King Kimar comes up with the only reasonable solution: kidnap Santa Claus from Earth's North Pole and bring him to their planet to make toys for their joyless, listless little green kids. Meanwhile, two Earth children get wise to the plan and are abducted along with Santa to prevent them from talking to the authorities. Luckily for them, Dropo, the Jerry Lewis of the fourth planet from the sun, is there to help them. The fiendish plot doesn't go according to plan, and there's plenty of intrigue, double-crossing, mistaken identity and stock footage for kids of all ages and planets to enjoy. \n\nPoorly conceived, sloppily made, and unfailingly bizarre, 'Santa Claus Conquers the Martians' is the ultimate Christmas movie-riffing classic (as fans of MST3K know) which is why Cinematic Titanic chose to revisit, re-riff, and release this holiday hamfest with all new jokes. Merry Crap-mas!\n","torrent":{"xt":"urn:btih:71f567ee21d279f35cde83eafc3c84465d1357a5","amp;dn":"Cinematic+Titanic+-+Santa+Claus+Conquers+the+Martians","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71f567ee21d279f35cde83eafc3c84465d1357a5","infoHashBuffer":{"type":"Buffer","data":[113,245,103,238,33,210,121,243,92,222,131,234,252,60,132,70,93,19,87,165]},"announce":[],"urlList":[]}}