{"title":"Hacking Matter","uid":3426871,"size":2370583,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71f96e4f08891aec05203643915898aa74d1e236&amp;dn=Hacking+Matter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"MrPrefect","files":1,"time":1136194504,"description":"The Flick of a switch: A wall becomes a window becomes a hologram generator.  Any chair becomes a hypercomputer, any rooftop a power or waste treatment plant.\n\nProgrammable matter is probably not the next technological revolution, nor even perhaps the one after that. But it's coming, and when it does, it will change our lives as much as any invention ever has. Imagine being able to program matter itself--to change it, with the click of a cursor, from hard to soft, from paper to stone, from fluorescent to super-reflective to invisible. Supported by companies ranging from Levi Strauss to IBM and the Defense Department, solid-state physicists in laboratories at MIT, Harvard, Sun Microsystems, and elsewhere are currently creating arrays of microscopic devices called &quot;quantum dots&quot; that are capable of acting like programmable atoms. They can be configured electronically to replicate the properties of any known atom and then can be changed, as fast as an electrical signal can travel, to have the properties of a different atom. Soon it will be possible not only to engineer into solid matter such unnatural properties as variable magnetism, programmable flavors, or exotic chemical bonds, but also to change these properties at will.\n\nWil McCarthy visits the laboratories and talks with the researchers who are developing this extraordinary technology; describes how they are learning to control its electronic, optical, thermal, magnetic, and mechanical properties; and tells us where all this will lead. The possibilities are truly magical.\n\nWil McCarthy is a novelist, the science columnist for the SciFi channel, and the Chief Technology Officer for Galileo Shipyards, an aerospace research corporation. \n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/0465044298&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/0465044298&lt;/a&gt;","torrent":{"xt":"urn:btih:71f96e4f08891aec05203643915898aa74d1e236","amp;dn":"Hacking+Matter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71f96e4f08891aec05203643915898aa74d1e236","infoHashBuffer":{"type":"Buffer","data":[113,249,110,79,8,137,26,236,5,32,54,67,145,88,152,170,116,209,226,54]},"announce":[],"urlList":[]}}