{"title":"Why Does the Other Line Always Move Faster?: The Myths and Miser","uid":12830769,"size":1889881,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72814ce0f4c759e741f89038b802937507ff3b40&amp;dn=Why+Does+the+Other+Line+Always+Move+Faster%3F%3A+The+Myths+and+Miser&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1448394285,"description":"Why Does the Other Line Always Move Faster?: The Myths and Misery, Secrets and Psychology of Waiting in Line | PDF\r\n\r\n\r\nHow we wait, why we wait, what we wait for—waiting in line is a daily indignity that we all experience, usually with a little anxiety thrown in (why is it that the other line always moves faster?!?). This smart, quirky, wide-ranging book (the perfect conversation starter) considers the surprising science and psychology—and the sheer misery—of the well-ordered line. On the way, it takes us from boot camp (where the first lesson is to teach recruits how to stand rigidly in line) to the underground bunker beneath Disneyland’s Cinderella Castle (home of the world’s most advanced, state-of-the-art queue management technologies); from the 2011 riots in London (where rioters were observed patiently taking their turns when looting shops), to the National Voluntary Wait-in-Line days in the People’s Republic of China (to help train their non-queuing populace to wait in line like Westerners in advance of  the 2008 Olympics).\r\n\r\nCiting sources ranging from Harvard Business School professors to Seinfeld, the book comes back to one underlying truth: it’s not about the time you spend waiting, but how the circumstances of the wait affect your perception of time. In other words, the other line always moves faster because you’re not in it.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:72814ce0f4c759e741f89038b802937507ff3b40","amp;dn":"Why+Does+the+Other+Line+Always+Move+Faster%3F%3A+The+Myths+and+Miser","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72814ce0f4c759e741f89038b802937507ff3b40","infoHashBuffer":{"type":"Buffer","data":[114,129,76,224,244,199,89,231,65,248,144,56,184,2,147,117,7,255,59,64]},"announce":[],"urlList":[]}}