{"title":"Barack Obama - Dreams From My Father [2005/mp3/V8]","uid":4052026,"size":161417711,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:74dc8b1932de780b332f35f3c20edb611c8bb79b&amp;dn=Barack+Obama+-+Dreams+From+My+Father+%5B2005%2Fmp3%2FV8%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"p00p3don","files":108,"time":1204210522,"description":"From Publishers Weekly\n\nElected the first black president of the Harvard Law Review, Obama was offered a book contract, but the intellectual journey he planned to recount became instead this poignant, probing memoir of an unusual life. Born in 1961 to a white American woman and a black Kenyan student, Obama was reared in Hawaii by his mother and her parents, his father having left for further study and a return home to Africa. So Obama&amp;#039;s not-unhappy youth is nevertheless a lonely voyage to racial identity, tensions in school, struggling with black literature?with one month-long visit when he was 10 from his commanding father. After college, Obama became a community organizer in Chicago. He slowly found place and purpose among folks of similar hue but different memory, winning enough small victories to commit himself to the work?he&amp;#039;s now a civil rights lawyer there. Before going to law school, he finally visited Kenya; with his father dead, he still confronted obligation and loss, and found wellsprings of love and attachment. Obama leaves some lingering questions?his mother is virtually absent?but still has written a resonant book.\n\nFrom AudioFile\n\nBarack Obama, a black man raised by his white mother and grandparents, decided to journey to Kenya to learn more about his African father after receiving news of his death. This memoir is not about his father&amp;#039;s life, but about Obama&amp;#039;s, and he brings that home with an intimate tone rather than that of his public speeches. (His 2004 Democratic Convention keynote address is included at the end.) Throughout the book, the U.S. Senator looks at race from the point of view of someone who has seen and been part of a variety of cultures, and he explains how his perspective shaped his views. The book, written in 1995, before his election to the Illinois Senate, gives listeners a chance to learn more about a young senator who has recently made news by speaking out on the Patriot Act and President Bush&amp;#039;s next Supreme Court nomination.","torrent":{"xt":"urn:btih:74dc8b1932de780b332f35f3c20edb611c8bb79b","amp;dn":"Barack+Obama+-+Dreams+From+My+Father+%5B2005%2Fmp3%2FV8%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74dc8b1932de780b332f35f3c20edb611c8bb79b","infoHashBuffer":{"type":"Buffer","data":[116,220,139,25,50,222,120,11,51,47,53,243,194,14,219,97,28,139,183,155]},"announce":[],"urlList":[]}}