{"title":"NaissanceE Update.v1.1-RELOADED","uid":9663542,"size":127593878,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:758e997e584284b0066314461079e2bda511e20b&amp;dn=NaissanceE+Update.v1.1-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tenguken","files":12,"time":1393334601,"description":"NaissanceE Update v1.1 (c) Limasse Five\n\n02/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Adventure, Indie\n\nCheck the included .txt file for a list of what's new.\n\nNaissanceE is a first person exploration PC game developed on UDK by Limasse\nFive with the participation of Pauline Oliveros, Patricia Dallio and Thierry\nZaboitzeff.\nThe adventure takes place in a primitive mysterious structure and the game\nmainly consists to explore and feel the deep and strong ambiance of this\natemporal world but platforming and puzzles areas will also enrich the\nexperience.\nNaissanceE is a game, a philosophical trip and an artistic experience.\nThe game is constructed along a linear path punctuated by more open areas to\nfreely explore, some puzzles to solves and some more experimental sequences.\nGoing deeper and deeper in a primitive zone from Naissance world, the player\nwill meet entities or mechanical systems. Whether those entities are life\nforms or pure machines, they react to player presence, to light and shadow\nand they may open access to the following.\nIf most parts of the journey will require only curiosity and logic, a good\ncontrol and coordination on running, breathing and jumping actions will help\nto go through rare but exigent sequences, as an homage to old school die an\nretry games.\nThe main idea behind the game is to make the player appreciate the\nloneliness, the feeling to be lost in a gigantic unknown universe and to be\nmarvelled by the beauty of this world. A world which seems to be alive,\nleading the player, manipulating him and playing with him for any reason.\nImagination is an important key to enjoy and understand NaissanceE. Walking\nin an undiscovered abstract structure brings questions about the nature of\nthis world, about the meaning of this trip. Evocating and symbolic, the\narchitecture and events will lead player's imagination to find an answer, if\nit only matters.\n\n1. Unrar.\n2. Copy patch to install directory and run it.\n3. Copy over the cracked content from the /Crack directory to\nyour game install directory.\n4. Play the game.\n5. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:758e997e584284b0066314461079e2bda511e20b","amp;dn":"NaissanceE+Update.v1.1-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"758e997e584284b0066314461079e2bda511e20b","infoHashBuffer":{"type":"Buffer","data":[117,142,153,126,88,66,132,176,6,99,20,70,16,121,226,189,165,17,226,11]},"announce":[],"urlList":[]}}