{"title":"Which is the way to god little piglet asked - secular children s","uid":4581432,"size":32884,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76652281c0d4bc7ae972b9bb4f8a413e453e5d36&amp;dn=Which+is+the+way+to+god+little+piglet+asked+-+secular+children+s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1229442109,"description":"Which is the way to god, little Piglet asked.\n\nA controversial bedtime story\nThe German government announced Thursday that a controversial children's book critical of major world religions will not be banned.\n\nThe book is called &quot;'Which Way to God?' Asked the Piglet'&quot; and was seen by some to be overly critical of Judaism. Author Michael Schmidt-Salomon and illustrator Helge Nyncke had been accused of anti-Semitic depictions in the book. Specifically, the image of an angry rabbi led some to raise concerns that Judaism was lampooned more harshly than the other two religions treated in the book.\n\nBut the Federal Department for Media Harmful to Young Persons ruled that the book is equally critical of Christianity, Islam and Judaism, and should not be classified as anti-Semitic.\n\nSchmidt-Salomon described the decision as a &quot;victory for freedom of opinion,&quot; adding: &quot;It's an important topic -- religion must not become a taboo.&quot;\n\nThe book tells the tale of a piglet and a hedgehog searching for God, and takes a generally critical tone towards all three religions. Germany's Education Ministry formally requested an investigation of the book's content, and officials at the department that deals with harmful media began looking into the issue in October to determine whether it should be placed on its &quot;list of youth-endangering media,&quot; which would prohibit it from being sold or distributed in Germany.\n\nAccording to German news service DDP, the book's publisher, Aschaffenburg-based Alibri Verlag, has sold 12,500 copies to date. Thursday's decision would clear the way for the printing of a fourth edition, the publisher said. \n\nThe authors and the publishers have decided to publish the book in  English \nlanguage on the Web. So all people of the world have now the chance to discuss the book. \n\nfor more infor (german) you can visit the site here...\n &lt;a href=&quot;\nhttp://www.ferkelbuch.de&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ferkelbuch.de&lt;/a&gt; and see the pictures here http://www.ferkelbuch.de/buch/\n\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law) &lt;a href=&quot;\nhttp://petitions.number10.gov.uk/shariastop/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://petitions.number10.gov.uk/shariastop/&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it... &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog... &lt;a href=&quot;\nhttp://thephyrexian.tk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thephyrexian.tk/&lt;/a&gt;","torrent":{"xt":"urn:btih:76652281c0d4bc7ae972b9bb4f8a413e453e5d36","amp;dn":"Which+is+the+way+to+god+little+piglet+asked+-+secular+children+s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76652281c0d4bc7ae972b9bb4f8a413e453e5d36","infoHashBuffer":{"type":"Buffer","data":[118,101,34,129,192,212,188,122,233,114,185,187,79,138,65,62,69,62,93,54]},"announce":[],"urlList":[]}}