{"title":"Private XXX 25: Wanna Fuck (2005) - Ju Pantera,Yvette Balcano","uid":4611642,"size":1462690630,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:76af5976cf19eef6e24d4e0ca98534dfd7279e3c&amp;dn=Private+XXX+25%3A+Wanna+Fuck+%282005%29+-+Ju+Pantera%2CYvette+Balcano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pure_screens","files":6,"time":1230658178,"description":"Private XXX 25: Wanna Fuck (2005)\n\n\n\n\n\nDVD-covers + 8 screens:\n &lt;a href=&quot;\nhttp://main.blogbugs.org/4509786/Private-XXX-25---8-screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://main.blogbugs.org/4509786/Private-XXX-25---8-screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nActresses\n\n    * Angelica Wild [Anal]\n    * Christel Starr [Anal Facial Clip]\n    * Claudia [Anal Facial]\n    * Kristina Blonde (as Ivana) [Facial]\n    * Ju Pantera [Anal Facial DP A2M IR]\n    * Lorrayne [Anal Facial DP A2M IR]\n    * Oksana D'Harcourt [Anal DP IR]\n    * Terri Summers [Facial]\n    * Yvette Balcano (as Tunde) [Anal Facial DP A2M]\n    * Yesy (as Yessy) [Anal Facial]\n \n   \nScene Breakdowns\n\n    * Scene 1. Antonio Ross, Claudia, Yesy\n    * Scene 2. Joachim Kessef, Oksana D'Harcourt, William\n    * Scene 3. George Uhl, Kristina Blonde\n    * Scene 4. Andrea Moranty, Angelica Wild, Terri Summers\n    * Scene 5. Frank Gun, Mike Foster, Yvette Balcano\n    * Scene 6. Franco Roccaforte, Ju Pantera, Kid Jamaica, Lorrayne\n    * DVD Bonus. Christel Starr, Thomas Stone\n\n\n\n\nREVIEW:\n\n\nPrivate's XXX series takes scenes especially designed for this DVD from various directors and is spiced together as a conglomerate of sex scenes. It allows the viewer a taste of different directorial styles without breaking the budget. This DVD features six hardcore scenes with nine different girls from the Private stash of snatch.\n\n\nScene 1: Claudia &amp; Yessy\n\nSpangle Chics: Brazilian Clauida &amp; Colombian Yessy, start off Private's line with a little taste of South America. Both girls look really good and have a sexy appeal to them that is some times lost with the generally all-European cast. Both girls are at a photo shoot in glittery covered outfits until things get a bit out of control and the two decide to tag team their photographer. There is some outstanding double blowjob footage and a nice triangular oral sex sharing between the participants. Both girls took anal and get covered in ball juice as a liquid thank you for a job well done. This was an entertaining scene.\n\n\nScene 2: Oksana D'Harcourt\n\nSplashy Lust: French actress Oksana D'Harcourt is showing up to a club like Royalty with tons of photographers and a pair of body guards. Oksana has wild dark curly hair and a nice smile. Pretty soon we get to see her nice smile wrapped around the cocks of her two body guards. She's got a fit body and a perky natural set of tits. Before long, the Ebony &amp; Ivory body guards are tossing this little miss France from Sunday, including ravenging her once tight asshole and a double penetration. The best part of the scene was the extras just enjoying a drink standing around while Oksana get's lamblasted. The worse part of the scene were the flash bulbs going off ever few seconds. The finale ends with both guys jerking off on her little ass. A bit over-directed, but hot interracial scene from Private.\n\n\nScene 3: Ivana\n\nEight Balls and One Hole: Ivana is up for a game of pool with George Uhl. I think someone informed Ivana about how these games generally end up. Ivan is a long legged Czech who after a quick few shots on the pool table is spread eagle sucking down Goerge's hog. She's a cute brunette with a tight body and a spectacular pair of tits that look great bouncing gin doggy style. Not a whole lot of fancy on this shot that ended up with a trick cum shot right into Ivan's front pocket.\n\n\nScene 4: Terri Summers &amp; Angelika Wild\n\nTerri Summers &amp; Angelika Wild: Polish Angelika Wild &amp; Dutch covergirl Terri Summers and Penthouse Pet are out camping and sunning themselves. After a little while, tan lines become a concern, and we're off. The two rub lotion on once another until they awaken the third male member of their party and decide to work him for his lotion. This scene offers some nice pussy to mouth scene and the girls have no issue slicking each other's snatches or tasting each other off cock. Angelika takes anal before coming in Terri's mouth with a little demon seed sharing to end the scene. This scene, lacked much appeal.\n\n\nScene 5: Tunde\n\nMore Cum Please!: Yugoslavian actress Tunde is up for the next scene. She's a cute brunette, who is chained up awaiting the arrival of the director. She's wearing some fetish red boots and is put to the task of working the cum out of a pair of seasoned woodsmen. Tunde looks like she truly enjoys her work and takes every thing the guys can throw at her including anal sex, to the point here her asshole games. She takes double penetration as guys come of the woodwork to fuck her ass, and make her taste her ass off their dicks. A little taste of pure raunch from Private turns out to be a hot scene.\n\n\nScene 6: Ju Pantera &amp; Lorrayne\n\nBrazilian Delights: Brazilian cuties Ju Pantera &amp; Lorrayne close out the DVD. They are a pair of dark skinned Latina honey dips with tattoos and piercings a plenty. They take on a pair of black studs all to a light Congo type musical background. Ju takes anal with no problem, and rubs her pussy while her butt gets nailed. These two girls look like they have the potential to be a wild roll in the hay. The scene itself, unfortunately lacked heat and the performers looked as if they were going through the motions a bit.\n\n\nSummary: \nThis Compilation from the XXX line from Private has some enjoyable scenes. I also really like the trend of Private gathering ladies from places other than Eastern Europe. This DVD featured some inter-racial couplings with four of the nine women featured being from South America. I'd say Rent this DVD. You can find much better DVDs from Private. This Inter-racial aspect of this film puts it right on the cusp of a recommended favorite. \n\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:76af5976cf19eef6e24d4e0ca98534dfd7279e3c","amp;dn":"Private+XXX+25%3A+Wanna+Fuck+%282005%29+-+Ju+Pantera%2CYvette+Balcano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76af5976cf19eef6e24d4e0ca98534dfd7279e3c","infoHashBuffer":{"type":"Buffer","data":[118,175,89,118,207,25,238,246,226,77,78,12,169,133,52,223,215,39,158,60]},"announce":[],"urlList":[]}}