{"title":"Children Missing, Death train busted, Video Evidence and Proof","uid":10827831,"size":292239740,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7751ced40014bf883afc9c7a42924ed4c6b1dd16&amp;dn=Children+Missing%2C+Death+train+busted%2C+Video+Evidence+and+Proof&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":3,"time":1408590480,"description":"Children Missing, Death train busted, Video Evidence and Proof\n\nThis video has irrevocably busted the children on trains scam. This children on trains video features testimony from three different security forces, plus the original testimony from Arturo, the first man I interviewed, and as a major bonus, testimony from a man who has ridden the trains to America multiple times. \n\nAdditionally, the video has irrefutable proof the huge derailings stranding over a thousand have never happened outside of a staged media show, and additionally NAILS two charities as frauds which are setting up train derailments on private spurs and paying actors to show up as &quot;riders of the death train&quot;. All of this is irrefutably stated and proven, there will be no room for doubt that it is exactly as stated. \n\nA whistleblower from Central America informed this site: \n\n&quot;Nicaraguan mothers have been warning their kids to stay away from gringos, especially women and ESPECIALLY ones claiming to work for NGO's or missionary types. Apparently, there have been a lot of &quot;runaways&quot; and young pregnant teens going missing and the locals there are 'very suspicious' that they're being taken by these people. After thinking about it, I believe this would be a perfect plan - go to Central American countries, set up orgs to help children, once the kids are under their legal guardianship, they can then take them out of the countries without a trace and do whatever they want with them.&quot; \n\nThe train story we see in the MSM is just a psy op to keep mothers in Central America from asking too many questions about where Bobby went and the video proves it. Obviously then the &quot;children at the border meme&quot; is busted, since the trains are supposedly how they are getting there, and they are nowhere to be seen on these trains. \n\nDuring the investigation launched to produce this video, it was proven that there are no beast train derailings, and no children on these trains. This was uncovered during interviews of three diffierent security forces totally separate from each other, an additional interview of a well informed witness, and an interview of a man who was obviously secret police who rides the trains frequently to keep those who do ride safe (from what I could tell he did not do arrests). \n\nALL interviewed produced the exact same numbers for people on the trains (20-30 per day and very few (if any) children. \n\nThis video is in public domain. \nA Ferguson police public video and an important torrent file are also included. \n","torrent":{"xt":"urn:btih:7751ced40014bf883afc9c7a42924ed4c6b1dd16","amp;dn":"Children+Missing%2C+Death+train+busted%2C+Video+Evidence+and+Proof","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7751ced40014bf883afc9c7a42924ed4c6b1dd16","infoHashBuffer":{"type":"Buffer","data":[119,81,206,212,0,20,191,136,58,252,156,122,66,146,78,212,198,177,221,22]},"announce":[],"urlList":[]}}