{"title":"Bhumika.(1987)-DVD.rip-x264.AC3.Esubs-2CD-DDR","uid":14803511,"size":1565591121,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:77e4702e4bd9899f33b83774d1a434e6c84482c2&amp;dn=Bhumika.%281987%29-DVD.rip-x264.AC3.Esubs-2CD-DDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":2,"time":1465149895,"description":"\nPresenting a DDR Anniversary Upload\r\n\r\n\r\nBHUMIKA - The Role -(1987)\r\n(A film by Shyam Benegal)\r\n\r\nHindi - DVD Upscale - 720x544 (2.35:1)- 1.46 GB - x.264.AAC.Esubs - 2 Hrs:22 Min\r\n\r\nA TRIBUTE TO THE LATE SULABHA DESHPANDE\r\n \nhttps://extraimago.com/image/aekU \nhttps://extraimago.com/image/aekM \nhttps://extraimago.com/image/aek9 \nhttps://extraimago.com/image/aek3 \nhttps://extraimago.com/image/aekb \nhttps://extraimago.com/image/aekh \nhttps://extraimago.com/image/aekd \nhttps://extraimago.com/image/aekI \nhttps://extraimago.com/image/aekl \nhttps://extraimago.com/image/aeki \nhttps://extraimago.com/image/aekm \nhttps://extraimago.com/image/aekR \nhttps://extraimago.com/image/aekL\r\n\r\nTech Specifications:\r\n \nhttp://extraimago.com/image/aekq\r\n\r\nSynopsis:\r\nBhumika is the story of Usha (Smita Patil), a girl born in a family of Devadasis and groomed in classical music by her Grandmother. Her father dies early and Her mother Shanta (Sulabha Deshpande) become dependent on Keshav (Amol Palekar) a man much older than her. Perhaps its her dependancy on keshav, or perhaps because he was always there to support her as a child, Usha marries Keshav and even bears him a daughter. Keshav takes Usha to the city, where thanks to her singing and her vivacity, she lands roles in films. In a short while she becomes the sole breadwinner of the family supplanting Keshav, whose businesses have not done well.\r\n\r\nBut Keshav, fanned by film magazine gossip, starts doubting Usha. Fed up with domestic violence, Usha leaves her mother and daughter and seeks refuge with the film hero Rajan (Anant Nag). Then comes a series of relationships with Sunil Verma the Director (naseeruddin Shah), a producer (Kulbhushan Kharbanda) and finally a rich businessman (Om Puri) who treats her as a trophy second wife and robs her of her basic freedoms. All the while her career flourishes but Usha is desperately unhappy.\r\n\r\nIn desperation she turns to Keshav, who finally brings her home to her daughter.\r\n\r\n\r\nComments:\r\nBhumika, is a captivating journey of Usha, effortlessly portrayed by Smita Patil. Usha goes through a transformation from a rebellious young girl to a deeply-marred middle-aged woman. Her journey as an actress, a wife and the sole bread-earner of her family, transforms the vivacious young girl within her, into a wise, unconventional, self-driven and immensely passionate actress who is deeply wounded by life’s trials and tribulations, many of them forced upon her by her old husband. Bhumika is a must-watch, as its protagonist isn’t a typically likable woman – she is a multi-layered, flawed woman, used and abused by the men in her life.\r\n\r\nIts a film that has the who's who of famed actors and actresses of the Hindi film world and each plays his or her part with elan, under the guidance of the great Shyam benegal. I often feel that this was Benegal's greatest film with more nuances than any other.\r\n\r\nIt has some fine songs crafted by Vanraj Bhatia and splendid camerawork by the great Govind Nihalani as added attractions.\r\n\r\nThe late Sulabha Deshpande was a splendid actress, both on the stage and in Hindi and marathi Cinema. With this film, we at DDR seek to pay a tribute to her and celebrate her wonderful contribution to Indian Cinema.\r\n\r\nI am sure you will have seen this film before. If you haven't, it is a must see - a classic of Indian cinema. Even if you have seen it before, watch this rip, for the reasons given in the uploaders notes.\r\n\r\nUploader's Notes:\r\n\r\nYou would enjoy watching this rip. We started with a horribly authored DVD, broke it up into 16 parts, some color and some B&amp;W, all of which had different frame sizes. We then painstakingly brought them into one size without creating any distortion or cutting out anything of importance. Each of the 16 parts were then individually encoded and the final parts woven together to bring you this rip.\r\n\r\nWe bring you this rip on the day DDR completes 8 years in bringing you the best of Indian Cinema.\r\n\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt0075747/","torrent":{"xt":"urn:btih:77e4702e4bd9899f33b83774d1a434e6c84482c2","amp;dn":"Bhumika.%281987%29-DVD.rip-x264.AC3.Esubs-2CD-DDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77e4702e4bd9899f33b83774d1a434e6c84482c2","infoHashBuffer":{"type":"Buffer","data":[119,228,112,46,75,217,137,159,51,184,55,116,209,164,52,230,200,68,130,194]},"announce":[],"urlList":[]}}