{"title":"La huida de Morgan [ebook].","uid":6084147,"size":8762284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7838a3177e07674810f43770ab87955f292eb329&amp;dn=La+huida+de+Morgan+%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zurera","files":-1,"time":1294246755,"description":"Bristol, Inglaterra, 1787, en vÃƒÂ­speras de una de las migraciones mÃƒÂ¡s importantes de la historia. Cientos de prisioneros iban a ser arrancados de su tierra natal y forzados a emprender un duro viaje por mar para poblar tierras desconocidas y hostiles. Durante la dilatada travesÃƒÂ­a, los convictos se enfrentaron con valor al trato brutal infligido por los oficiales britÃƒÂ¡nicos, pero sÃƒÂ³lo algunos lograron desembarcar el 19 de enero de 1788. Abandonados a su suerte en tierras australianas, su llegada serÃƒÂ­a sÃƒÂ³lo el principio de una larga odisea. Richard Morgan, uno de aquellos convictos, pronto logrÃƒÂ³ ganarse la admiraciÃƒÂ³n de sus compaÃƒÂ±eros. Inteligente, seductor y de voluntad fÃƒÂ©rrea, se rebelarÃƒÂ­a ante a la injusticia de su situaciÃƒÂ³n y afrontarÃƒÂ­a con coraje todas las adversidades. En su lucha por hacerse un sitio en su tierra de adopciÃƒÂ³n, Morgan habrÃƒÂ­a de conocer el lado mÃƒÂ¡s cruel del ser humano, pero tambiÃƒÂ©n el amor y la amistad mÃƒÂ¡s sinceros.\n\nTras el ÃƒÂ©xito de El pÃƒÂ¡jaro espino, que le dio fama internacional, Colleen McCullough retoma su Australia natal como escenario para su nueva gran novela histÃƒÂ³rica. SirviÃƒÂ©ndose de la trayectoria heroica de Richard Morgan como hilo conductor, La huida de Morgan; parte de episodios histÃƒÂ³ricos reales para narrar la increÃƒÂ­ble epopeya de los primeros colonos en Australia","torrent":{"xt":"urn:btih:7838a3177e07674810f43770ab87955f292eb329","amp;dn":"La+huida+de+Morgan+%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7838a3177e07674810f43770ab87955f292eb329","infoHashBuffer":{"type":"Buffer","data":[120,56,163,23,126,7,103,72,16,244,55,112,171,135,149,95,41,46,179,41]},"announce":[],"urlList":[]}}