{"title":"Tony Monaco - Live At Cotton Club Japan","uid":9696564,"size":178208280,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:798632c29186d6cc24228819cb6a886b3525d7f0&amp;dn=Tony+Monaco+-+Live+At+Cotton+Club+Japan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1393943485,"description":"Tony Monaco, Yosuke Onuma &amp; Gene Jackson - Live At Cotton Club Japan\n\nLabel: Boundee\nReleased: 2013\n\nTracklist:\n01. Answering Service (8:48)\n02. Nice To Be With You (9:49)\n03. Happy Play Ground (9:09)\n04. Aglio E Olio (9:35)\n05. Happy Sergio (9:55)\n06. Called Love (7:49)\n07. Slow Down Sagg (10:24)\n08. I'll Remember Jimmy (8:28)\n\nTime: 74:01\n\nPersonnel:\nTony Monaco, Hammond B-3 organ, vocal\nYosuke Onuma, guitar\nGene Jackson, drums\n\nFormat: MP3 320 kbit/s. All songs are tagged by the book.\n\n--------\n\nTony Monaco is a leader in a revival of the Hammond B-3 organ in jazz. As he has been with so many fledgling jazz organists, Jimmy Smith played a significant role in attracting Monaco to jazz and retaining his interest in the music. Monaco was 12 years old when he first heard Smith and, as a 16th birthday present, got a phone call from the organ giant. The culmination of this association came when Smith invited the young performer to join him at Smith's club. Monaco has also been fortunate to spend time with other jazz organ masters, including Hank Marr and Dr. Lonnie Smith. He started subbing for players, like Marr, in and around Columbus, OH, when he was just 16. Monaco has also been helped along by one of his peers, Joey DeFrancesco, who produced Monaco's first album, Burnin' Grooves, and joined the session on piano. Monaco added horns to his second album, Master Chops T, released in 2002, giving the Hammond organ player much more flexibility to the arrangements. It also allowed him to take full advantage of the rhythmic invention the electric organ allows its players to engage in. A live follow-up, Intimately Live, followed later that year. In addition to his albums as leader, Monaco has recorded with Eric Neymeyer and neo-bop guitarist Mark Elf. Monaco doesn't rely entirely on his jazz work to support his family. He and his brother run and own a concrete construction business. When not performing or building, Monaco listens to other masters of the organ, including Smith, Richard 'Groove' Holmes, and Larry Goldings. \n\n--------\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n--------\n\nL Hammond, The Pirate Bay, where you'll find more jazz organ.\n\n","torrent":{"xt":"urn:btih:798632c29186d6cc24228819cb6a886b3525d7f0","amp;dn":"Tony+Monaco+-+Live+At+Cotton+Club+Japan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"798632c29186d6cc24228819cb6a886b3525d7f0","infoHashBuffer":{"type":"Buffer","data":[121,134,50,194,145,134,214,204,36,34,136,25,203,106,136,107,53,37,215,240]},"announce":[],"urlList":[]}}