{"title":"Joseph: King of Dreams (ENG-FR-SP) PAL","uid":3606071,"size":4680841216,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7ac477b405cfee7f844e45342a3842f1f870975a&amp;dn=Joseph%3A+King+of+Dreams+%28ENG-FR-SP%29+PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"guillermopuertas","files":66,"time":1170096931,"description":"#: Technical data\nDirector Rob LaDuca, Robert C. Ramirez\nCast\nLength 75 min\nDistributor Paramount\nDiscs 1\nRegion 2\nVideo Pal\nWidescreen 1.85:1, 16:9\nLanguages Dolby Digital 5.1: English, French, Spanish\nSubtitles English for deaf people\nSynopsis\n\nFrom the studio that brought you the Academy Award-winning epic The Prince of Egypt comes an all-new animated movie, Joseph: King of Dreams, premiering only on video and DVD. Based on the classic tale that has been revered through the ages, Joseph: King of Dreams is the thrilling account of a boy whose unique gifts lead him on an extraordinary journey. This inspiring all-new musical animated adventure brings the vibrant story to colorful life, showing us that we all have special gifts that can help us overcome obstacles. Brimming with action and drama, this universally loved story is still germane to todays families. Joseph: King Of Dreams retells the story of how a boys extraordinary gift of seeing the future in his dreams sparks a deep division in his family. The youngest of eleven brothers, Joseph is seen as his fathers favorite. Jealous of this preferential treatment, the brothers sell Joseph to slave traders who take him against his will to the exotic world of ancient Egypt. Uprooted from his home, Joseph is suddenly thrown into a new life filled with high adventure, hidden intrigue and blossoming romance. After many trials and tribulations in this new land, Joseph is ultimately asked by the Pharaoh himself to interpret his troubling royal dreams. In doing so, Joseph saves Egypt from disaster and is rewarded with honor and status. As he rises to power, Joseph finds love and happiness. But a sudden twist of fate reunites him with his brothers, and the heroic young man must face a decision that has affected us all -the decision of forgiveness.\nOther features\n\nInteractive Menus, Scene Access, Story Boards, Theatrical Trailers, Produccition Notes","torrent":{"xt":"urn:btih:7ac477b405cfee7f844e45342a3842f1f870975a","amp;dn":"Joseph%3A+King+of+Dreams+%28ENG-FR-SP%29+PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ac477b405cfee7f844e45342a3842f1f870975a","infoHashBuffer":{"type":"Buffer","data":[122,196,119,180,5,207,238,127,132,78,69,52,42,56,66,241,248,112,151,90]},"announce":[],"urlList":[]}}