{"title":"The Health Wyze Report - Episode 23","uid":7269431,"size":44165292,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7b9d0b08048252c247e160feb1875dbe01408370&amp;dn=The+Health+Wyze+Report+-+Episode+23&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mandalasarah","files":-1,"time":1337004762,"description":"This episode features guest William Kay, M.D., who is the first medical partner of The Health Wyze Report. He is a former surgeon who now operates as a health advocate. As an independent health advocate, he is no longer encumbered by corporate forces and corrupt medical establishment restrictions. This freedom allows him to advise his patients in a refreshingly honest and comprehensive manner. His departure from institutionalized medical care happened after the death of one of his surgical patients. Dr. Kay then decided that he could no longer silently condone the status quo of modern medicine. He literally walked out of the hospital, and he never looked back. In the show, Will mentions the high price he repeatedly paid for trying to do the right thing, and the fear games that are used to keep doctors under tight control.\n\nWill discusses how textbook brain washing techniques are used during every doctor's residency, how the true purpose of medical licensing is to suppress dissent and stifle innovation, how maintaining a license is just a matter of popularity amongst peers and whatever they vote to be the &quot;standard of care&quot;, how licensing is in no way related to actual performance, how all alternative methodologies are prevented at the local level for the sake of maintaining the prevalence of more expensive treatments regardless of efficacy, Will's personal experience with improving patient care and the subsequent vengeance of his colleagues, how &quot;smart doctors&quot; are the ones who make bad decisions to keep hospital administrators happy, how any disagreement can get a doctor permanently banned from medical practice and charged with &quot;being disruptive&quot;, how hospitals casually harm patients to save money and then redirect that money into marketing efforts, Will's personal experiences with how ineffective and unscientific modern medicine has become, the new abomination of preventively removing organs and the breasts when the patient is healthy, the shockingly early menstrual cycles in five-year-old girls, the new protocol of using drugs to mask the horrible effects of other drugs regardless of the long term damage to the patient's health, how modern doctors relish their power and control over patients and describe it with the phrase &quot;patient compliance&quot;, how modern doctors work with child protective agencies to break-up families who dare challenge their authority or suggest alternatives by citing the justification of medical neglect, how hospital bioethics boards decide that certain parent's wishes are to be ignored by hospital staff members and they sometimes even mandate surgeries for children against the parent's wishes, how school systems use terrorism and various manipulation games to enforce vaccinations on children even though child vaccinations are not actually mandatory, and finally, Will explains what he does as a health advocate and how he finally has the freedom to truly help people.","torrent":{"xt":"urn:btih:7b9d0b08048252c247e160feb1875dbe01408370","amp;dn":"The+Health+Wyze+Report+-+Episode+23","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b9d0b08048252c247e160feb1875dbe01408370","infoHashBuffer":{"type":"Buffer","data":[123,157,11,8,4,130,82,194,71,225,96,254,177,135,93,190,1,64,131,112]},"announce":[],"urlList":[]}}