{"title":"The Long Earth books 1 and 2  by Terry Pratchett (epub and mobi)","uid":9353521,"size":2130116,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7bb5f17dccb33860370e20efc4f941d04e1d268b&amp;dn=The+Long+Earth+books+1+and+2++by+Terry+Pratchett+%28epub+and+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":4,"time":1387184214,"description":"Terry Pratchett  Stephen Baxter - The Long Earth.epub\nTerry Pratchett  Stephen Baxter - The Long Earth.mobi\nThe Long War - Terry Pratchett.epub\nThe Long War - Terry Pratchett.mobi\n\n\n\n1916: the Western Front. Private Percy Blakeney wakes up. He is lying on fresh spring grass. He can hear birdsong, and the wind in the leaves in the trees. Where has the mud, blood and blasted landscape of No Man's Land gone?\n\n2015: Madison, Wisconsin. Cop Monica Jansson is exploring the burned-out home of a reclusive (some said mad, others dangerous) scientist when she finds a curious gadget - a box containing some wiring, a three-way switch and a...potato. It is the prototype of an invention that will change the way Mankind views his world for ever.\n\nAnd that is an understatement if ever there was one...\n\n---------------------------------------------------------------------------------------\n\n\nA generation after the events of The Long Earth, mankind has spread across the new worlds opened up by Stepping. Where Joshua and Lobsang once pioneered, now fleets of airships link the stepwise Americas with trade and culture. Mankind is shaping the Long Earth - but in turn the Long Earth is shaping mankind ... A new 'America', called Valhalla, is emerging more than a million steps from Datum Earth, with core American values restated in the plentiful environment of the Long Earth - and Valhalla is growing restless under the control of the Datum government...\n\nMeanwhile the Long Earth is suffused by the song of the trolls, graceful hive-mind humanoids. But the trolls are beginning to react to humanity's thoughtless exploitation ... Joshua, now a married man, is summoned by Lobsang to deal with a gathering multiple crisis that threatens to plunge the Long Earth into a war unlike any mankind has waged before.\n","torrent":{"xt":"urn:btih:7bb5f17dccb33860370e20efc4f941d04e1d268b","amp;dn":"The+Long+Earth+books+1+and+2++by+Terry+Pratchett+%28epub+and+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bb5f17dccb33860370e20efc4f941d04e1d268b","infoHashBuffer":{"type":"Buffer","data":[123,181,241,125,204,179,56,96,55,14,32,239,196,249,65,208,78,29,38,139]},"announce":[],"urlList":[]}}