{"title":"Renowned Explorers: International Society (GOG)","uid":12357432,"size":710309174,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7bfc2ea4954b49f67c4e8aa2aad37098dec674b7&amp;dn=Renowned+Explorers%3A+International+Society+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mercs215","files":3,"time":1441491681,"description":"Install instructions:\n1. Run &quot;setup_renowned_explorers_2.0.0.4&quot;\n2. Play\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS GAME! :)\nIf you like this game, support the developers and BUY IT!\n\nTitle: RENOWNED EXPLORERS: INTERNATIONAL SOCIETY\nGenre: Strategy - Adventure - Historical\nWorks on: Windows (7, 8, 10)\nLanguages: Audio and text: English\nModes: Single-player\nReleased: September 2, 2015\nSize: 676.9 MB\nCompany: Abbey Games / Abbey Games\nStore page: https://www.gog.com/game/renowned_explorers\n\nAbout:\nTake command of a hand-picked group of diverse explorers and travel across the globe in search of legendary treasures while staying ahead of your rivals. Earn prestige in the International Society and become the world's most Renowned Explorer!\nVisit lost temples, forgotten cities and untamed wilderness to discover magnificent treasures. Find your way past wolves, smugglers and angry locals to become known as a fearless explorer. Every expedition has challenging encounters and your nemesis Rivaleux will take any chance to thwart your efforts.\nSelect your band of adventurers carefully! Each of the 20 explorers has their own expertise and character traits when dealing with conflicts. Choose among Fighters, Scouts, Speakers and Scientists and find out the best way to use their talents.\nAcquire knowledge, get rich, or become famous by completing procedurally generated expeditions. Use these resources to get the skills, support and equipment you need for your next endeavor.\nApproach the locals consciously when running into a conflict;\n- Fight them with Melee, Ranged and Area of Effect attacks,\n- win them over using Cheers, Charms and Compliments, \n- or scare them away by Insults, Taunts and Humiliation\nEvery encounter is a new challenge with many solutions and it's up to you to build a reputation. Are you a diplomat, a schemer or a fighter..?\nStart your adventure now!\nExplore the far corners of the world in the age of discovery, outsmart your rivals, campaign for fame and become the most Renowned Explorer of the 19th century\nLive your own adventures; get to know your explorers with their own character traits, skills and quirks, manage their progression while hunting for the most prestigious treasures\nPrepare your treasure hunt; collect Insight, Research, Gold and Status on your expeditions to acquire supplies and support for the next adventure\nAttitude-based gameplay; choose the best course of action by engaging your opponents physically and mentally using charm, deception, intimidation or a show of force\nThere is always something new to discover in the thrilling procedurally generated expeditions, where your reputation opens up new opportunities\n\nMinimum system requirements - Windows: Windows 7 / 8 / 10\nProcessor: AMD Dual-Core running at 2.6 GHz / Intel Dual-Core processor running at ~1.9 GHz (AMD Athlon 64 X2 5200+ and Intel Core 2 Duo E6300 or newer series are the oldest CPU architectures recommended).\nMemory: 2048 MB RAM\nGraphics: AMD/NVIDIA dedicated/integrated or mobile graphic card, Intel integrated or mobile graphic card, with at least 512MB of dedicated VRAM AMD Radeon HD 3450, NVIDIA GeForce 9600 GT and Intel HD Graphics (Sandy Bridge) and above are minimum required graphic cards.\nDirectX: Version 10\nHard Drive: 2 GB available space\nSound Card: Integrated or dedicated DirectX 9.0c compatible soundcard.\nKeyboard, mouse","torrent":{"xt":"urn:btih:7bfc2ea4954b49f67c4e8aa2aad37098dec674b7","amp;dn":"Renowned+Explorers%3A+International+Society+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bfc2ea4954b49f67c4e8aa2aad37098dec674b7","infoHashBuffer":{"type":"Buffer","data":[123,252,46,164,149,75,73,246,124,78,138,162,170,211,112,152,222,198,116,183]},"announce":[],"urlList":[]}}