{"title":"Baseball Mogul 2008","uid":4238905,"size":99076492,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7c5190175b4ba8bdbcd0eb93d83f5965019be1ed&amp;dn=Baseball+Mogul+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"amputatedlife","files":3,"time":1213440632,"description":"\nBaseball Mogul has come a long way in the nine years since its opening day. The game started in 1998 as a straightforward economic simulation of what it would be like to run a big-league ballclub, with a focus on winning the World Series and setting the perfect price for stadium suds. It isn&amp;#039;t quite like that anymore. Competition from more involved sims, such as Out of the Park Baseball, has tilted the diamond, forcing designer Clay Dreslough to move from simplicity to stats. Thus, Baseball Mogul 2008 is a snapshot of evolution in progress, a sports management sim in transition that gives baseball gearheads lots of numbers to crunch while still maintaining the fantastic pick-up-and-play playability, which made this franchise such a hit in the first place.\n\n\nBeing able to watch the key pitch in each at-bat really livens up those tight playoff games in October.\n\nIf you haven&amp;#039;t played a Baseball Mogul game in a while, chances are you&amp;#039;ll be amazed at how much has been added to the series in recent years. Where fans once rightly complained that the game didn&amp;#039;t even track such core baseball numbers as lefty-righty splits, the game now lets you look over everything. Eighty player stat categories are now available for your perusal, so you can check out everything, including obvious biggies, such as home runs and ERA; more intricate stuff, such as OPS and GIDP; and flat-out esoterica, such as isolated power and RTO percentage. Stats for your entire baseball universe can also be examined in the new online encyclopedia, which tracks team and player stats, as well as financial records from the minors to the majors. All of these numbers allow you to pick apart your rosters and spend hours tinkering with batting lineups and pitching rotations. Scouting reports have also been beefed up, giving you the ability to give youngsters a once-over, as well as check out such stats as DICE and ground-ball percentage.\n\nEven though Baseball Mogul 2008 has become something of a stat-heavy showcase, the game retains its simple charm. You don&amp;#039;t have to embrace your inner Bill James to enjoy running a ballclub. Success can be had by sticking to the same old principles that have governed the series since its beginning. So if you want to stick to the basics, you can field a winning team and make a few bucks by just signing players. You can also order up the odd trade and set a sensible going rate for tickets, beer, hot dogs, or ice cream.\n\nAlso, the game isn&amp;#039;t all about the numbers. Unlike all of the other baseball management sims, Baseball Mogul 2008 has a strong visual element. Although the interface comprises largely generic Windows menus and boxes that give the game too much of a spreadsheet vibe, a new ticker bar rolls by along the bottom of the screen at all times, keeping you current on league stats and standings. A full graphical engine also lets you watch the key pitch from each at-bat when manually simming games. Hits are mixed up by a new physics engine, so you never see the same play twice. And the artificial intelligence manages a smart game against you, adroitly pulling pitchers and inserting pinch hitters. It even plays a conservative, station-to-station game and favors the bunt to move runners in the later innings of tight games. Aside from one annoying problem with audio syncing that has the sound of the ball smacking into the glove while the ball is still in flight onscreen, the presentation really brings games to life. It&amp;#039;s certainly a big improvement over the bland stat screens and repetitive textual play-by-play commentary in other sports sims.\n\n\nBabe just what he&amp;#039;s worth in 1927 thanks to a revamped historical financial system.\n\nAnother plus is enhanced support for historical leagues. Even though Baseball Mogul has used the Lahman Database to let players start leagues in any season from 1901 to current day for a few iterations now, it has always seemed like an afterthought because of problems with teams not moving when they should and such weirdness as modern salaries in the dead-ball era. However, these issues have been fixed this year, so you&amp;#039;ll see Babe Ruth making a historically correct $50,000 or so instead of $15,000,000. You&amp;#039;ll also see the Brooklyn Dodgers automatically pick up and head west in 1957. But cities don&amp;#039;t change over the years, so you&amp;#039;re stuck with 2007 populations and wealth no matter what year you choose to start building your baseball empire.\n\nWith Baseball Mogul 2008, this franchise is moving back to the top of the order. After a few years where it seemed out of date when compared to more high-powered simulations, such as OOTP, the game is clearly improving. It still isn&amp;#039;t quite all things to all baseball fans, because its online component is little more than an ad for the separate Baseball Mogul online game, and hardcore stat fans will continue to find everything a little light for their tastes. But the game remains a great everyman sports sim, now with a little something extra.\n","torrent":{"xt":"urn:btih:7c5190175b4ba8bdbcd0eb93d83f5965019be1ed","amp;dn":"Baseball+Mogul+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c5190175b4ba8bdbcd0eb93d83f5965019be1ed","infoHashBuffer":{"type":"Buffer","data":[124,81,144,23,91,75,168,189,188,208,235,147,216,63,89,101,1,155,225,237]},"announce":[],"urlList":[]}}