{"title":"Heroes of Might and Magic III &amp; IV Complete Collection","uid":10723638,"size":8453211743,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7c98c78cbb3b157edd0b4237d380330ee0ff4173&amp;dn=Heroes+of+Might+and+Magic+III+%26amp%3B+IV+Complete+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":3,"time":1407522145,"description":"Now you can get the complete Heroes of Might and Magic III experience in one value package. This monster bundle will keep players building towns, raising armies, casting spells, and conquering foes for months. Look at all that awaits: 86 standalone missions, 14 campaigns, 38 single-scenario maps, quests for 138 magical artifacts (including 12 powerful combination artifacts), 8 town types to build and conquer, 16 hero classes, 145 combat units, and hundreds of adventure structures. Heroes of Might and Magic IV Complete contains the original campaign and the two expansion packs. Choose from 11 classes of Hero, 5 schools of Magic and 18 adventure filled campaigns. Includes multiplayer battles via LAN and Internet, new objects featuring armour, weapons, and even catapults along with creatures including Goblin Knights, Gargantuans, and Evil Sorceresses.\n\nHeroes of Might and Magic III + IV Complete is a Compilation game, developed by New World Computing and published by Sold Out Software, which was released in Europe in 2008.\n\nThis compilation combines Heroes of Might and Magic III Complete and Heroes of Might and Magic IV Complete in a single package. It combines the two base games with two add-ons each. The following is included:\n\n- Heroes of Might and Magic III (base game)\n- Heroes of Might and Magic III: Armageddon's Blade (add-on)\n- Heroes of Might and Magic III: The Shadow of Death (add-on)\n- Heroes of Might and Magic IV (base game)\n- Heroes of Might and Magic IV: The Gathering Storm (add-on)\n- Heroes of Might and Magic IV: Winds of War (add-on)\n\n1. Burn or mount image\n2. Install the game\n3. Play the game","torrent":{"xt":"urn:btih:7c98c78cbb3b157edd0b4237d380330ee0ff4173","amp;dn":"Heroes+of+Might+and+Magic+III+%26amp%3B+IV+Complete+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c98c78cbb3b157edd0b4237d380330ee0ff4173","infoHashBuffer":{"type":"Buffer","data":[124,152,199,140,187,59,21,126,221,11,66,55,211,128,51,14,224,255,65,115]},"announce":[],"urlList":[]}}