{"title":"Accept - Balls To The Wall","uid":4876338,"size":164452356,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7cc09e4295ed3036476a99e1c4d6d8fdf900fb29&amp;dn=Accept+-+Balls+To+The+Wall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1241146574,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nBalls to the Wall is the fifth album by the German metal band Accept, released in 1983 in Germany and 1984 in the United States. It is the band's best known and highest-selling album, selling about two million copies worldwide, and is Accept's only record to attain Gold certification in America.\n\nSome of the album's success can no doubt be attributed to the publicity generated from the minor &quot;gay metal&quot; controversy that broke out upon its American release, due to the record's title and front cover being deemed by some as homoerotic, as well as the lyrics to &quot;London Leatherboys&quot; and &quot;Love Child&quot; appearing to concern homosexuals. Guitarist Wolf Hoffmann was dismissive of the controversy, saying years later that &quot;You Americans are so uptight about this. In Europe it was never a big deal...we just wanted to be controversial and different and touch on these touchy subjects, because it gave us good press and it worked fabulously, you know&quot;. Drummer Stefan Kaufmann explained that many of the themes on the album were about oppressed minorities in general. &quot;London Leatherboys&quot; was really about bikers, for example: &quot;They're normal people, they just look different and they behave different. But they're normal people, another minority. And 'Love Child' was about gays, true, but it's basically about people who are suppressed.&quot;\n\nHoffman's wife and lyricist Gaby Hauke also denied these controversies and accusations concerning the gay issue:\n\n&quot;Let me answer this and (the next) question in one, ok? I have been very rebellious and by no means I would have written anything &quot;normal&quot;! Never! The sexual question about the context of certain lyrics are mind games and pure interpretation from outsiders. This is a band who has as individuals -so little to do with controversy and absolutely nothing in particular with anything but being VERY straight&quot;\n\nCritic Martin Popoff has declared Balls To The Wall the greatest metal album of the 1980s, praising the combination of smooth production, powerful guitar riffs and strong melodies that are found throughout the record. Professional wrestler Chris Jericho's band, Fozzy, remade this song. \n\nThe album's best known song, which became Accept's signature tune, is the anthemic title track, for which a music video was shot that received airplay on MTV. Hoffmann explained the song's meaning: &quot;We've always been interested in politics and in human rights and things like that, so a lot of the lyrics that we had in those days, and to the end actually, were dealing with human rights, for instance, and that's really what &quot;Balls To The Wall&quot; is all about. &quot;One day the tortured will stand up&quot; and kick some ass!&quot; The video later appeared on Beavis and Butt-head in the 1993 episode &quot;Tornado&quot;. The song has also been featured on two VH1 countdown shows: as #38 on the 40 Greatest Metal Songs, and as #29 on the 40 Most Awesomely Bad Metal Songs Ever. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7cc09e4295ed3036476a99e1c4d6d8fdf900fb29","amp;dn":"Accept+-+Balls+To+The+Wall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cc09e4295ed3036476a99e1c4d6d8fdf900fb29","infoHashBuffer":{"type":"Buffer","data":[124,192,158,66,149,237,48,54,71,106,153,225,196,214,216,253,249,0,251,41]},"announce":[],"urlList":[]}}