{"title":"TSR Watermark Image Pro v3.5.4.2 Incl Keymaker-BRD [TorDigger]","uid":13215540,"size":10640927,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d9d7f9ea65dffa151798ab0194afb7af7f20803&amp;dn=TSR+Watermark+Image+Pro+v3.5.4.2+Incl+Keymaker-BRD+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":10,"time":1452693472,"description":"TSR Watermark Image \r\n\r\nTSR Watermark Image software, is a free program for personal use that can add digital watermarks to all your images, photos and pictures with the transparency you decide. The program can also resize the images before the digital watermark is added. \r\n\r\nIf you want to watermark your photos, you can use either text or another picture as the source of the watermark. If you want to add the watermark to the background, you can set the logo or the text to be more or less transparent, and place it wherever you want the watermark to be on the image. \r\n\r\nFeatures \r\n\r\nMultilanguage support, Greek, Lithuanian, Turkish, Slovak, Swedish, Armenian, English, German, Italian, Vietnamese, Japanese, Hungarian, Czech, Romanian, Serbian, Spanish, Finnish, French, Hebrew, Dutch, Portuguese (Brazilian &amp; Portugal), Chinese (Simplified &amp; Traditional), Indonesian, Russian, Polish and Danish is supported. \r\nAdd multiple watermarks to each photo. \r\nSave each images at multiple output folders, this way you can easyli generate thumbnails etc. in one run. \r\nAdd text watermark that is either normal, embossed, chiseled or watermarked with a border. \r\nAutomatically rotate the watermarked picture based on the orientation EXIF tag - this is written to the image by many modern cameras. \r\nAdd the text used to watermark the image to the EXIF information in the resulting file. \r\nKeep or drop EXIF information in jpeg files (Camera model/lense model/etc. etc.) \r\nOutput the watermarked photo to JPEG, TIFF, PNG, BMP, GIF file format. \r\nSpecify the quality of the watermarking output when saving as jpeg images \r\nAngle the text you use for your photo watermarking \r\nInsert background watermark in digital images, pictures, photos \r\nResize images while watermarking the image/photo \r\nWatermark your photos using either another image, photo or picture \r\nWatermark your photos using your own text in the color and style you want to. \r\nMaintain directory structure in destination directory or combine all batch watermarked images into one directory \r\nSkip or overwrite existing watermarked images/photos in destination directory \r\nCommand line option to automatically load a profile and batch watermark all photos. \r\nAutomatically check for new version of the TSR Watermark Image Software \r\n\r\nVersion 3.5.4.2 - 01 Jan 2016 \r\nChanged the way the watermarking is done to save some memory and speed up performance Minor GUI changes HAPPY NEW YEAR! \r\n\r\nSupported OS:\r\n\r\nWindows XP, Windows server 2003, Windows Vista, Windows server 2008, Windows 7, Windows 8/8.1, Windows 10 - with .NET framework 2.0 or higher installed. \r\n\r\nHomepage: http://www.watermark-image.com/ \r\n\r\nInstallation Instructions: \r\n\r\n- Install program. \r\n- Use Keymaker to register application. \r\n- Done, Enjoy. \r\n\r\nHave A Nice Day \r\n\r\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems","torrent":{"xt":"urn:btih:7d9d7f9ea65dffa151798ab0194afb7af7f20803","amp;dn":"TSR+Watermark+Image+Pro+v3.5.4.2+Incl+Keymaker-BRD+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d9d7f9ea65dffa151798ab0194afb7af7f20803","infoHashBuffer":{"type":"Buffer","data":[125,157,127,158,166,93,255,161,81,121,138,176,25,74,251,122,247,242,8,3]},"announce":[],"urlList":[]}}