{"title":"Quick Bites - Jennifer Rardin","uid":9257783,"size":2037035,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7dbec21f426e78a62a30358906749314885e9485&amp;dn=Quick+Bites+-+Jennifer+Rardin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1385578768,"description":"Now, together in one place for the first time, Quick Bites combines Jennifer Rardin's short stories into a wild ride of vampires, zombies, and voodoo that is impossible to put down. This omnibus includes short stories set in the popular Jaz Parks world &quot;Scouting Jasmine,&quot; &quot;The Golem Hunt,&quot; &quot;An Evening with Jaz and Vayl.&quot;\n\nScouting Jasmine: Jaz Parks is on the hunt for a politically-powerful vampire; but little does she know that she herself is being hunted - by her future boss, Vayl. In this exciting short story that takes place prior to &quot;Once Bitten, Twice Shy,&quot; Vayl sees Jaz in action for the very first time.\n\nThe Golem Hunt: A rabbi raises a terrifying ancient creature - the golem - to protect his congregation, but the results are far bloodier than he could ever have imagined. Now, Jaz and Vayl, the CIA's top assassins, must hunt down the golem and end its reign of terror. The events of this short story take place between Biting the Bullet and Bitten to Death, books 3 and 4 of the Jaz Parks series\n\nAn Evening with Jaz and Vayl: A great little in-between short story with just Jaz and Vayl. Told in alternating narratives it's nice to get Vayl's perspective and feelings on Jaz since the main story series is told from her point of view.","torrent":{"xt":"urn:btih:7dbec21f426e78a62a30358906749314885e9485","amp;dn":"Quick+Bites+-+Jennifer+Rardin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dbec21f426e78a62a30358906749314885e9485","infoHashBuffer":{"type":"Buffer","data":[125,190,194,31,66,110,120,166,42,48,53,137,6,116,147,20,136,94,148,133]},"announce":[],"urlList":[]}}