{"title":"Neil Young - Tonight's The Night (1975/2014) 24 bit/192 kHz ","uid":11762737,"size":1620269181,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7e008461bec632b5b51e98f162e3745b9d12b1e8&amp;dn=Neil+Young+-+Tonight%27s+The+Night+%281975%2F2014%29+24+bit%2F192+kHz+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sidmal","files":15,"time":1426629733,"description":"Neil Young - Tonight's The Night (1975/2014)\n FLAC (tracks) 24 bit/192 kHz | Time - 44:54 minutes | 1,58 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Tonight's the Night is the sixth studio album by Canadian musician Neil Young, released in 1975 on Reprise Records. It was recorded in 1973 (most of it on a single day, August 26), its release delayed for two years. It peaked at #25 on the Billboard 200. In 2003, the album was ranked number 331 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\n\n Written and recorded in 1973 shortly after the death of roadie Bruce Berry, Neil Young's second close associate to die of a heroin overdose in six months (the first was Crazy Horse guitarist Danny Whitten), Tonight's the Night was Young's musical expression of grief, combined with his rejection of the stardom he had achieved in the late '60s and early '70s. The title track, performed twice, was a direct narrative about Berry: &quot;Bruce Berry was a working man/He used to load that Econoline van.&quot; Whitten was heard singing &quot;Come On Baby Let's Go Downtown,&quot; a live track recorded years earlier. Elsewhere, Young frequently referred to drug use and used phrases that might have described his friends, such as the chorus of &quot;Tired Eyes,&quot; &quot;He tried to do his best, but he could not.&quot; Performing with the remains of Crazy Horse, bassist Billy Talbot and drummer Ralph Molina, along with Nils Lofgren (guitar and piano) and Ben Keith (steel guitar), Young performed in the ragged manner familiar from Time Fades Away -- his voice was often hoarse and he strained to reach high notes, while the playing was loose, with mistakes and shifting tempos. But the style worked perfectly for the material, emphasizing the emotional tone of Young's mourning and contrasting with the polished sound of CSNY and Harvest that Young also disparaged. He remained unimpressed with his commercial success, noting in &quot;World on a String,&quot; &quot;The world on a string/Doesn't mean anything.&quot; In &quot;Roll Another Number,&quot; he said he was &quot;a million miles away/From that helicopter day&quot; when he and CSN had played Woodstock. And in &quot;Albuquerque,&quot; he said he had been &quot;starvin' to be alone/Independent from the scene that I've known&quot; and spoke of his desire to &quot;find somewhere where they don't care who I am.&quot; Songs like &quot;Speakin' Out&quot; and &quot;New Mama&quot; seemed to find some hope in family life, but Tonight's the Night did not offer solutions to the personal and professional problems it posed. It was the work of a man trying to turn his torment into art and doing so unflinchingly. Depending on which story you believe, Reprise Records rejected it or Young withdrew it from its scheduled release at the start of 1974 after touring with the material in the U.S. and Europe. In 1975, after a massive CSNY tour, Young at the last minute dumped a newly recorded album and finally put Tonight's the Night out instead. Though it did not become one of his bigger commercial successes, the album immediately was recognized as a unique masterpiece by critics, and it has continued to be ranked as one of the greatest rock &amp; roll albums ever made.  \n\n\nTracklist:\n\n 01 - Tonight's The Night\n 02 - Speakin' Out\n 03 - World On A String\n 04 - Borrowed Tune\n 05 - Come On Baby Let's Go Downtown\n 06 - Mellow My Mind\n 07 - Roll Another Number (For The Road)\n 08 - Albuquerque\n 09 - New Mama\n 10 - Lookout Joe\n 11 - Tired Eyes\n 12 - Tonight's The Night Part II\n\n 2014 Remaster","torrent":{"xt":"urn:btih:7e008461bec632b5b51e98f162e3745b9d12b1e8","amp;dn":"Neil+Young+-+Tonight%27s+The+Night+%281975%2F2014%29+24+bit%2F192+kHz+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e008461bec632b5b51e98f162e3745b9d12b1e8","infoHashBuffer":{"type":"Buffer","data":[126,0,132,97,190,198,50,181,181,30,152,241,98,227,116,91,157,18,177,232]},"announce":[],"urlList":[]}}