{"title":"Sonic_Syndicate_Love_and_Other_Disasters_WAV(1411kbps)","uid":5940019,"size":513193488,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7e5a064fc4281656c4aab50e10721c99483201e9&amp;dn=Sonic_Syndicate_Love_and_Other_Disasters_WAV%281411kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JackieEstacado","files":12,"time":1289088977,"description":"In March 2008 the band began recording their third release in Jonas Kjellgren's Black Lounge Studios in Avesta.[17] In May 2008, Sonic Syndicate returned to North America as the opening act for Nightwish.[18] In the June issue of Revolver Magazine, Karin Axelsson was named one of the &quot;Hottest Chicks in Metal&quot;.[19] Love and Other Disasters was released in September 2008. The first single, &quot;Jack of Diamonds&quot;, is accompanied by a video again from Patric Ullaeus who has directed all of the bands videos.[20] Not long after the second single &quot;My Escape&quot; would follow up, also accompanied by a video from Patric Ullaeus. At the end of the year, the band toured Germany and Scandinavia, and released the singles &quot;Power Shift&quot; and &quot;Contradiction&quot; directed by Marius BÃƒÂ¶ttcher of Quent Film.[21]\n\nOn March 30, 2009 it was confirmed that singer Roland Johansson would quit the band because of personal reasons. A search for a replacement immediately went underway, whilst Roland stayed in the band until August 29, the day of his last show with the band at the Geuzenpop Festival in Enschede, The Netherlands.[22]\n\nOn October 13 Roland Johansson told on an interview that the reason of leaving Sonic Syndicate was the anxiety he felt and the dislike of the life style having to tour all around the world and being able to spend only very limited time with his loved ones. He also shared that he and Jesper StrÃƒÂ¶mblad from In Flames are currently working on an unnamed project and will start recording an album in the beginning of 2010. He is also back playing with his old band Dodge again.[23] [24]\n\n","torrent":{"xt":"urn:btih:7e5a064fc4281656c4aab50e10721c99483201e9","amp;dn":"Sonic_Syndicate_Love_and_Other_Disasters_WAV%281411kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e5a064fc4281656c4aab50e10721c99483201e9","infoHashBuffer":{"type":"Buffer","data":[126,90,6,79,196,40,22,86,196,170,181,14,16,114,28,153,72,50,1,233]},"announce":[],"urlList":[]}}