{"title":"Catalyst Separation, Recovery and Recycling","uid":12074546,"size":6163415,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e964f24d98c317f0454393fba41a5fa1814da58&amp;dn=Catalyst+Separation%2C+Recovery+and+Recycling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435601425,"description":"Catalyst Separation, Recovery and Recycling - Chemistry and Process Design (Springer, 2006).pdf\n\nISBN 978-1-4020-4086-3\n\nThis book looks at new ways of tackling the problem of separating reaction products from homogeneous catalytic solutions. The new processes involve low leaching supported catalysts, soluble supports such as polymers and dendrimers and unusual solvents such as water, fluorinated organics, ionic liquids and supercritical fluids. The advantages of the different possibilities are discussed alongside suggestions for further research that will be required for commercialisation. Unlike other books, in addition to the chemistry involved, the book looks at the process design that would be required to bring the new approaches to fruition. Comparisons are given with existing processes that have already been successfully applied and examples are given where these approaches are not suitable. The book includes:\n\n- New processes for the separation of products from solutions containing homogeneous catalysts\n\n- Catalysts on insoluble or soluble supports fixed bed catalysts - continuous flow or ultrafiltration\n\n- Biphasic systems: water - organic, fluorous - organic, ionic liquid organic, supercritical fluids (monophasic or biphasic with water, organic or ionic liquid)\n\n- Comparisons with current processes involving atmospheric or low temperature distillation\n\n- Consideration of Chemistry and Process Design\n\n- Advantages and disadvantages of each process exposed\n\n- Consideration of what else is need for commercialisation","torrent":{"xt":"urn:btih:7e964f24d98c317f0454393fba41a5fa1814da58","amp;dn":"Catalyst+Separation%2C+Recovery+and+Recycling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e964f24d98c317f0454393fba41a5fa1814da58","infoHashBuffer":{"type":"Buffer","data":[126,150,79,36,217,140,49,127,4,84,57,63,186,65,165,250,24,20,218,88]},"announce":[],"urlList":[]}}