{"title":"The Anthony Cumia Show 2015-03-21 MP4 MP3 combo","uid":11772727,"size":360503060,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:80afe732e1896e5a93187eb1e2f88b919bb5dfa0&amp;dn=The+Anthony+Cumia+Show+2015-03-21+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1427139452,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): East Side Dave, Bobo, Big Gus, Heather Moss, Mary Jean\n\nLive from Resorts World Casino No Limits Tattoo Show\n\nEpisode 131: Sorry about the shitty audio in the beginning. -Rat. Live from the No Limits Tattoo Show, Ant begins by telling us about the difficulty of getting to the show, lets us in on the Twitter beef he had with ghetto whore Azealia Banks before the broadcast, East Side Dave takes a seat to talk about weapons, his weight loss, Robert Durst, and they go through some of Dave's tattoos. They also get into Harrison Ford, share their thoughts on J.J. Abrams and Star Wars, talk shit on Dave' Soprano's tat, discuss research before tattoos, cover-ups, East Side Dave belts out a tune, and Bobo and Dave yap about the Mets. Big Gus from &quot;Tattoo Nightmares&quot; joins TACS to talk about his show, shitty tattoos, the possibility of lawsuits, and his portrait work. Heather Moss then sits in and talks about her &quot;Miss United Ink&quot; title, how she got into tattoos, her love for older men, the artwork she has, and her duties as &quot;Miss United Ink&quot;. Mary Jean drops by and quickly goes topless, tells us what she's up to workwise and also, where we can see her next. Dave and Ant then discuss odd slot machine themes, sports betting, indulge Bobo with a little sports trivia battle, chat it up about SiriusXM, and give a shout out to Tattoo Lou for the invite down to the No Limits Tattoo Show.\n\n\nNew ups at:\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:80afe732e1896e5a93187eb1e2f88b919bb5dfa0","amp;dn":"The+Anthony+Cumia+Show+2015-03-21+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80afe732e1896e5a93187eb1e2f88b919bb5dfa0","infoHashBuffer":{"type":"Buffer","data":[128,175,231,50,225,137,110,90,147,24,126,177,226,248,139,145,155,181,223,160]},"announce":[],"urlList":[]}}