{"title":"Star Surgeon by Alan Edward Nourse [republicV]","uid":7771194,"size":431009,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80dc09f3b4a0a5173c05a69c9e72f44d150246f3&amp;dn=Star+Surgeon+by+Alan+Edward+Nourse+%5BrepublicV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"republicV","files":4,"time":1351534698,"description":"Alan Edward Nourse (1928-1992) was an American science fiction author and physician. He wrote both juvenile and adult science fiction, as well as nonfiction works about medicine and science. His works generally focused on medicine and/or psionics. His most well-known work by title is The Bladerunner, which lent its title to the film adaptation of Phillip K. Dick's work Do Androids Dream of Electric Sheep? Robert A. Heinlein dedicated his 1964 novel Farnham's Freehold to Nourse.\nThe shuttle plane from the port of Philadelphia to Hospital Seattle had already gone when Dal Timgar arrived at the loading platform even though he had taken great pains to be at least thirty minutes early for the boarding.\nThe adventures of Dal Timgar, born on a planet of a distant star, who attempts to become a qualified physician of Hospital Earth. This exciting science fiction story is a selection of the Junior Literary Guild..When Dal Timgar, of all his medical class, was denied assignment to a general practice patrol ship going out from Hospital Earth to serve the medical needs of the Galactic Confederation, it seemed to him that his eight years of study in the great medical center of the galaxy had ended in failure. He had worked hard and stood at the head of his class, but Dal was different from his medical colleagues in one important way. Born on a planet of a distant star, he was the first son of an alien race to attempt to become qualified physician of Hospital Earth.","torrent":{"xt":"urn:btih:80dc09f3b4a0a5173c05a69c9e72f44d150246f3","amp;dn":"Star+Surgeon+by+Alan+Edward+Nourse+%5BrepublicV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80dc09f3b4a0a5173c05a69c9e72f44d150246f3","infoHashBuffer":{"type":"Buffer","data":[128,220,9,243,180,160,165,23,60,5,166,156,158,114,244,77,21,2,70,243]},"announce":[],"urlList":[]}}