{"title":"Neighbours from Hell 1 &amp; 2","uid":7316787,"size":267010048,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:812330ee35d6e20f8bda86a6a4f92a2220bfb08d&amp;dn=Neighbours+from+Hell+1+%26amp%3B+2+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rinakhar4","files":1,"time":1338502508,"description":"Neighbours from Hell 1 \n\n\nEach level's goal is to play some crude tricks on your neighbour by using every item near your character. Each stage has 4 or 5 zones (Not including the training stages). You must move Woody to zone from zone, The Neighbour moves with them as time goes by. Sometimes you can distract him with different ways (such as call him to make him go downstairs) or he gets distracted automatically (For example, painting, washing clothes, and so on.) He has pets watching over him, such as a parrot named Chilli. As the game progresses, the player unlocks new rooms to play (such as a study, bedroom, balcony and the basement).\n\n\nNeighbours from Hell 2: On Vacation\n\n\nn this game instead of being in a house, the player travels to various locations around the world. This time the player must have his caution turned to the Mom of the Neighbour from Hell too, if he doesn't want to be caught. The player has now 3 lives instead of one, and if he is spotted by the Neighbour, he will kick him to another area and lose a life. The graphics have been slightly improved. There is also a character named Olga, the woman that the Neighbour is attracted to, and player can use various things to have Olga beat him up (such as breaking the chair Neighbour is standing to and being a Peeping Tom while Olga is having shower). Also Olga has a child, but the player doesn't have to concern of him. As the game progresses, the player unlocks various new locations. In other parts of the game, his mom can also beat him up (such as adding ammunition with a flare gun).","torrent":{"xt":"urn:btih:812330ee35d6e20f8bda86a6a4f92a2220bfb08d","amp;dn":"Neighbours+from+Hell+1+%26amp%3B+2+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"812330ee35d6e20f8bda86a6a4f92a2220bfb08d","infoHashBuffer":{"type":"Buffer","data":[129,35,48,238,53,214,226,15,139,218,134,166,164,249,42,34,32,191,176,141]},"announce":[],"urlList":[]}}