{"title":"Agatha Christie - The Mirror Crack'd From Side to Side (BBC)","uid":6590773,"size":83181380,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:82ddecf8db998d03443fa59792fd2b23ff708750&amp;dn=Agatha+Christie+-+The+Mirror+Crack%5C%27d+From+Side+to+Side+%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fakeplastictrousers2","files":-1,"time":1312815450,"description":"From BBC Radio 4 Extra. Written by Agatha Christie; Full-cast dramatisation starring June Whitfield as Miss Marple.\n\nAfter the death of her husband, Dolly Bantry sold Gossington Hall to the former film star Marina Gregg and her husband. When the glamorous couple decide to throw a benefit party for the local hospital, the grounds are thronged with curious visitors, and for one of them, the day ends in tragedy. As Marina is serving cocktails in the house, she is cornered by the excitable Heather Babcock, who chatters away about their former meeting about eleven years ago before spilling her daiquiri all over herself and Marina.Ever the gracious hostess, Marina offers her own untouched drink to Mrs Babcock - only to look on, horrified, as the lady dies in front of her. It is up to Miss Marple to find out who was really meant to take the poison that killed poor Heather Babcock. Could it be that Marina Gregg was the intended victim? If so, Miss Marple's task will not be an easy one, for the lady had an unusually large number of enemies...","torrent":{"xt":"urn:btih:82ddecf8db998d03443fa59792fd2b23ff708750","amp;dn":"Agatha+Christie+-+The+Mirror+Crack%5C%27d+From+Side+to+Side+%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82ddecf8db998d03443fa59792fd2b23ff708750","infoHashBuffer":{"type":"Buffer","data":[130,221,236,248,219,153,141,3,68,63,165,151,146,253,43,35,255,112,135,80]},"announce":[],"urlList":[]}}