{"title":"Sexually Broken--Alt-Porn Hottest, Asphyxia Noir  Asphyxia Noir ","uid":7960376,"size":1385996213,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:82e09083b5616e9dd034e17db42ff24d40b5c71f&amp;dn=Sexually+Broken--Alt-Porn+Hottest%2C+Asphyxia+Noir++Asphyxia+Noir+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1356559514,"description":"Alt-Porn Hottest, Asphyxia Noir, endures brutal fucking, throat abuse, nipple torture, orgasms. | Asphyxia Noir | Matt Williams\n\nDecember 26, 2012 \n \n\nMP4 only.    \n    \n \nAlt-Porn's hottest talent, Asphyxia Noir is back. This tall, thin beauty is as sexually twisted as they come. We love destroying &quot;bad girls&quot;. They moan, scream and cum just like every other girl. \n\nAsphyxia is tossed a ring gag and told to put it on tightly. We then toss her a wooden tongue trap and instruct her to put it all the way up her tongue. She moans in discomfort as the trap bites deep into her sensitive tongue. Drool almost immediately starts running down onto her sexy red dress. \n\nWe quickly bind her wrists tightly together, the knot well out of her reach, and command her to strip for us. She struggles to remove her dress, and we soon find our little &quot;bad girl&quot; didn't come in wearing panties or a bra, and her pussy is smooth and shaved.\n\nOnly one thing to do to whores like that, and that is to put them down on their knees and fuck their mouth, throat, and skull into next week. The cock slides right into her gag opened mouth. Her tongue is trapped outside, so she has no way of stopping the cock as it finds the very back of her throat again and again. She has been reduced to a helpless cock sucking slave, all she knows is cock down her throat, and that she must constantly fight for air. We are not gentle, Asphyxia suffers the most brutal throat banging of her &quot;bad girl&quot; life. Her eye make-up tells us what her brain is thinking, and that is &quot;I'm fucked&quot;. \n\nWe flash Asphyxia's brain, meaning we hold the cock down her throat for so long that when we finally let her have air, her body flashes. It's like a mini orgasm, that really sends the person into subspace, total breath control. After one particularly intense flash, we pull Asphyxia up and strappado her wrists up to a pulley. A vibrator is pushed onto her clit and within seconds she is shaking, moaning and cumming like a common whore. So much for that &quot;bad girl&quot; mentality.\n\nA spreader bar keeps her long legs spread wide, a rope from her neck to the floor pulls her down and pushes her tight perfect ass up and out. The pulley pulls her arms up tighter and Asphyxia finds her self completely taunt and unable to move at all. We clamp her huge nipples and add heavy weights. Then we jam a red ball gag deep into her mouth. Now she is ready. \n\nBefore she even understands what is happening, the cock is buried balls deep in her wet pussy and she is cumming and cumming hard. It's just that simple, and humiliating to most girls that we can make them cum so fast from cock. The nipple weights sway back and forth as we pound her tight pussy. She cums again, exhausted, sexually beaten. We took the &quot;bad girl&quot; and showed her she is not on top of the &quot;sex game&quot;. She is just like every other girl, a play toy, to be used and used hard. Unable to even stand, she sinks down to her knees, beaten... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/12_26asphyxia/SexuallyBroken-Asphyxia-Noir-Matt-Williams-Bondage-Alt-Porn-Hottest-Asphyxia-Noir-endures-brutal-fucking-throat-abuse-nipple-torture-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/12_26asphyxia/SexuallyBroken-Asphyxia-Noir-Matt-Williams-Bondage-Alt-Porn-Hottest-Asphyxia-Noir-endures-brutal-fucking-throat-abuse-nipple-torture-orgasms.php&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:82e09083b5616e9dd034e17db42ff24d40b5c71f","amp;dn":"Sexually+Broken--Alt-Porn+Hottest%2C+Asphyxia+Noir++Asphyxia+Noir+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82e09083b5616e9dd034e17db42ff24d40b5c71f","infoHashBuffer":{"type":"Buffer","data":[130,224,144,131,181,97,110,157,208,52,225,125,180,47,242,77,64,181,199,31]},"announce":[],"urlList":[]}}