{"title":"Honeyspider (2015)","uid":15946291,"size":2088779776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:83938819002bb52c2f032642773f9175dc00c28b&amp;dn=Honeyspider+%282015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":8,"uploader":"cenobytez","files":1,"time":1475513469,"description":"It's Halloween day in 1989 and college student Jackie Blue wants to enjoy a quiet birthday in the midst of a chaotic semester at school. Her friend Amber has other ideas and persuades Jackie to come to the annual Monster Mash party on campus after her shift at the local movie theater. As murder plays out on the silver screen during the theater's Halloween night Horrorthon, Jackie falls under a strange spell, all while a mysterious stranger watches over her every move. As the night unfolds, Jackie slowly unravels and everyone around her is turning up dead. Jackie finds herself helplessly trapped like prey in a spider's web, and all she can do is try to survive the night!\r\n\r\n- Written by Honeyspider \r\n\r\nHorror fans looking for that classic horror vibe that many of today's films have lost need to check out 'Honeyspider.' It's one of those films you will want to watch every year on Halloween. --Lynn Sorel, Horror News Network\r\n\r\nSimilarities to past films however pay homage, rather than copying. Honeyspider bursts forth with innovation, and really freshens up the genre... Honeyspider is an imaginative, unique tribute to the horror films we ve grown up loving. --Cup Of Moe\r\n\r\n...killer performances by Professor Lynch (Frank Aard) and Vevila (Joan Schuermeyer)...it s safe to say that this will be a regular play for me on Halloween, and hopefully you too. --Horror-Movies.ca","torrent":{"xt":"urn:btih:83938819002bb52c2f032642773f9175dc00c28b","amp;dn":"Honeyspider+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83938819002bb52c2f032642773f9175dc00c28b","infoHashBuffer":{"type":"Buffer","data":[131,147,136,25,0,43,181,44,47,3,38,66,119,63,145,117,220,0,194,139]},"announce":[],"urlList":[]}}