{"title":"Stealth Warplanes.pdf","uid":7779891,"size":25827843,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83931c727690301fa99165700a3f482d1f1f6718&amp;dn=Stealth+Warplanes.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":1,"time":1351755409,"description":"Stealth Warplanes by Doug Richardson\n\n\nPublisher:Zenith Press\nDate:2001-10-11\nISBN-10:0760310513\nPages:192\n\nDescription:\n\n This magnificently illustrated book describes the aircraft and technology behind the most significant developments in aviation since the jet engine. Penetrating the cloud of secrecy, disinformation, and speculation surrounding stealth aircraft, author Doug Richardson provides a detailed survey of the principle stealth aircraft in the skies today, including the F-117 Nighthawk, F-22 Raptor, and B1-B and B-2A bombers, as well as aircraft still on the drawing boards and in testing, like Boeing's and Lockheed's Joint Strike Fighter contenders, the Eurofighter 2000, and the latest Russian developments in the field. Stunning color plates and diagrams, along with dramatic photography, depict the nuts and bolts of these aircraft and clearly explain the technologies behind stealth. In addition, there is a fascinating look at the countermeasures under development to oppose stealth warplanes. \n\nNOTE:\nIt's a bit outdated for sure as stealth technology has rapidly evolved over the years.A recent example being the test flight of China's second stealth fighter something no one would have thought as remotely possible when this book was published.But then its better than nothing.","torrent":{"xt":"urn:btih:83931c727690301fa99165700a3f482d1f1f6718","amp;dn":"Stealth+Warplanes.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83931c727690301fa99165700a3f482d1f1f6718","infoHashBuffer":{"type":"Buffer","data":[131,147,28,114,118,144,48,31,169,145,101,112,10,63,72,45,31,31,103,24]},"announce":[],"urlList":[]}}