{"title":"Joni Mitchell - PRX Documentaries","uid":7046450,"size":222761524,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:83da781e65c3bdd153a980a05ebdf30881adeeb5&amp;dn=Joni+Mitchell+-+PRX+Documentaries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"popoyaya","files":-1,"time":1329761246,"description":"Three recent radio documentaries on Joni Mitchell taken from Public Radio Exchange (PRX), an award-winning public media company.\n\nAn Intimiate Portrait of Joni Mitchell (2008)\nJoni Mitchell's &quot;Blue&quot; (2011)\nThe Emergence of Joni Mitchell (2007)\n\nAn Intimiate Portrait of Joni Mitchell\nReese Erlich \nProduced: Jan 01, 2008\nLength: 00:53:59\nMP3 - 128 kbps\n\nOne hour documentary - Joni Mitchell's life and music\n\nJoni Mitchell exploded onto the music scene in the early 1960s as a young and unique folk singer. She combined poetic lyrics, anti-war and pro-environment politics with a very special voice. For nearly 10 years Mitchell stopped recording new music, even refusing to pick up a guitar or sit at a piano. She was disgusted with the commercialism of the music industry and discrimination faced by women artists. Then in 2007 she came back with a burst of artistic energy, including a new CD, a ballet and an anti-war photo montage exhibit. Independent producer Reese Erlich caught up with Mitchell as she hung that exhibit in New York. She talks of her early life, her antipathy to the wars in Iraq and Afghanistan, and the close connections between her visual art and music. This is a rare personal portrait of one of the great artists of our era.\n\n\nJoni Mitchell's &quot;Blue&quot;\nPaul Ingles \nProduced: May 24, 2011\nLength: 00:59:02\nMP3 - 128kbps\n\nMusicians, music writers, fans and Joni Mitchell herself reflect on Joni Mitchell's most revered album, &quot;Blue,&quot; released in 1971.\n\nAward-winning producer Paul Ingles hosts Joni Mitchell's BLUE, a one-hour examination of one of the most heralded albums of all time by Joni Mitchell. BLUE was rated #30 on the Rolling Stone magazine 2003 list of the Top 500 Albums of All-Time. It was the highest rated album by any female musician. The magazine also called her &quot;one of rock's most daring and uncompromising innovators.&quot;\n\nIn all of her albums, but especially on BLUE, Mitchell put the experience of being a woman and being human on artful display through her blatantly honest and confessional lyrics, innovative open guitar tunings and jazz-inflected vocals. \n\nBy mixing Mitchell's music from this and other Joni Mitchell albums with informed commentary from musicians, fans, music critics and archival interviews with Mitchell herself, Joni Mitchell's BLUE articulates what music lovers have found so compelling about this particular album. Special guests include music writers Ann Powers, Anthony DeCurtis, Paul Zollo, and Lydia Hutchinson. Also featured are musicians Shawn Colvin, Lucy Kaplansky, and others.\n\n\nThe Emergence of Joni Mitchell\nPaul Ingles\nProduced: Sep 24, 2007\nLength: 01:59.01\nMP3 - 128kbps\n\nTwo-hour exploration of the seminal work of heralded songwriter Joni Mitchell.\n\nJoni Mitchell recently released her first album of new material in 10 years (&quot;Shine,&quot; September 24), and award-winning producer Paul Ingles marks the occasion by hosting &quot;The Emergence of Joni Mitchell,&quot; a two-hour examination of one of the most heralded songwriters of her time. In this third installment of his series on the seminal work of important figures in popular music, Ingles and his guests explore how Joni Mitchell crafted her artistry and connected with audiences over four decades. Mitchell put the experience of being a woman and being human on artful display through her blatantly honest and confessional lyrics, innovative open guitar tunings and jazz-inflected vocals. The program focuses on Mitchell's key releases to illuminate the musicianship of the woman &quot;Rolling Stone&quot; called &quot;one of rock's most daring and uncompromising innovators.&quot; By mixing Mitchell's music from these pivotal moments with informed commentary from musicians, fans, music critics and archival interviews with Mitchell herself, &quot;The Emergence of Joni Mitchell&quot; articulates what music lovers have found so compelling about this thoughtful and innovative writer and performer. Special guests include music writers Ann Powers, Anthony DeCurtis, Paul Zollo, Lydia Hutchinson and Holly George-Warren. Also featured are musicians Shawn Colvin, Lucy Kaplansky and others.s Shawn Colvin, Lucy Kaplansky and others.","torrent":{"xt":"urn:btih:83da781e65c3bdd153a980a05ebdf30881adeeb5","amp;dn":"Joni+Mitchell+-+PRX+Documentaries","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83da781e65c3bdd153a980a05ebdf30881adeeb5","infoHashBuffer":{"type":"Buffer","data":[131,218,120,30,101,195,189,209,83,169,128,160,94,189,243,8,129,173,238,181]},"announce":[],"urlList":[]}}