{"title":"Julie London - All Through The Night (1965) [Jazz][mp3 320][h33t","uid":4938038,"size":84400836,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:842d3b6c5540384ede24b7c4cafd4839a59b3bc0&amp;dn=Julie+London+-+All+Through+The+Night+%281965%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":16,"time":1244331028,"description":"Julie London - All Through The Night\nOriginal Release Date: October 23, 2007 \nLabel: Capitol \nBitrate: 320 kbps\n\nImagine a hushed, smoke-filled Hollywood nightclub, one-thirty in the morning, 1965. From a corner booth, Frank Sinatra signals for a last round as a combo takes the small stage to close the night out with a loose, sexy half-hour set of Cole Porter standards. Russ Freeman slumps at the piano, delicately leading the way. Bud Shank closes his eyes and weaves his typically fluid sax lines, while the great Joe Pass follows on guitar. And at the microphone, smooth-as-silk, cool-as-ice, Julie London, enthrallingly world-weary, deliciously pitch-perfect. Who could ask for more? \n\nAlthough not really a live set, &quot;All Through The Night&quot; evokes just this type of atmosphere ( much better, in fact, than London's actual live recording of the previous year, the uncharacteristically goofy &quot;In Person at The Americana&quot;. ) Ignore the insipid new liner notes and the incongruous bonus cut from a recording session five years prior, pour yourself a cocktail, turn down the lights, and enjoy! ~ ArrivederciBaby\n\nIt doesn't get much better than this, either for the recording career of Julie London or the whole concept of a vocalist doing standards with a good jazz combo providing backup. Listeners who like these sorts of songs but don't enjoy the over-arranged sounds of studio big bands and orchestras will no doubt take an immediate liking to having players such as Joe Pass and the terrific drummer Colin Bailey swinging away instead. Most of the room is left to London, who is in great form here. It is a tribute to Cole Porter, who wrote enough good songs for at least five albums such as this. The ten songs chosen run the gamut from the most familiar to a bit less, although most of this composer's work has received memorable outings via the vocal pipes of one saloon singer or another. Bud Shank does his Stan Getz thing, nicely pumped up. Greatly aided by a superb studio sound and mix, London really does convincing interpretations of these songs. In fact, she may be too convincing, and one might wind up packing one's bags as she eases into the first chorus of &quot;Get Out of Town.&quot; ~ Eugene Chadbourne\n\nPersonnel:\nRuss Freeman - piano\nBud Shank - flute, alto saxophone\nEarl Palmer - drums\nEmil Richards - vibraphone\nJoe Pass, Jimmy Rowles, Monty Budwig - bass guitar\nColin Bailey, Al Viola - guitar\nBob Flanagan - trombone\nDon Baley\n \nJulie London - All Through The Night Tracks:\n01  I've Got You Under My Skin\n02  You Do Something to Me\n03  Get Out of Town\n04  All Through the Night\n05  So in Love\n06  At Long Last Love\n07  Easy to Love\n08  My Heart Belongs to Daddy\n09  Ev'ry Time We Say Goodbye\n10  In the Still of the Night\n11  You'd Be So Nice to Come Home to","torrent":{"xt":"urn:btih:842d3b6c5540384ede24b7c4cafd4839a59b3bc0","amp;dn":"Julie+London+-+All+Through+The+Night+%281965%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"842d3b6c5540384ede24b7c4cafd4839a59b3bc0","infoHashBuffer":{"type":"Buffer","data":[132,45,59,108,85,64,56,78,222,36,183,196,202,253,72,57,165,155,59,192]},"announce":[],"urlList":[]}}