{"title":"Billy Madison(1995)DVDRip.AC3(ENG)-DROCK","uid":6127926,"size":734431232,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:843ef07ca0fc9c47ad1d9d16f5ddd4da68c523fc&amp;dn=Billy+Madison%281995%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"drock232","files":-1,"time":1296009843,"description":"Master of infantilism Adam Sandler stars as the title character, an overgrown rich kid who wiles away his days poolside, swilling kegs of beer and appreciating fine nudie magazines such as &quot;Drunk Chicks&quot; -- that is, until his father (Darren McGavin) decides to test his mettle as future head of the family business by posing a challenge: retake and pass grades K-12 in 24 weeks or watch control of the business pass to the requisite conniving underling (Bradley Whitford). Forced into action, Billy vows to change his drunken ways. He enrolls in kindergarten, makes new friends, pelts pint-sized kids with playground balls and develops a love interest in a pretty teacher (Bridgitte Wilson). The action culminates in an academic showdown between Billy and the purportedly Harvard-educated underling for the future of the family enterprise -- no small feat for a man fresh out of the first grade. There's gross, moronic, off-color low humor galore in Billy Madison, particularly in one subplot involving a romantically forward elementary school principal (Josh Mostel, son of theater great Zero Mostel) and his secret former life as a professional wrestler; another scene includes the hypertense school bus driver (Chris Farley, in a typical over-the-top cameo) lying in the meadow with a hallucinatory penguin. As one might suspect, Billy Madison is not for every taste; Sandler fans will laugh from start to finish; others beware.\n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:843ef07ca0fc9c47ad1d9d16f5ddd4da68c523fc","amp;dn":"Billy+Madison%281995%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"843ef07ca0fc9c47ad1d9d16f5ddd4da68c523fc","infoHashBuffer":{"type":"Buffer","data":[132,62,240,124,160,252,156,71,173,29,157,22,245,221,212,218,104,197,35,252]},"announce":[],"urlList":[]}}