{"title":"Mike Kraus - Final Dawn- Season 3 (The Thrilling Post-Apocalypti","uid":11312954,"size":750432,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8453bf94f4bfa7294236cd3526fbaa334e1ddfe0&amp;dn=Mike+Kraus+-+Final+Dawn-+Season+3+%28The+Thrilling+Post-Apocalypti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"krystine","files":-1,"time":1414523960,"description":"Final Dawn: Season 3 (The Thrilling Post-Apocalyptic Series) by Mike Kraus\n\n\n\nThe final chapter in the mind-blowing saga is here!\nThis book consists of the third and final season of Final Dawn: The Thrilling Post-Apocalyptic Series. Inside you'll find one of the most unique post-apocalyptic thriller stories ever written. \nWhen the end of the world arrived, it came not with a bang, as most expected, but with more of a &quot;pfft&quot; instead.\nHumanity has been torn asunder and brought to the edge of total annihilation in less than an hour. For those who died, it was a quick death, so fast that their brains didn't have time to process the pain signals from their nerves. For those who survived, the true horror is about to begin as they struggle to not only stay alive, but find out what happened to bring such a quick end to the world as they knew it.\nFinal Dawn is a thrilling new post-apocalyptic series that follows the journey of four people who survived the end of days.\nLeonard McComb - A grizzled veteran of the New York City sanitation department, trapped underground in the city's vast sewer system when the world ended. \nNancy Sims - An accountant, traveling across the plains of the Midwest towards a new job, caught in the middle of nowhere, destruction all around her.\nMarcus Warden - A self-made millionaire from New York, vacationing in a national forest of West Virginia when the bombs fell.\nRachel Walsh - A wife and mother whose family is swept away in the blink of an eye, struggling with her loss and the dawning realization of what may have truly transpired to bring about the end of the world.\n\n\nGenre: Thriller","torrent":{"xt":"urn:btih:8453bf94f4bfa7294236cd3526fbaa334e1ddfe0","amp;dn":"Mike+Kraus+-+Final+Dawn-+Season+3+%28The+Thrilling+Post-Apocalypti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8453bf94f4bfa7294236cd3526fbaa334e1ddfe0","infoHashBuffer":{"type":"Buffer","data":[132,83,191,148,244,191,167,41,66,54,205,53,38,251,170,51,78,29,223,224]},"announce":[],"urlList":[]}}