{"title":"Amber","uid":10519859,"size":626241105,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:846676e8444e9ee1dbe2051196c618a3aa65cf4b&amp;dn=Amber&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Psychodad149","files":4,"time":1404961780,"description":"\nAMBER: Journeys Beyond is a classic-style graphic adventure game released in 1996 by Hue Forest Entertainment.\n\n\nThis torrent includes the XP/7 patch. I have this running on a W7/64 machine with an ATI graphics card. Mount the disk in your Daemon Tools or whatever. DO NOT run the autosetup which will pop up. Close that, and run the installer instead. You may need to also install QuickTime 32, included on the disk. Do this manually, running as administrator and using compatibility mode if necessary.\n\nThis torrent also includes the virtual game disk, of course, the game manual, and this readme.\nThe manual encourages the player to start playing without consulting the instructions! It is very intuitive\n\n==================================\nAlthough little noticed when released and not a commercial success, coming from a small, independent publisher, it did earn much praise from critics and those who did play it.\n\nAdventure Gamers - 4.5 / 5.0\nAdventure Classic Gaming - 5 out of 5\nGameSpot - 7.4\nMobyGames - 79\n\nThe main critiques leveled against it are that it was too short, and the ending perhaps anticlimactic.\n==================================\n\n\nAMBER is an adventure game presenting a suspenseful horror ghost story, very immersive and atmospheric, and reminiscent of the later cult hit &quot;Darkfall.&quot;\n\nAMBER is short for Astral Mobility By Electromagnetic Resonance device invented by a promising scientist in the field of paranormal activities, Dr. Roxanna. In order to conduct the experimental testings of the device she secludes herself into an abandoned mansion, rumored to be haunted by ghosts and spirits. In her research Roxanna confirms those rumors, however, fails to respond on numerous phone calls. Her friend, Joe, presumes that something might has happened to her and asks you, the player, to investigate.\n\nIn order to help Roxy and the spirits of the house, you will have to use the AMBER device, that will provide you with the ability to experience ghost's stories in form of the lucid dreams. Each dream will be presented in the unique stylistic presentation.  \n\nAlthough the game does require the player to solve inventory-based puzzles, the emphasis is more on the exploration and presentation of the story.The key element of the gameplay is exploring environments in order to advance the plot by revealing crucial information as to to the reasons of ghost's bond to the world of the living: and you must do to release the spirits from their torment.\n\n---------------------------------------------\n\nI bought this when it was on the clearance rack at Office Max! It was an instant favorite, and I've played through it a couple times since, and although the graphics look a bit dated now, just turn down the lights, play it after the parents/kids/wife/husband has gone to bed, shut the door, and enjoy this absolute gem of a game!\n","torrent":{"xt":"urn:btih:846676e8444e9ee1dbe2051196c618a3aa65cf4b","amp;dn":"Amber","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"846676e8444e9ee1dbe2051196c618a3aa65cf4b","infoHashBuffer":{"type":"Buffer","data":[132,102,118,232,68,78,158,225,219,226,5,17,150,198,24,163,170,101,207,75]},"announce":[],"urlList":[]}}