{"title":"10 S01 - SD Webstream - Hardcoded Eng Subs - Sno","uid":13456950,"size":2188082819,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:848a64597b91beae8fcae40a4c27b80c23c3cbb8&amp;dn=10+S01+-+SD+Webstream+-+Hardcoded+Eng+Subs+-+Sno&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Snowhiter","files":12,"time":1454853098,"description":"10 S01 - SD Webstream - Hardcoded Eng Subs - Sno\r\n\r\nThis is not HD and there will be occasional streaming errors - I've done what I can with this but it's from an encoded stream so take it or leave it . . . \r\n\r\nTense Swiss drama in which poker players gather in a secret spot for a high-stakes game. Half a million francs are in the pot but more than just money is at stake.\r\n\r\n\r\nE01. New Year's Eve, Geneva: croupier Vincent Torrella has organised a private poker game for a special group of players. But little do the participants know that there's more than just money at stake.\r\n\r\nE02. Agent Hans Koller probes a case of industrial espionage in which stolen HR files were lost in a game of cards. Vincent presides over the poker game's early stages as the first player is knocked out.\r\n\r\nE03. A power cut plunges the game into darkness and the police surveillance team are left wondering whether it's intentional. As the game continues, the cameras reveal there's a cheat among the group.\r\n\r\nE04. Agent Koller and Clara Pestalozzi have spotted there's a cheat. As they struggle to unearth his identity, the other players grow suspicious. Meanwhile, another participant is knocked out of the game.\r\n\r\nE05. Koller calls Rosset in to identify a suspect, but has reason to question whether he is telling the truth. The police have a mole within the game who finds an encrypted laptop hidden in the apartment.\r\n\r\nE06. The police crack the laptop's encryption code only to discover there's another transaction taking place. The players close in around the cheat and Julie knocks him out of the game with Vincent's help.\r\n\r\nE07. Vincent has paid Julie to pose as Simon's long-lost daughter, but under pressure she can't manage to keep up the pretence. The Swat team are left floundering when they fail to pick up the cheat.\r\n\r\nE08. Eldin continues to bate Manuel but is left reeling when he is knocked out of the card game. Patrick's quick reflexes threaten to give the game away. The Swat team decide to storm the building.\r\n\r\nE09. Shocked to discover they're in the wrong building, the police desperately try to locate the poker venue. Vincent comes clean with Marie and together they manage to convince Manuel to escape.\r\n\r\nE10. A quick getaway is scuppered by Eldin but Vincent is handed a lifeline. Having identified each of the players, the police now have their homes under surveillance. The mole has one final hand to play.\r\n\r\n\r\n\r\nVideo 852 x 480 / 25 fps / 1000 (approx) kbps / MP4\r\n\r\nAudio 128 kbps AAC\r\n\r\nDuration 0:25 (approx)\r\n\r\nSeed to the Max - Merci beaucoup . . .\r\n\r\nSno\r\n \nhttp://www.imdb.com/title/tt2279918\r\n\r\n10, Drama, Swiss, French Language, Webstream, SD, Sno, Poker\r\n\r\n-----------------------------------------------------------------------------------------------------\r\n\r\nI seed all of my torrents to a ratio of 100:1 - please help seed to keep them alive\r\n\r\n-----------------------------------------------------------------------------------------------------\r\n\r\nRipped / Encoded / Uploaded by Snowhiter\r\n\r\n-----------------------------------------------------------------------------------------------------\r\n\r\nAny Bitcoin Donations Welcome here : 164BRZMwZZHmBHS7WLU2s4ZB3geRZZuV3b","torrent":{"xt":"urn:btih:848a64597b91beae8fcae40a4c27b80c23c3cbb8","amp;dn":"10+S01+-+SD+Webstream+-+Hardcoded+Eng+Subs+-+Sno","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"848a64597b91beae8fcae40a4c27b80c23c3cbb8","infoHashBuffer":{"type":"Buffer","data":[132,138,100,89,123,145,190,174,143,202,228,10,76,39,184,12,35,195,203,184]},"announce":[],"urlList":[]}}