{"title":"Pietro Aretino - La cortigiana [PDF - Ita] [Tntvillage]","uid":5164338,"size":234728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84aa485f9e1af68feb0dc29db5949b4b1b8ba0c5&amp;dn=Pietro+Aretino+-+La+cortigiana+%5BPDF+-+Ita%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":1,"time":1258320955,"description":"PIETRO ARETINO\n\nLA CORTIGIANA\n\nLa Cortigiana (ossia la commedia della vita di corte) fu composta a Roma tra il febbraio e il luglio del 1525, durante gli ultimi mesi trascorsi da Aretino presso la corte romana, ma rimase inedita fino al 1534, anno in cui l'autore la rielaborÃƒÂ² e stampÃƒÂ² a Venezia. La trama ruota intorno a due casi faceti labilmente collegati. Quello del senese Maco che, giunto a Roma per diventare perfetto cortigiano, finisce, per una burla ordita nei suoi confronti da Mastro Andrea, in una caldaia bollente; e quella di Parabolano che, ingannato dal servo Rosso e dalla mezzana Aluigia, ÃƒÂ¨ ricevuto da Togna, moglie del geloso fornaio Ercolano, invece che dall'amata Livia. La commedia si raccomanda non tanto per l'azione, che ÃƒÂ¨ piuttosto lenta, quanto per la vivacitÃƒÂ  e il realismo delle scene e dei dialoghi.\n\n\nNato ad Arezzo nel 1492, Pietro Aretino non si denominÃƒÂ² mai col suo patronimico (del padre Luca, un calzolaio, sappiamo ben poco) ma sempre col nome della sua cittÃƒÂ .\n\nDella sua infanzia quasi nulla ÃƒÂ¨ noto, ma si sa che nell'adolescenza visse e a Perugia sia per frequentare l'universitÃƒÂ  sia per studiare pittura, e come pittore si firmÃƒÂ² per qualche tempo.\n\nNel 1517 fu a Roma, alla corte di Leone X; qui assistette al conclave del 1522, in occasione del quale compose delle pasquinate, ovvero dei poemetti satirici. Con l'ascesa al soglio pontificio del fiammingo Adriano VI (o, come lo chiamÃƒÂ² l'Aretino, la tedesca tigna) prese a viaggiare per la penisola e lavorÃƒÂ² a Mantova, al servizio di Giovanni dalle Bande Nere. TornÃƒÂ² a Roma nel '23 e, sotto papa Clemente VII, riacquistÃƒÂ² notorietÃƒÂ  e benevolenza popolare.\n\nIn questo periodo compone i Sonetti Lussuriosi, ispiratigli dalle tavole pornografiche di M. A. Raimondi sui disegni di Giulio Romano, e scrisse la Cortigiana. Ma l'invidia e la malevolenza del datario pontificio, mons. Giberti, interruppero questo periodo felice: alla fine del luglio 1525 viene accoltellato da un sicario del monsignore.\n\nL'Aretino lasciÃƒÂ² cosÃƒÂ¬ Roma e, dal 25 marzo 1527, si trasferÃƒÂ¬ a Venezia, la cittÃƒÂ  anticortigiana per eccellenza, l'unica, a detta di lui, totalmente opposta a Roma, sede di tutti i vizi. Qui scrisse e diede alle stampe la maggior parte delle sue opere e qui morÃƒÂ¬, probabilmente di apoplessia, il 21 ottobre 1556.\n\nAutore:  Pietro Aretino\nTitolo: La cortigiana\nCuratore: Giuliano Innamorati\nAnno: 1525\nLingua:  Italiano \nGenere:  Commedia\nNumero di pagine:  65\nDimensione del file:  238 KB su disco (234.728 byte)\nFormato del file:  Pdf\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:84aa485f9e1af68feb0dc29db5949b4b1b8ba0c5","amp;dn":"Pietro+Aretino+-+La+cortigiana+%5BPDF+-+Ita%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84aa485f9e1af68feb0dc29db5949b4b1b8ba0c5","infoHashBuffer":{"type":"Buffer","data":[132,170,72,95,158,26,246,143,235,13,194,157,181,148,155,75,27,139,160,197]},"announce":[],"urlList":[]}}