{"title":"The Anne Rice Audiobook Collection","uid":6710325,"size":19063534365,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:84ce4e20fb780777ea5f4489a0bd8b06941bf66e&amp;dn=The+Anne+Rice+Audiobook+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":895,"time":1317329213,"description":"-------------Complete Anne Rice Audio Collection v2.0-------------\nI've always loved vampire stories and Rice's are some of the best. Therefore over 2 years ago I released my first Fixed-Chapterized-Tagged version of the almost complete fictional works of Anne Rice including books written under pen names. I have now updated this torrent with new works and a key replacement. I have processed all these unabridged books in the following ways:\n\n1. More than half the books were ripped BY ME a few years ago. All the rips I did are from high quality library CDs and Cassettes. The other rips are done by others but are generally of very good quality.\n\n2. Equalized volume. Several of these audio books had volume discontinuities. I have equalized volumes so there shouldn't be any sudden jumps.\n\n3. Dehissed and noise-cleaned. When needed, I performed low pass filters and deleted pops in the audio.\n\n4. FULLY CHAPTERIZED. This took weeks. Each audio book was compiled into a single file (deleting bits like &quot;end of side one, please turn over this cassette&quot;) and then separated into Parts and Chapters as defined by the original books. I find this to be the best way to enjoy audiobooks and it is perfect for iPods.\n\n5. Encoded all books to a uniform MP3 96kbps 44.1kHz.\n\n6. ID3 Tagged. All audio book files have been fully ID3 tagged including full COVER ART.\n\nAnd so this torrent represents a 97% complete collection of Anne Rice's work. That's 28 novels and 1 short story. The only fictional work missing from this collection is Rice's second novel, The Feast of All Saints. As far as I can tell, this book has not been released in audio form, so I believe this torrent to be 100% complete as far as audiobooks are concerned. Obviously, if ANYONE can possibly help me get an audio copy of this novel I would be happy to chapterize it and post it as an update and give the donor mad props!\n\nBut perhaps most importantly, I finally offer here an excellent replacement for 2001 - Blood and Gold (VC8 - read by Roger Rees) which was corrupt in the previous torrent!\n\nPlease leave any comments, questions, or suggestions you might have as they are HIGHLY APPRECIATED! :)\n\nEnjoy!\n--CL8\n\n\n-------------Included in this torrent-------------\n1976 - Interview With the Vampire (VC1 - read by Frank Muller)\n1982 - Cry to Heaven (read by Ray Hagen)\n1983 - The Claiming of Sleeping Beauty (B1 - read by George Holmes)\n1984 - Beauty's Punishment (B2 - read by George Holmes)\n1985 - Beauty's Release (B3 - read by George Holmes)\n1985 - Exit to Eden (read by Jill Fox)\n1985 - The Vampire Lestat (VC2 - read by Frank Muller)\n1986 - Belinda (read by Ray Bouche)\n1988 - The Queen of the Damned (VC3 - read by Frank Muller)\n1989 - The Mummy or Ramses the Damned (read by Bob Askey)\n1990 - The Witching Hour (MW1 - read by Laura Giannarelli)\n1992 - The Tale of the Body Thief (VC4 - read by Frank Muller)\n1993 - Lasher (MW2 - read by David Hartley-Margolin)\n1994 - Taltos (MW3 - read by Laura Giannarelli)\n1995 - Memnoch the Devil (VC5 - read by David Hartley-Margolin)\n1996 - Servant of the Bones (read by Michael Prichard)\n1997 - Violin (read by Bernadette Dunne)\n1998 - Pandora (NV1 - read by Kate Reading)\n1998 - The Vampire Armand (VC6 - read by Jonathan Marosz)\n1999 - Vittorio the Vampire (NV2 - read by Jonathan Marosz)\n2000 - Merrick (VC7 - read by Graeme Malcom)\n2001 - Blood and Gold (VC8 - read by Roger Rees)\n2002 - Blackwood Farm (VC9 - read by David Pittu)\n2003 - Blood Canticle (VC10 - read by David Pittu)\n2005 - Christ the Lord - Out of Egypt (read by Josh Heine)\n2008 - Christ the Lord - The Road to Cana (read by James Naughton)\n2009 - Angel Time (SS1 - read by Paul Michael)\n2010 - Of Love and Evil (SS2 - read by Paul Michael)\n\n[Series Key -- VC=Vampire Chronicles, B=Beauty, MW=Mayfair Witches, NV=New Vampires, SS=Songs of the Seraphim]\n\nplus the short story:\n1982 - The Master of Rampling Gate (read by Gigi Marceau)\nand a large collection of A. Rice ebooks!\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:84ce4e20fb780777ea5f4489a0bd8b06941bf66e","amp;dn":"The+Anne+Rice+Audiobook+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84ce4e20fb780777ea5f4489a0bd8b06941bf66e","infoHashBuffer":{"type":"Buffer","data":[132,206,78,32,251,120,7,119,234,95,68,137,160,189,139,6,148,27,246,110]},"announce":[],"urlList":[]}}