{"title":"bloodbath discography -Northwind_Highlander-","uid":8705075,"size":524588794,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:86f612e3d4db06fe50a0854b07535c456cfce3d1&amp;dn=bloodbath+discography+-Northwind_Highlander-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"northwind_highlander","files":55,"time":1374130341,"description":"Mikael kerfeldt - vocals (1999 - 2004, 2005, 2008 - present)\nAnders &quot;Blakkheim&quot; Nystr m - guitar (1999 - present)\nPer &quot;Sodomizer&quot; Eriksson - guitar (2008 - present)\nJonas Renkse - bass (1999 - present)\nMartin &quot;Axe&quot; Axenrot - drums (2004 - present)\n\nFormer members\nPeter T gtgren - vocals (2004 - 2005)\nDan Swan - drums (1999 - 2004), guitar (2004 - 2006)\nA year after being formed, the band, then consisting of Mikael kerfeldt (Opeth) on vocals, Dan Swan (Edge of Sanity, Nightingale, etc.) on drums, Anders &quot;Blakkheim&quot; Nystr m (Katatonia, Diabolical Masquerade) on guitar, and Jonas Renkse (Katatonia, October Tide) on bass, released their EP Breeding Death, followed two years later by their debut album Resurrection through Carnage\n\nIn 2004, singer Mikael kerfeldt left Bloodbath to free up more time for his primary band Opeth. To replace him, Bloodbath brought in Peter T gtgren (Hypocrisy). The lineup changed further, with Dan Swan switching to play the guitar instead of drums. Martin Axenrot (Witchery, Satanic Slaughter and now Opeth) took his place and the band was now bigger and more serious, no longer just a secondary project. The band's second full release, Nightmares Made Flesh, was released in Europe in September 2004\n\nIn February 2005, T gtgren left the band due to &quot;conflicting schedules.&quot; That same year, Mikael kerfeldt rejoined the band for a single live show at Germany's Wacken Open Air on August 5. Prior to the show, the band commented on the Wacken show: &quot;Not only the first, but also the last gig for Bloodbath (with Mikael kerfeldt on vocals)&quot;; later it also turned out to be the last one with Dan Swan . In September of 2005, Bloodbath started searching for a new lead singer\n\nIn August 2006, the band announced the departure of Dan Swan from their ranks due to musical differences, as well as Swan 's being busy with other projects. They simultaneously closed the vocal auditions, announcing that no suitable singer had been found\n\nOn 27 March 2007 the band announced that a new line-up would shortly be unveiled, along with news that they were producing new material, to be released on a mini-CD towards the end of summer. In August 2007, band member Jonas Renkse wrote a message on the band's official discussion forum which suggested that work was in progress[1] On 30 January 2008, it was announced via the Bloodbath website that Mikael kerfeldt would be rejoining the line-up on vocals, along with new member Per Eriksson (ex-21 Lucifers, ex-Genocrush Ferox) on guitar. Then, in March 2008, the new EP, Unblessing the Purity, was released. Also released in 2008 was the long awaited Wacken live CD/DVD The Wacken Carnage\n\nBloodbath released their third full length album, The Fathomless Mastery, in October 2008\n\nStudio albums\nResurrection Through Carnage (2002)\nNightmares Made Flesh (2005)\nThe Fathomless Mastery (2008)\n\nEPs\nBreeding Death (2000)\nUnblessing the Purity (2008)\n\nLive\nThe Wacken Carnage (2008)\n\nremember to seed!!!","torrent":{"xt":"urn:btih:86f612e3d4db06fe50a0854b07535c456cfce3d1","amp;dn":"bloodbath+discography+-Northwind_Highlander-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86f612e3d4db06fe50a0854b07535c456cfce3d1","infoHashBuffer":{"type":"Buffer","data":[134,246,18,227,212,219,6,254,80,160,133,75,7,83,92,69,108,252,227,209]},"announce":[],"urlList":[]}}