{"title":"the watchmen comic issue 1","uid":4771895,"size":12539760,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:87f1509123c8d55689ddeed42e9abbf66bd5de8c&amp;dn=the+watchmen+comic+issue+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"theoggler","files":2,"time":1237069115,"description":"We Have OPEN Registration for new members at\n\nSo stop in and get your ACCOUNT TODAY!\n\nIf you are like we were; sick of waiting hours for a file, tired of never finding seeders on torrents, wanting to give back what you leeched...\n\n\nThen its time to:\n\nCome and join us at Movie Torrents follow this link:\n\nis a new private tracker. We emphasize high quality scene releases, the latest movies, Games, 0-Day applications, TV shows as soon if not sometimes before they air. Don't see a file on the site? Ask for it and our uploaders will try to fill your request.\n\nThis awesome site is growing rapidly and open registration won't be forever.\n\nalso offers other things to its users like awesome forums that are both fun and informative. You get bonus points for posting, which can be user to pad yopur upload GBs, or buy custom titles (other perks are coming) We have live streaming shoutcast radio on site, a casino for those of you who like to gamble, arcade games you can play on site and some of the best and friendliest staff members around the torrent scene.\n\nRegistrations are open, but only for a limited time! Once we have reached our target member goal, registrations will close.\n\nSign up now while you still can, before registration is closed!\n\nhey to all members , our seedboxes are getting pretty full so here is a deal for you to 1. help the site 2. to help your ratio, \nwe will give uploaders 50 gig a week for uploading to the site just to say thanks for donating your time and bandwith to the site, \nbut there are specifcations to be followed \n\n1. you must be connectable \n2. you must leave your torrents on all the times \n3. you got to upload 5 or more torrents in a week adhear to these specifications and you will recieve your 50 gigs per week\n\n\nSee you at Movie torrents!","torrent":{"xt":"urn:btih:87f1509123c8d55689ddeed42e9abbf66bd5de8c","amp;dn":"the+watchmen+comic+issue+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87f1509123c8d55689ddeed42e9abbf66bd5de8c","infoHashBuffer":{"type":"Buffer","data":[135,241,80,145,35,200,213,86,137,221,238,212,46,154,187,246,107,213,222,140]},"announce":[],"urlList":[]}}