{"title":"Blind Luck by Scott Carter [retail EPUB] (MOBI AZW3 PDF)","uid":10843698,"size":2457688,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:882c785b76266ab21dd62d84e264c07686bcc1e0&amp;dn=Blind+Luck+by+Scott+Carter+%5Bretail+EPUB%5D+%28MOBI+AZW3+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1408755389,"description":"Dave Bolden's life feels like it's on repeat. He works his eight hours at a boutique accounting firm, goes home, gets drunk and wakes up the next day to go back to work with a hangover. But his life changes when an eighteen-wheel truck crashes through the front windows of his workplace, killing everyone except him. Shortly after the accident, he is approached by an eccentric businessman, Mr. Thorrin, who interprets Dave's survival as luck and sets out to exploit what he perceives as a gift. Mr. Thorrin wants Dave to participate in gambling, stock manipulation and extreme betting, all based on this belief. Complicating Dave's life further is his strained relationship with his father, a lifelong compulsive gambler. The more he interacts with his father, the more he realizes a series of events from his childhood support the theory that he is unusually lucky. What transpires is a series of extreme tests of luck, orchestrated by the very mysterious Mr. Thorrin. The more Dave denies that he is lucky, the more he finds himself in situations that make it appear that he is. As the stakes rise both financially and personally, Dave is left to decide whether his run of good fortune is a gift or a curse.","torrent":{"xt":"urn:btih:882c785b76266ab21dd62d84e264c07686bcc1e0","amp;dn":"Blind+Luck+by+Scott+Carter+%5Bretail+EPUB%5D+%28MOBI+AZW3+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"882c785b76266ab21dd62d84e264c07686bcc1e0","infoHashBuffer":{"type":"Buffer","data":[136,44,120,91,118,38,106,178,29,214,45,132,226,100,192,118,134,188,193,224]},"announce":[],"urlList":[]}}