{"title":"Nighty Night Season 1","uid":4158261,"size":1412068554,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:88b3eaf59bbbf2e1dd97fb1cd1ab8589d055602a&amp;dn=Nighty+Night+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"chaffeur","files":6,"time":1209248732,"description":"This is season 1 of Nighty Night, a dark, dark, dark comedy series. Enjoy! Will upload season 2 if there is interest.\n\n\nA review from IMDB:\n\nJill has found out that her husband Terry has cancer. While Terry is in hospital, Jill moves on with life, like Terry\\&amp;#039;s cancer hasn\\&amp;#039;t happened; yet she\\&amp;#039;ll easily use it to gain pity and a use it as guilt. Jill runs a hair dresser shop; its very shoddy and customers are always complaining about their cuts. Jill also has new neighbours; Cathy and Don. Cathy has multiple sclerosis and Don is a doctor. Jill becomes madly in love with Don, thinking that Terry is dying she might as well move on. Every second Jill tries to push Cathy and Don apart; so she can squeeze her way through and take Cathy\\&amp;#039;s place. Not to long, Jill finds Terry\\&amp;#039;s cancer is receding and is almost cured; but she doesn\\&amp;#039;t tell Terry and stuffs him into a nursing home; she then tells everyone that Terry is dead, using it to get closer to Don and to push Cathy further away.\n\nNighty Night is a dark, wicked, brilliantly disturbing comedy about one woman who will do literally anything to get what see wants. The comedy is so dark and perverse and sexually rampant. Jill is one of the most awfullest person i have seen in a series in a long time. What she does to Don and Cathy; especially Cathy, is just so sickening, but its some of the funniest stuff i\\&amp;#039;ve seen in a series for a long time. Jill\\&amp;#039;s attempts to temp Don are side splitting; showing up on the door step in her underwear, doing the basic instinct crossing of the legs flashing her private parts. Terry\\&amp;#039;s \\&amp;#039;funeral\\&amp;#039; is one of the funniest moments of the series.\n\nJulia Davis wrote and stars as Jill; and she hits every note perfectly. All the acting is great. Rebecca Front was brilliant as Cathy and same with Angus Deayton as Don. Kevin Eldon makes Terry so sympathetic, you just feel so sorry for him. Ruth Jones is side splitting as Linda.\n\nNighty Night is one of the best comedy shows i\\&amp;#039;ve seen in a long time. It\\&amp;#039;s dark and perverse and isn\\&amp;#039;t afraid to push the boundaries of good taste. If you love Little Britian and I\\&amp;#039;m Not An Animal, you\\&amp;#039;ll love Nighty Night. ","torrent":{"xt":"urn:btih:88b3eaf59bbbf2e1dd97fb1cd1ab8589d055602a","amp;dn":"Nighty+Night+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88b3eaf59bbbf2e1dd97fb1cd1ab8589d055602a","infoHashBuffer":{"type":"Buffer","data":[136,179,234,245,155,187,242,225,221,151,251,28,209,171,133,137,208,85,96,42]},"announce":[],"urlList":[]}}