{"title":"A Bunch of Good Albums Rock Albums From 1966-72","uid":3416888,"size":762657900,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8908f12b1a1755a4f2063c36862701dff5dffc7f&amp;dn=A+Bunch+of+Good+Albums+Rock+Albums+From+1966-72&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ChrisGoes","files":117,"time":1133618618,"description":"Size: 727 Mb\nBitrade: 256\nmp3\nRipped By: ChrisGoes(Rock)\nArtwork Included\nTracker: tracker.prq.to/announce\n\n*************************************************************************\n\nhttp://img528.imageshack.us/img528/2306/bunchartwork7dy.jpg\n\n*************************************************************************\n\nKin Ping Meh - No.2 (German Heavy Progressive 1972)\n\nJust like the debut album of the Mannheim band, 'No. 2' was produced by the Hamburg team of Achim Reichel/Frank Dostal (Rattles) and recorded in the Windrose Dumont Time studios. Once again, Conny Plank was the sound engineer. One year later, Plank set up his own studio near Cologne and built his own monument by producing the first four Kraftwerk records. On 'No. 2', Kin Ping Meh followed down the path they had taken the year before - straight rock with no experiments, resulting in unspectacular, but highly powerful rock music. All in all, the second Kin Ping Meh album seems to show them in an even more relaxed mood and offers not only catchy rhythms, but almost pop-like elements. The first two songs ('Come Down To The Riverside' and 'Don't Force Your Horse' are typical Kin Ping Meh rock. The next song, a cover version of the Beatles' 'Come together', ends on a well-done jam (the 'Together Jam'). And just like the debut album, 'No. 2' has its calmer moments as well ('Livable Ways' and 'Day Dreams'). The LP ends with the lively 'Very Long Ago' and 'I Wonna Be Lazy', written by Reichel and Dostal. As bonus tracks, this CD contains the single B-side version of 'Sometime' (1973, Zebra 2047002; the original version can be found on the debut album) plus the single A-side 'Sunday Morning Eve' (1973, Zebra 2047004) \n\n1. Come Down To The Riverside \n2. Don?t Force Your Horse \n3. Come Together \n4. Together Jam \n5. Livable Ways \n6. Day Dreams \n7. Very Long Ago \n8. I Wonna Be Lazy \n\n*************************************************************************\n\nLyd - Lyd (Superb US Psychedelia 1970)\n\nNow reissued officially at last is this killer late '60's US acid psych album. Very much in the Endless Journey school of heavy psych with ripping wah wah fuzz and wasted stoned vocals this album is finally housed in the psych packaging it requires. The vinyl is a 10&quot; mini album format and the CD is in a mini gatefold LP sleeve (Please note this is a short album at just over 21 minutes)\n\nTheir music is a very violent abrasive garage punk with very psychedelic grafts. Very rare, only a few copies on acetate were released. Originally recorded in 1970, unreleased one sided acetate. Some great garage guitar psych with intense basement atmosphere and junkie lyrics, well worth checking out.\n\n01 - The Time Of Hate And Struggle - 3.00\n02 - Need You - 2.36\n03 - Stay High, Fly Away Is Still Ok - 3.57\n04 - Double Dare - 1.47\n05 - Think It Over Twice - 7.23\n06 - Trash Pad - 2.14\n\n*************************************************************************\n\nMajic Ship - The Complete Recordings (US Psychedelic Rock 1966-70)\n\n\nThe Story Of A New York Band In The Sixties!!- The Boys from Brooklyn, NY that took the Northeast by storm in the late 60's. All their 45 releases, unreleased singles, demos from 1966, the 1970 LP, and more!!! Total of 20 tracks in all!! With a 20 Page full color Booklet filled with New Photos &amp; lots of Biographical Info!!!\nPLUS: Iinterviews with Guss, Mike, Tommy, Rob, and Phil Polimeni, lead guitarist of the &quot;Ship&quot; and close friend of the late great legend-Tommy Bolin!!!!\n\nFrom the master tapes (!!) the whole of this US '60s bands superb psychedelic rock album plus extra tracks, full biog/info and pics. This band were on 'Endless Journey' and their fabulous acid guitar / keyboard soaked version of &quot;Down By The River / For What It's Worth&quot; lasts more than 10 minutes! \n\n1. Night Time Music\n2. Mustang Sally [Demo Version]\n3. On the Edge [Demo Version]\n4. Hummin'\n5. It's Over\n6. Green Plant\n7. To Love Somebody\n8. On the Edge\n9. And When It's Over\n10. Sioux City Blues\n11. Wednesday Morning Dew\n12. Life's Lonely Road\n13. We Gotta Live On\n14. Where Are We Going\n15. Free\n16. Down by the River/For What It's Worth\n17. Nightmare\n18. Too Much\n19. Cosmo's Theme\n20. Blow Me Away\n\n*************************************************************************\n\nMarkley - A Group (Rare Solo Bob Markley Album US 1969) \n\nReissue on CD of what was actually the 5th and final album by West Coast Pop Art Experimental Band. Singer/womaniser Bob markley thought it better to release it under his own name, as a showcase for his various dementia's. The album is chocked full of rich harmonies and delicate arrangements which show the abundant influence of Michael Lloyd, who co-produced the album with (mad) Bob . A surprisingly consistent and accomplished album for a band about to collapse under the collective weight of it's own insanity.\n\nThere are few groups as enigmatic, as mysterious as The West Coast Pop Art Experimental Band. The prime mover in the band was Bob Markley, born in Oklahoma and the son of an oil tycoon. He moved to Los Angeles early in the 1960's, and in late 1961 he began his recording career with &quot;It Should've Be Me&quot; / 'Summers Comin' On&quot;, released on Warner Bros. Both sides were pure teen doo-wop, giving little indication what would follow. Markley remained involved in music, and three years later he met up with two brothers, Shaun and Danny Harris, whose interest in music seemed inevitable as their father was a renowned classical composer and their mother a concert pianist. In 1964 Shaun and Danny formed a group The Snowmen, with two musicians who would go on to form The Sunrays and score 1967 hits with 'Andrea' and 'I Live For The Sun'. Later, with the group now split, Shaun and Danny were studying at the Hollywood Professional School where they met Michael Lloyd, leader of yet another local band, Laughing Wind, who had cut some tracks for Tower Records. With Bob Markley and John Ware, a friend of the family, they started a new group. In 1966 the line-up was Dan Harris (lead guitar), Shaun Harris (bass), Michael Lloyd (guitar), John Ware (drums), and Bob Markley who became the inspirator of the band. They band played around all the Sunset Strip clubs and &quot;every freakout that ever happened at the Hollywood Palladium&quot; (to quote Ware).\n\n\nBy 1966 the band had signed to Reprise and their debut album, 'Part One', included some daring cover versions of L.A. contemporaries as Van Dyke Parks, Frank Zappa and P.F.Sloan. The album opened with one of its strongest cuts, the marvelous 'Shifting Sands'. Here is all that was good about the early WCPAEB, that mixture of understatement and melody, with exceptional guitar work which flew over the top of the song, creating an atmosphere that was itself unique. It's the style that the group would expand on. The album-sleeve was a colored collage of anonymous photographs, with no personnel listed. It is not clear who actually played on the album, although Bob Markley is listed as the co-producer.\n\nWith the release of the group's second album 'Vol 2', Markley's hold on the group was obviously completed and the air of anonymity removed. The WCPAEB was clearly seen as a trio, with photographs on both the front and back sleeves. Alongside Markley were the Harris brothers. The album included some gems. &quot;Smell of Incense&quot; is particularly good with some strong instrumentation. Released as a single (in a cut-up and remix version), it was the hit the group never had; They were curiously beaten by a cover version by the Southwest F.O.B., who reached no.56 a few months later. \n\nThe third album 'A Child's Guide to Good and Evil' appeared in mid 1968 and was the group's most accomplished collection. Still operating as a trio the band now found themselves with a new depth of sound, better able to shape their ideas. This was fully explored in &quot;Eighteen is Over The Hill&quot;, where by using layers of multi-track, there was now a fuller wash of harmonies and instruments to complement the often-complex material. \n\nAnother confused period followed after the group was dropped by Reprise, as their sales were falling. Bob Markley took out some time to work as producer on other projects. \nThe WCPAEB did, however, re-appear, and a further album 'Where's My Daddy' was released on Amos Records late in 1969, although not of the same class as the Reprise material. Once again the line-up was made up of the crucial three. \nThis album effectively ended the name of the West Coast Pop Art Experimental Band, although some time later the trio resurfaced together for one last project, a Bob Markley solo album.\n\n'Markley, A Group' released on the obscure Forward label, was effectively the fifth Pop Art album; the personnel was the same and indeed, the music too was an extension of 'Where's My Daddy'. Once again it lacked the heady atmosphere of say &quot;Smell Of Incense&quot;, but it was by no means indispensable.\n'A Group' did, however, mark the end of the collaboration between Markley and the two Harrises and they each went their separate ways.\n\n01 - Booker T &amp; His Electric Shock\n02 - Next Plane To The Sun\n03 - Roger The Rocket Ship\n04 - Elegant Ellen\n05 - Little Ruby Rain\n06 - Message For Miniature\n07 - Sarah The Sad Spirit\n08 - Truck Stop\n09 - Zoom Zoom Zoom\n10 - Sweet Lady Eleven\n11 - The Magic Cat\n12 - Outside - Inside\n\n*************************************************************************\n\nMystic Siva - Under The Influence (Superb US Psychedelia (1969-70)\n\nFirst issue of these recordings from 1969-70, packaged in a heavy duty book-like folder. &quot;Previously unreleased recordings of Mystic Siva from Detroit, very famous in the psychedelic collector&amp;acute;s scene for their outstanding and rare original album (already reissued by WIS). The music here, recorded live prior to the album is taken from the mastertapes. The opener is an instrumental cut, followed by six diff. versions of original album tracks in very powerful style, mixed with four long acid jamming cover tunes turned into typical Siva style with pounding and hypnotic Hammond B3 organ, wailing and distorted fuzz/wah-wah guitarwork, powerful (sometimes Doors influenced) vocals and massive drums which lead you to the holy grail of psychedelic music.&quot;\n\nUnreleased gem from 1969/70 perhaps even better than the original album. Features mind melting arrangements of &quot;Come Together&quot;, &quot;Tobacco Road&quot;,&quot;I'm A Man&quot; and &quot;Black Sheep&quot; along with 7 of the groups own compositions. Live recordings from 1969-70 in Detroit with very good stereo sound. A legendary US psych band.\n\n01 - Keep Your Head\n02 - Spinning A Spell\n03 - Come On Closer\n04 - Super Natural Mind\n05 - Come Together\n06 - Magic Luv\n07 - Find Out Why\n08 - I&amp;acute;m A Man\n09 - Tobacco Road\n10 - Sitting In A Room\n11 - Black Sheep (S.R.C.)\n\n*************************************************************************\n\nN.S.U - Turn On Or Turn Me Down (UK Stoned Fuzz Freakouts 1969)\n\nReleased on the same label as Sam Gopal this super rare album was recorded by a Scottish band in 1969, before they disappeared. Heavy guitar based progressive rock with flashes of Cream and similar late '60's bands. With a track called &quot;Stoned&quot; this is, as you would expect, of it's era....\n\n01 - Turn On, Or Turn Me Down - 4.01\n02 - His Town - 4.00\n03 - You Can&amp;acute;t Take It From My Heart - 2.50\n04 - Love Talk - 5.02\n05 - All Aboard - 4.06\n06 - The Game - 3.10\n07 - Stoned - 4.50\n08 - Pettsie&amp;acute;s Blues - 3.47\n09 - On The Road - 8.13\n\n*************************************************************************\n\nNazareth - BBC Live 1972 - 1977 (2CD)\n\nThis cd captulates the phenomenal success of nazareth. It includes all the top hits from nazareths sessions at the beeb and whether you be devoted fan or new to nazareth it is a brilliant piece of 70s rock and roll history.This cd is the definitive guide to what rock and roll is. \n\nDisc 1\n\n1. Called Her Name\n2. Fool About You\n3. Hard Living\n4. Going Down\n5. Razamanaz\n6. Broken Down Angel\n7. Night Woman\n8. Too Bad Too Sad\n9. Turn On Your Receiver\n10. Bad Bad Boy\n11. Shape of Things\n12. Silver Dollar Forger\n13. Glad When You're Gon\n14. Jet Lag\n\nDisc 2\n \n1. Dear John\n2. Morning Dew\n3. Vigilante Man\n4. Paper Sun\n5. Woke Up This Morning / Boogie\n6. Love Hurts\n7. Expect No Mercy\n8. This Flight Tonight\n9. Whiskey Drinking Woman / Hair Of The Dog\n10. Teenage Nervous Breakdown\n\n*************************************************************************\n11. Road Ladies\n","torrent":{"xt":"urn:btih:8908f12b1a1755a4f2063c36862701dff5dffc7f","amp;dn":"A+Bunch+of+Good+Albums+Rock+Albums+From+1966-72","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8908f12b1a1755a4f2063c36862701dff5dffc7f","infoHashBuffer":{"type":"Buffer","data":[137,8,241,43,26,23,85,164,242,6,60,54,134,39,1,223,245,223,252,127]},"announce":[],"urlList":[]}}