{"title":"Spice: The History of a Temptation","uid":8758580,"size":1091569,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89e545e5e7fd061eb15dfea2484822349d443f3b&amp;dn=Spice%3A+The+History+of+a+Temptation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1375196475,"description":"A brilliant, original history of the spice trade-and the appetites that fueled it.\n\nIt was in search of the fabled Spice Islands and their cloves that Magellan charted the first circumnavigation of the globe. Vasco da Gama sailed the dangerous waters around Africa to India on a quest for Christians-and spices. Columbus sought gold and pepper but found the New World. By the time these fifteenth- and sixteenth-century explorers set sail, the aromas of these savory, seductive seeds and powders had tempted the palates and imaginations of Europe for centuries.\n\nSpice: The History of a Temptation is a history of the spice trade told not in the conventional narrative of politics and economics, nor of conquest and colonization, but through the intimate human impulses that inspired and drove it. Here is an exploration of the centuries-old desire for spice in food, in medicine, in magic, in religion, and in sex-and of the allure of forbidden fruit lingering in the scents of cinnamon, pepper, ginger, nutmeg, mace, and clove.\nWe follow spices back through time, through history, myth, archaeology, and literature. We see spices in all their diversity, lauded as love potions and aphrodisiacs, as panaceas and defenses against the plague. We journey from religious rituals in which spices were employed to dispel demons and summon gods to prodigies of gluttony both fantastical and real. We see spices as a luxury for a medieval king s ostentation, as a mummy s deodorant, as the last word in haute cuisine.\n\nThrough examining the temptations of spice we follow in the trails of the spice seekers leading from the deserts of ancient Syria to thrill-seekers on the Internet. We discover how spice became one of the first and most enduring links between Asia and Europe. We see in the pepper we use so casually the relic of a tradition linking us to the appetites of Rome, Elizabethan England, and the pharaohs. And we capture the pleasure of spice not only at the table but in every part of life.\n\nSpice is a delight to be savored.\n","torrent":{"xt":"urn:btih:89e545e5e7fd061eb15dfea2484822349d443f3b","amp;dn":"Spice%3A+The+History+of+a+Temptation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89e545e5e7fd061eb15dfea2484822349d443f3b","infoHashBuffer":{"type":"Buffer","data":[137,229,69,229,231,253,6,30,177,93,254,162,72,72,34,52,157,68,63,59]},"announce":[],"urlList":[]}}