{"title":"Coast to Coast AM March 13 2013","uid":8267313,"size":57130889,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8a25352fc56bf3405e41ecb63e3f3d54d3dadc98&amp;dn=Coast+to+Coast+AM+March+13+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1363540173,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-13-13\nHost: \tGeorge Noory\nGuests: \tDane Wigington, John Hogue, Dr. Robin Falkov\n\nResearcher and activist Dane Wigington has been documenting disturbing changes in the environment known as geoengineering. This includes various weather modification techniques such as chemtrails and HAARP. Through efforts such as chemtrails that place metal particulates in the atmosphere, we are now experiencing &quot;global dimming,&quot; in which 20% of the sun's rays no longer reach the direct surface of the planet, he reported. Geoengineering's covert programs have been enacted as a means of control, and possibly to lessen the effects of global warming, but these efforts have backfired and become a dire threat to life on Earth, he warned. &quot;At a certain point when you realize can't walk out the door and breathe without sucking in a lung full of heavy metal,&quot; you know you have to take a stand, he said.\n\nLab tests associated with chemtrails have found such chemicals as aluminum, strontium, barium, and now fluoride in Europe, and he connected this to soil and water contamination, and the decline of various forms of life. Artificially induced snowstorms are another harmful form of weather modification that has been seen in places where snow falls even though temperatures are above freezing, he revealed. Wigington cautioned that geoengineering could be pushing Earth into a &quot;Venus Syndrome,&quot; in which climate feedback loops are triggered that begin to feed on themselves, eventually creating a hellish climate like that of Venus.\n\nA NOAA scientist told him off the record that they are aware of these programs but afraid to step forward because of no 1st amendment protections. One of the few whistleblowers to come forward is Kristen Meghan, a former Air Force industrial hygienist, who has seen some of the chemtrail operations. At this juncture, Wigington believes there is a panic in the power structure. &quot;Even those who were orchestrating these programs now are realizing that they cannot control the beast they have let out of the cage, and they are now frantically trying to refreeze the Arctic with ice nucleation,&quot; he commented.\nThe New Pope\n\nIn the first half-hour, prophecy expert John Hogue reacted to the selection of the new Pope-- Pope Francis, who took his name from St. Francis of Assisi. In line with St. Malachy's prophecy that the final pope would have Peter in his name, Hogue noted that St. Francis' original name was Francesco di Pietro di Bernardone. He also spoke about one of Nostradamus' quatrains that referred to a new Pope who would hail from ancient France (St. Francis' mother hailed from France), &quot;and make a promise to the enemy who will cause great plague during his reign.&quot;\nColon Cancer\n\nIn the second half-hour, homeopathic physician Dr. Robin Falkov revealed that she is struggling with colon cancer and has opted to have laparascopic robotic surgery to remove the tumor. This procedure is done inside the body and minimizes complications. She suggested people consider having a colonoscopy, as early detection can allow for removal of polyps before they become a tumor.\n\nNews segment guest:Christian Wilde\nWebsite(s):\n\n    geoengineeringwatch.org\n    hogueprophecy.com\n    healthfreedomrights.com\n\nBook(s):\n\n    Nostradamus 2012: The End of End Times\n\n","torrent":{"xt":"urn:btih:8a25352fc56bf3405e41ecb63e3f3d54d3dadc98","amp;dn":"Coast+to+Coast+AM+March+13+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a25352fc56bf3405e41ecb63e3f3d54d3dadc98","infoHashBuffer":{"type":"Buffer","data":[138,37,53,47,197,107,243,64,94,65,236,182,62,63,61,84,211,218,220,152]},"announce":[],"urlList":[]}}