{"title":"Internet Download Manager [IDM] v6.18 Build 5 Installer","uid":9122874,"size":23482682,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8a6be56d53e021ffb600286c5c85095f6d962e20&amp;dn=Internet+Download+Manager+%5BIDM%5D+v6.18+Build+5+Installer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"-nelly-","files":-1,"time":1383166485,"description":"        Internet Download Manager [IDM] v6.18 Build 5 Installer - -nelly-\n        =================================================================\n\n\n\n\n               N.B.: THIS INSTALLER MUST BE RAN AS ADMINISTRATOR\n               =================================================\n\n\n\n                  The new bigger and better suprbay is back!!!\n                  ********************************************\n\n\nFor re-seed requests, help, support or anything else relating to The Pirate Bay. You'll find it all, and more, at suprbay. The official support forum of The Pirate Bay. Visit it at the link below:\n\n\n\n\n                         &lt;a href=&quot; https://forum.suprbay.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://forum.suprbay.org/&lt;/a&gt;\n                          ~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\n\n\nInternet Download Manager has a smart download logic accelerator that features intelligent dynamic file segmentation and safe multipart downloading technology to accelerate your downloads. Unlike other download accelerators and managers that segment files before downloading starts, Internet Download Manager segments downloaded files dynamically during download process.\n\nInternet Download Manager reuses available connections without additional connect and login stages to achieve better acceleration performance. Internet Download Manager supports proxy servers, ftp and http protocols, firewalls, redirects, cookies, authorization, MP3 audio and MPEG video content processing. IDM integrates seamlessly into Microsoft Internet Explorer, Netscape, MSN Explorer, AOL, Opera, Mozilla, Mozilla Firefox, Mozilla Firebird, Avant Browser, MyIE2, and all other popular browsers to automatically handle your downloads. You can also drag and drop files, or use Internet Download Manager from command line. Internet Download Manager can dial your modem at the set time, download the files you want, then hang up or even shut down your computer when it's done.\n\nMain Features:\n- All popular browsers and applications are supported! Internet Download Manager has been tested with the following browsers: Internet Explorer, MSN Explorer, AOL, Netscape Communicator, Netscape 6, Netscape 7, Mozilla, Mozilla Firefox, Mozilla Firebird, Opera, NetCaptor, UltraBrowser, Slim Browser, Avant Browser, MyIE2, Optimal Desktop, Ace Explorer, Advanced Browser, 27 Tools-in-1 Wichio Browser, WindowSurfer, 550 Access Browser, FineBrowser Freeware, Kopassa Browser, Fast Browser Pro, Enigma Browser, GoSuRF, K-Meleon, Smart Explorer, The Off By One Web Browser, Smartalec Voyager, CrystalPort AppCapture, The Family Browser, XANA Web Browser, Bluto, AutoSurf, 32bit Web Browser, BrowseMan, WrestlingBrowser, Eminem Browser, UltraBrowser, Cygsoft LDAP Browser, and Net M@nager. Internet Download Manager supports all versions of popular browsers, and can be integrated into any 3rd party Internet applications.\n- Easy downloading with one click. When you click on a download link in a browser, IDM will take over the download and accelerate it. IDM supports HTTP, FTP, HTTPS and MMS protocols.\n- Download Speed Acceleration. Internet Download Manager can accelerate downloads by up to 5 times due to its intelligent dynamic file segmentation technology. Unlike other download managers and accelerators Internet Download Manager segments downloaded files dynamically during download process and reuses available connections without additional connect and login stages to achieve best acceleration performance.\n- Download Resume. Internet Download Manager will resume unfinished download from the place where they left off.\n- YouTube grabber. Internet Download Manager can grab FLV videos from popular sites like YouTube, MySpaceTV, and Google Video.\n- Simple installation wizard. Quick and easy installation program will make necessary settings for you, and check your connection at the end to ensure trouble free installation of Internet Download Manager\n- Drag and Drop. You may simply drag and drop links to IDM, and drag and drop downloaded files out of Internet Download Manager.\n- Automatic Antivirus checking. Antivirus checking makes your downloads free from viruses and trojans.\n- Advanced Browser Integration. When enabled, the feature can be used to catch any download from any application. None of download managers have this feature.\n- Built-in Scheduler. Internet Download Manager can connect to the Internet at a set time, download the files you want, disconnect, or shut down your computer when it's done.\n- IDM includes web site spider and grabber. IDM downloads all required files that are specified with filters from web sites, for example all pictures from a web site, or subsets of web sites, or complete web sites for offline browsing. It's possible to schedule multiple grabber projects to run them once at a specified time, stop them at a specified time, or run periodically to synchronize changes.\n- IDM supports many types of proxy servers. For example, IDM works with Microsoft ISA, and FTP proxy servers.\n- IDM supports main authentication protocols: Basic, Negotiate, NTLM, and Keberos. Thus IDM can access many Internet and proxy servers using login name and password.\n- Download All feature. IDM can add all downloads linked to the current page. It's easy to download multiple files with this feature.\n- Customizable Interface. You may choose the order, and what buttons and columns appear on the main IDM window.\n- Download Categories. Internet Download Manager can be used to organize downloads automatically using defined download categories.\n- Quick Update Feature. Quick update may check for new versions of IDM and update IDM once per week.\n- Download limits. Progressive downloading with quotas feature. The feature is useful for connections that use some kind of fair access policy (or FAP) like Direcway, Direct PC, Hughes, etc.\n\n\n=================================================================\n\n\nFor anyone WHO MAY HAVE issues with installation, extraction, wrong file extensions, passwords etc for this or any of my other installer torrents. Go to:\n\nStart-Computer-Documents-Organize-Folder and search options-View\n\nThen from the scroll menu that appears, un-tick the option of &quot;Hide extensions for known file types&quot;. Click on &quot;Apply&quot; and then click on &quot;OK&quot; (Screen shot below):\n   &lt;a href=&quot;\nhttp://i.imgur.com/5rFrOno.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/5rFrOno.jpg&lt;/a&gt;\n\nOnce you've done that. Return to your downloaded installer torrent of mine and change the file extension to .exe\n\nThen right click on it and select &quot;Run as administrator&quot;. \n\nNONE of my torrents are, or ever have been passworded or have any other type of security, re-directs etc on them.\n\nThe 3 icons on the bottom of the installer, when clicked:\n=========================================================\n\n1. Brings you to thepiratebay.se @ EFNet.\n\n &lt;a href=&quot;\nhttp://irc.lc/efnet/thepiratebay.se/t4nk@@@&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://irc.lc/efnet/thepiratebay.se/t4nk@@@&lt;/a&gt;\n\n\n2. Brings you to 2010kaiser torrents @ TPB.\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2010kaiser/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2010kaiser/&lt;/a&gt;\n\n\n3. Brings you to -nelly- torrents @ TPB.\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/-nelly-/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/-nelly-/&lt;/a&gt;\n\n\n\nHave fun and play nice ;-)\n\n\n=================================================================\n\n\n-nelly- home page at The Pirate Bay link below:\n\n    &lt;a href=&quot;\nhttp://thepiratebay.se/user/-nelly-/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/-nelly-/&lt;/a&gt;\n\n\nCheck out the new PirateWiki!\n\n             &lt;a href=&quot;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&lt;/a&gt;\n\n\nFor re-seed requests, help, support or anything else relating to The Pirate Bay. You'll find it all, and more, at suprbay. The official support forum of The Pirate Bay. Visit it at the link below:\n\n    &lt;a href=&quot;\nhttps://forum.suprbay.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/&lt;/a&gt; \n\n\n-nelly- / 2010kaiser","torrent":{"xt":"urn:btih:8a6be56d53e021ffb600286c5c85095f6d962e20","amp;dn":"Internet+Download+Manager+%5BIDM%5D+v6.18+Build+5+Installer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a6be56d53e021ffb600286c5c85095f6d962e20","infoHashBuffer":{"type":"Buffer","data":[138,107,229,109,83,224,33,255,182,0,40,108,92,133,9,95,109,150,46,32]},"announce":[],"urlList":[]}}