{"title":"[TabooHandJobs / Clips4Sale] Maya Hills (You cant afford this Pl","uid":13567797,"size":205391803,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:8a7564785229757fb288ceca64000d9de21c0c15&amp;dn=%5BTabooHandJobs+%2F+Clips4Sale%5D+Maya+Hills+%28You+cant+afford+this+Pl&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"ImgSnaps","files":1,"time":1455645793,"description":"[TabooHandJobs / Clips4Sale] Maya Hills (You cant afford this Platinum pussy) 720p [Roleplay]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/kCY\r\n \nhttp://imgsnaps.com/image/kCa\r\n\r\nYou can't afford this Platinum pussy.\r\nThere you are spying again. You heard me making a deal didn't you? How else do you think I afford that beamer in the driveway? I can hardly wait to move out of here into my own place and be away from you. Ever since our parent's married all you do is creep me out with your lingering where ever I am. You're in college, shouldn't you be hanging out with people your own age or have a girlfriend? You probably can't get a girlfriend. So what is it going to take to keep your mouth shut about what you heard? No way am I going to fuck you. This pussy is platinum and I know for a fact you don't have enough in your bank account to afford it. Tell you what, I won't fuck you but I will jerk you off to keep you quiet. You heard me right, all you are going to get from me is a cock cranking. You don't get to touch me nor do you get to talk to me while I am doing it. You know I have to leave soon for my appointment so hurry and lie down and let me do my thing.\r\n\r\nHow does it feel having a girl's hands on your dick? Not just any girl, your step-sister! You're such a twisted little pervert that you probably like my hands wrapped around your dick more than some random college girl. Don't think I haven't seen you outside my bathroom door trying to catch a glimpse of my sweet body. Does it turn you on knowing your sister gets fucked for money? Ah look how close my money maker is to your cock except my panties don't come off for you. I wonder if your dad is as big of a pervert as you. I'd fuck your dad, my step-dad but it would cost you double if you ever had enough money to pay for my pussy. You want to hear the best night I had? I got paid 5k to let a guy eat my ass out for an hour. You want to see what a 5k ass looks like? It's right here in front of your face little brother but I don't fuck for free. I may fuck you without a condom for the right price though so think about my sweet pussy and ass and start saving your money.\r\n\r\nOk, enough of showing you my sexy self. You need to hurry up and cum so I can get to my appointment. You can't just black mail me and not cum so give it to me. This is almost a freebie so hurry up. How does that tight grip feel on your dick? You gonna black mail me ever again? Try and see what happens. Now I gotta get cleaned up and go fuck a real man for money. Keep your fucken mouth shut about this or you will find my foot shoved so far up your package that it's going to wind up in your throat","torrent":{"xt":"urn:btih:8a7564785229757fb288ceca64000d9de21c0c15","amp;dn":"%5BTabooHandJobs+%2F+Clips4Sale%5D+Maya+Hills+%28You+cant+afford+this+Pl","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a7564785229757fb288ceca64000d9de21c0c15","infoHashBuffer":{"type":"Buffer","data":[138,117,100,120,82,41,117,127,178,136,206,202,100,0,13,157,226,28,12,21]},"announce":[],"urlList":[]}}