{"title":"Knowing (2009)(ENG)(NL SUBS) 2Lions-Team","uid":5249592,"size":4685103199,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8a9031e013cbc36a6095f1c3421c19487e2fd7c7&amp;dn=Knowing+%282009%29%28ENG%29%28NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1262277270,"description":"Knowing (2009) \n\n      \n\n Verenigde Staten / Verenigd Koninkrijk\nThriller / Science-Fiction\n130 minuten\n\ngeregisseerd door Alex Proyas\nmet Nicolas Cage, Rose Byrne en Chandler Canterbury\n\nIn 1959 werd tijdens de oprichtingsceremonie van een basisschool een tijdscapsule begraven. Nu, vijftig jaar later, wordt hij geopend. Een professor, John Koestler (Nicolas Cage), ontdekt cryptische boodschappen die zich in de capsule bevinden en bovendien doet hij een angstaanjagende ontdekking: de boodschappen voorspellen met zeer grote precisie iedere grote ramp van de afgelopen 50 jaar. Een aantal voorspellingen die in het document staan moet nog plaatsvinden. John doet er vervolgens alles aan om de autoriteiten te waarschuwen, maar tevergeefs. John moet nu zelf alles op alles zetten om het dreigende gevaar af te wenden.\n\n\nEnglish\n\nIn the fall of 1959, for a time capsule, students draw pictures of life as they imagine it will be in 50 years. Lucinda, an odd child who hears voices, swiftly writes a long string of numbers. In 2009, the capsule is opened; student Caleb Koestler gets Lucinda's &quot;drawing&quot; and his father John, an astrophysicist and grieving widower, takes a look. He discovers dates of disasters over the past 50 years with the number who died. Three dates remain, all coming soon. He investigates, learns of Lucinda, and looks for her family. He fears for his son, who's started to hear voices and who is visited by a silent stranger who shows him a vision of fire and destruction. What's going on?\n\n\n\n\n\n\nRetail dvd pal 16:9\nAudio: DD 5.1 Engels\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nMenu:Ja \nOndertitels : Nederlands (instelbaar)\n\nGenre : Science Fiction\nThriller\n\nWeblink : http://moviemeter.nl/film/48950 \nWeblink : http://www.imdb.com/title/tt0448011\n\n\n***************************************** \n\nBrought to you by\n2Lions Team \n\n        \n\n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de CD binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!","torrent":{"xt":"urn:btih:8a9031e013cbc36a6095f1c3421c19487e2fd7c7","amp;dn":"Knowing+%282009%29%28ENG%29%28NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a9031e013cbc36a6095f1c3421c19487e2fd7c7","infoHashBuffer":{"type":"Buffer","data":[138,144,49,224,19,203,195,106,96,149,241,195,66,28,25,72,126,47,215,199]},"announce":[],"urlList":[]}}