{"title":"The Chrysalids - BBC Broadcast","uid":3846453,"size":13514547,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8b1c389eca0c29288e18e80f71491999b0bab7a6&amp;dn=The+Chrysalids+-+BBC+Broadcast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"meh_64_12","files":3,"time":1192669070,"description":"Imagine living in a world where an extra toe on a newborn will automatically result in the death of the baby, a horse that is larger than normal will be put down, and corn kernels that are not in perfectly formed rows will result in burning an entire field. This world exists in John Wyndham?s novel, The Chysalids.\n\nThis is the world of David, the main character of the novel. As a child, he often dreamed of a world filled with objects considered fantastical in his world, such as flying objects and carts that move without the helps of horses. However, as David grows older, he realizes that he has the ability to communicate telepathically. This ability means that David would be considered to be an offence in his community.\n\nDavid does not understand the severity of being considered an Offence until he meets Sophie, a girl who was born with an extra toe on each foot. David befriends Sophie and keeps her secret. When her secret is discovered by another boy in the district, Sophie and her family are forced to flee. As a result of this, David realizes that, if his secret is discovered, he will suffer dire and severe circumstances. \n\nWikipedia: http://en.wikipedia.org/wiki/The_Chrysalids","torrent":{"xt":"urn:btih:8b1c389eca0c29288e18e80f71491999b0bab7a6","amp;dn":"The+Chrysalids+-+BBC+Broadcast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b1c389eca0c29288e18e80f71491999b0bab7a6","infoHashBuffer":{"type":"Buffer","data":[139,28,56,158,202,12,41,40,142,24,232,15,113,73,25,153,176,186,183,166]},"announce":[],"urlList":[]}}