{"title":"Tony Judt, Timothy Snyder - Thinking the Twentieth Century","uid":7990578,"size":433949836,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8bc50a62d8d33aed09ec1e18a4f5e0d88722a2ca&amp;dn=Tony+Judt%2C+Timothy+Snyder+-+Thinking+the+Twentieth+Century&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zis123","files":-1,"time":1357405969,"description":"Here is the final book of unparalleled historian Tony Judt. Where Judt's masterpiece Postwar redefined the history of modern Europe by uniting the stories of its eastern and western halves, Thinking the Twentieth Century unites the century's conflicted intellectual history into a single soaring narrative. The 20th century comes to life as the age of ideas - a time when, for good or for ill, the thoughts of the few reigned over the lives of the many. Judt presents the triumphs and the failures of public intellectuals, adeptly extracting the essence of their ideas and explaining the risks of their involvement in politics. Spanning the entire era and all currents of thought, this is a triumphant tour de force that restores clarity to the classics of modern thought with the assurance and grace of a master craftsman.\nThe exceptional nature of this work is evident in its very structure - a series of luminous conversations between Judt and his friend and fellow historian Timothy Snyder, grounded in the texts of their trade and focused by the intensity of their vision. Judt's astounding eloquence and range of reference are on display as never before. Traversing the century's complexities with ease, he and Snyder revive both thoughts and thinkers, guiding us through the debates that made our world. As forgotten treasures are unearthed and overrated thinkers are dismantled, the shape of a century emerges. Judt and Snyder make us partners in their project as we learn the ways to think like a historian or even like a public intellectual. We begin to experience the power of historical perspective for the critique and reform of society and for the pursuit of the good from day to day.\nIn restoring - and exemplifying - the best of the intellectual life of the 20th century, Thinking the Twentieth Century charts a pathway for moral life in the 21st. An incredible achievement, this book is about the life of the mind - and the mindful life.","torrent":{"xt":"urn:btih:8bc50a62d8d33aed09ec1e18a4f5e0d88722a2ca","amp;dn":"Tony+Judt%2C+Timothy+Snyder+-+Thinking+the+Twentieth+Century","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bc50a62d8d33aed09ec1e18a4f5e0d88722a2ca","infoHashBuffer":{"type":"Buffer","data":[139,197,10,98,216,211,58,237,9,236,30,24,164,245,224,216,135,34,162,202]},"announce":[],"urlList":[]}}