{"title":"Big Brother US S15E05 PDTV x264 2HD","uid":8658743,"size":321482922,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8c6050f2b8394f2c6eb2fc259937c1a6e3d2ad1d&amp;dn=Big+Brother+US+S15E05+PDTV+x264+2HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Thhaque","files":2,"time":1373272313,"description":"Big Brother (US)\n\nHost : Julie Chen\nHouseGuests : Aaryn Gries, Amanda Zuckerman, Andy Herren, Candice Stewart, David Girton, Elissa Slater\nGinaMarie Zimmerman, Helen Kim, Howard Overby, Jeremy McGuire, Jessie Kowalski, Judd Daugherty, Kaitlin Barnaby, McCrae Olson, Nick Uhas, Spencer Clawson.\nRelease Date : June 26, 2013\nCountry : USA \nYear : 2013\n\nBig Brother 15 is the fifteenth season of the American reality television series Big Brother. The season premiered on CBS on June 26, 2013 and will conclude on September 18, 2013. It has been billed as the longest season to date, and is set to last for a total of 90 days. This season is also set to feature sixteen HouseGuests, tying it for the most HouseGuests to compete in a single season. Unlike the previous two seasons, all of the competing HouseGuests are new to the series.\nThe premise of the series remained largely unchanged from previous editions of the series, in which a group of contestants, known as &quot;HouseGuests,&quot; compete to win the series by voting each other off and being the last HouseGuest remaining. One HouseGuest, known as the Head of Household, must nominate two of their fellow HouseGuests for eviction. The winner of the Power of Veto can remove one of the nominees from the block, forcing the HoH to nominate another HouseGuest. The HouseGuests then vote to evict one of the nominees, and the HouseGuest with the most votes is evicted. When only two HouseGuests remained, the last seven evicted HouseGuests, known as the Jury of Seven, would decide which of them would win the $500,000 prize. A HouseGuest can be expelled from the show for breaking rules, such as engaging in violent and disruptive behavior. This season introduced the &quot;M.V.P.&quot; twist, in which viewers would select one HouseGuest each week to earn the right to nominate one HouseGuest. This is in addition to the Head of Household nominating two HouseGuests per week, increasing the number of nominated HouseGuests to three. Though the number of nominations increased, only one of the nominees would be evicted each week.\n","torrent":{"xt":"urn:btih:8c6050f2b8394f2c6eb2fc259937c1a6e3d2ad1d","amp;dn":"Big+Brother+US+S15E05+PDTV+x264+2HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c6050f2b8394f2c6eb2fc259937c1a6e3d2ad1d","infoHashBuffer":{"type":"Buffer","data":[140,96,80,242,184,57,79,44,110,178,252,37,153,55,193,166,227,210,173,29]},"announce":[],"urlList":[]}}