{"title":"Functional Foods and Nutraceuticals Series","uid":13705018,"size":93662499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c90bcbcbb82264728bef0dea5a558471c31fae3&amp;dn=Functional+Foods+and+Nutraceuticals+Series&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":12,"time":1456817593,"description":"The Functional Foods and Nutraceuticals Series provides timely and comprehensive information on the emerging science, technology, and processing of functional foods and nutraceuticals. It also covers traditional health-foods from around the world, which have been showing to play an active role in preventing or delaying the onset of diseases, especially chronic diseases, and keeping people’s health in a normal condition. The series will comprise (i) books on globally known foods of plant and animal origin, (such as dairy, meat, fish, vegetables, cereals, root crops, soya beans, legumes, pickles, starter cultures and probiotic cultures), their manufacture, chemical and microbiological composition, processing, compositional and functional modifications taking place as a result of microbial and enzymic effects, their safety, legislation, development of novel products, and opportunities for industrialization, (ii) books providing information on the traditional health-food from Africa, Asia (South, East, and South-East), Europe, Latin America, and Middle East, their traditional and industrialized processes and their contribution to human health, and (iii) books covering several aspects of general interest such as processing of food by-products, biotechnology, engineering of solid-state processes, modern chemical and biological analytical approaches, safety, health and consumer perception. The books will be aimed at professional food scientists, academicians researching food engineering problems, and graduate level students","torrent":{"xt":"urn:btih:8c90bcbcbb82264728bef0dea5a558471c31fae3","amp;dn":"Functional+Foods+and+Nutraceuticals+Series","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c90bcbcbb82264728bef0dea5a558471c31fae3","infoHashBuffer":{"type":"Buffer","data":[140,144,188,188,187,130,38,71,40,190,240,222,165,165,88,71,28,49,250,227]},"announce":[],"urlList":[]}}