{"title":"The Dig Tree- A True Story of Bravery, Insanity, and the Race to","uid":11009589,"size":42691232,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ca5cde97dd9a6aa0deda65337d233109eeb8a52&amp;dn=The+Dig+Tree-+A+True+Story+of+Bravery%2C+Insanity%2C+and+the+Race+to&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1410329032,"description":"The harrowing true story of the Burke and Willis expedition team who took on the Australian wilds 150 years ago--and lost.\n\nThey departed Melbourne's Royal Park in the summer of 1860, a misfit party of eighteen amateur explorers cheered on by thousands of well-wishers. Their mission: to chart a course across the vast unmapped interior of Australia, from Melbourne to the northern coast. Months later, only one man returned alive--with tales of heroism, hardships, and lost opportunities that were by turns terrifying and darkly comic.\n\nDrawing its title from one of the few remaining traces of the expedition, The Dig Tree combines the danger of Sebastian Junger with the irony of Bill Bryson to relive the tragic journey of these completely initiated adventurers. The cast of characters includes the expeditionleader; a reckless, charming Irish policeman known for getting lost on his way home from the pub; an eccentric nature enthusiast from Germany; an alcoholic camel handler; and a rogue American horse-breaker who is just in it for the money. For nine harrowing months, their quest for glory shifts from idiocy to perseverance and then inexorably toward tragedy. The nightmare culminates in a last haunting message left behind a group of desperate and dying men--the word DIG carved into what is now Australia's most famous tree.\n\nThe Dig Tree follows this compelling journey through a forgotten corner of history to examine a daring expedition that came unbelievably close to success only to let it slip away.","torrent":{"xt":"urn:btih:8ca5cde97dd9a6aa0deda65337d233109eeb8a52","amp;dn":"The+Dig+Tree-+A+True+Story+of+Bravery%2C+Insanity%2C+and+the+Race+to","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ca5cde97dd9a6aa0deda65337d233109eeb8a52","infoHashBuffer":{"type":"Buffer","data":[140,165,205,233,125,217,166,170,13,237,166,83,55,210,51,16,158,235,138,82]},"announce":[],"urlList":[]}}