{"title":"Initiation Thaddeus Music by Sanaya Roman","uid":4195127,"size":180577126,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8ccbcc801dd2fc3b3373c64c7f2727bd424908c8&amp;dn=Initiation+Thaddeus+Music+by+Sanaya+Roman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"iloveabrahamhicks","files":4,"time":1211170390,"description":"Initiation\nThis music by Thaddeus has many sparkling sounds, and is filled with angelic voices, harp, strings, piano, and other sounds to assist you in experiencing and living in a higher level of light.  As you open to more light you can see all that the light reveals, so you can better know and express the love, beauty, and light within you.\n\nThis is peaceful, relaxing, soothing music that will expand your consciousness and relax your body as you listen. Each album has approximately 2 hours of music and is ideal for meditation, healing, relaxation, and for pure listening enjoyment. \n\nSide 1 Divine Spark\nThe energies transmitted in this music send a divine spark to you from the Solar light to transform the very core of your being into a higher vibratory note. Sparkling, twinkling, light music. As you listen, affirm that you are ready to grow, to open to your full potential. \n\nSide 2 Rising into Light\nRise into the Solar light, the light of Higher Will and Purpose. Bring this light into your mind, emotions, and body; let it transform your personality and open your heart.  Allow your vision to expand as you awaken to higher, finer frequencies of light and bring them into every area of your life.  Uplifting, melodic, and inspiring music with a musical theme.\n\nSide 3 Surrendering\nSurrender to your higher good. Open your heart to trust the universe, and to believe in yourself.  As you listen, take something that you want to release, change, or evolve, and surrender it to the light of Divine Purpose and Higher Will.  Soothing, steady, twinkling music.\n\nSide 4 Initiation\nThe Masters and beings of light join with you to celebrate your new light. A note is sounded and a ceremony of initiation begins.  A transmission of light is made to key your vibratory note to a higher level.  Listen to the sound of your soul&amp;#039;s note as it becomes clear, vibrant, and strong.  Reverential, uplifting music with a beautiful melody. \n &lt;a href=&quot;\nhttp://www.orindaben.com/products/ms203d.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orindaben.com/products/ms203d.php&lt;/a&gt;","torrent":{"xt":"urn:btih:8ccbcc801dd2fc3b3373c64c7f2727bd424908c8","amp;dn":"Initiation+Thaddeus+Music+by+Sanaya+Roman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ccbcc801dd2fc3b3373c64c7f2727bd424908c8","infoHashBuffer":{"type":"Buffer","data":[140,203,204,128,29,210,252,59,51,115,198,76,127,39,39,189,66,73,8,200]},"announce":[],"urlList":[]}}