{"title":"The Loudest Voice in the Room (2014) Gabriel Sherman (multi)","uid":9506101,"size":4897409,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d3e0733271c1e5148ab8134f1aaa2538b14ac2c&amp;dn=The+Loudest+Voice+in+the+Room+%282014%29+Gabriel+Sherman+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"7","files":-1,"time":1390320215,"description":"The Loudest Voice in the Room: How the Brilliant, Bombastic Roger Ailes Built Fox News - And Divided a Country (2014) Gabriel Sherman (multi)\n\nThe Loudest Voice in the Room: How the Brilliant, Bombastic Roger Ailes Built Fox News - And Divided a Country by Gabriel Sherman\n\n\nFormat: mobi/epub/azw3\nLength: 560 pages\nGenre: Non-Fiction/Media\nDate: 7 January 2014\n\nA deeply reported journey inside the secretive world of Fox News and the life of its combative, visionary founder.\n\nWhen Rupert Murdoch enlisted Roger Ailes to launch a cable news network in 1996, American politics and media changed forever. Now, with a remarkable level of detail and insight, New York magazine reporter Gabriel Sherman brings Ailes's unique genius to life, along with the outsize personalities - Bill O'Reilly, Sean Hannity, Megyn Kelly, Sarah Palin and others - who have helped Fox News play a defining role in the great social and political controversies of the past two decades.\n\nFrom the Clinton-Lewinsky scandal to the Bush-Gore recount, from the war in Iraq to the Tea Party attack on the Obama presidency, Roger Ailes has developed an unrivaled power to sway the national agenda. Even more, he has become the indispensable figure in conservative America and the man any Republican politician with presidential aspirations must court.\n\nDrawing on hundreds of interviews with Fox News insiders past and present, Sherman documents Ailes's tactical acuity as he battles the press, business rivals, and countless real and perceived enemies inside and outside Fox.\n\nRoger Ailes's life is a story worthy of Citizen Kane. The Loudest Voice in the Room is an extraordinary feat of reportage with a compelling human drama at its heart.\n\nAuthor:\n\nGabriel Sherman is a contributing editor at New York magazine. His journalism has appeared in The New York Times, The New Republic, The New York Observer, and GQ, among other publications. He has served as a commentator on National Public Radio, CNN, Fox News, MSNBC's Morning Joe, NBC's Today show, and ABC's World News. Since 2012, he has been a Bernard L. Schwartz Fellow at the New America Foundation.","torrent":{"xt":"urn:btih:8d3e0733271c1e5148ab8134f1aaa2538b14ac2c","amp;dn":"The+Loudest+Voice+in+the+Room+%282014%29+Gabriel+Sherman+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d3e0733271c1e5148ab8134f1aaa2538b14ac2c","infoHashBuffer":{"type":"Buffer","data":[141,62,7,51,39,28,30,81,72,171,129,52,241,170,162,83,139,20,172,44]},"announce":[],"urlList":[]}}