{"title":"The Better End Surviving (and Dying) on Your Own Terms in Today'","uid":12738360,"size":1809362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d918037015f56920e22389ece45af6c43a17cc6&amp;dn=The+Better+End+Surviving+%28and+Dying%29+on+Your+Own+Terms+in+Today%27&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1447209435,"description":"While modern Americans strive to control nearly every aspect of their lives, many of us abandon control of life's final passage. But the realities of twenty-first-century medicine will allow most of us to have a say in how, when, and where we die, so we need to make decisions here, too. Through compelling real-life stories and practical guidance, this book helps readers navigate end-of-life care for themselves and their loved ones.\r\nThe Better End is about hope, empowerment, and inspiration. What we choose for our end-of-life care depends on accurate information and on our personal values. We need not only to understand new medical advances but also to appreciate the wisdom of humanity's past and present.\r\nDan Morhaim, a practicing physician and Maryland state legislator, guides readers through the medical and legal maze of end-of-life care. He details the care choices available to patients and explains why living wills and advance directives are a necessity for every American. He tells readers where to find free and readily available living wills and advance directives and why it is so important for everyoneyoung and oldto complete them.\r\nDr. Morhaim helps readers keep decisions in their own hands and spare their families the uncertainty and trauma of guessing about their end-of-life wishes. With this book, he breaks down the barriers to a difficult but essential topic, helping readers to open this often avoided discussion with their loved ones and providing the information and guidance needed to ensure that deeply held values are reflected and honored","torrent":{"xt":"urn:btih:8d918037015f56920e22389ece45af6c43a17cc6","amp;dn":"The+Better+End+Surviving+%28and+Dying%29+on+Your+Own+Terms+in+Today%27","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d918037015f56920e22389ece45af6c43a17cc6","infoHashBuffer":{"type":"Buffer","data":[141,145,128,55,1,95,86,146,14,34,56,158,206,69,175,108,67,161,124,198]},"announce":[],"urlList":[]}}