{"title":"Crystal Castles - (III) (2012) [FLAC]","uid":7831863,"size":272978330,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8da348bf3f19a864a58d85363766b50d26aa1a03&amp;dn=Crystal+Castles+-+%28III%29+%282012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1353074993,"description":"\n  Crystal Castles - (III) (2012) [FLAC]\n\n  Released: 2012\n  Duration: 39:33\n  Genre: Electronic\n  Style: Indie Electronic\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n  \n  01 Plague  \n  02 Kerosene \n  03 Wrath of God \n  04 Affection  \n  05 Pale Flesh  \n  06 Sad Eyes \n  07 Insulin  \n  08 Transgender  \n  09 Violent Youth  \n  10 Telepath  \n  11 Mercenary  \n  12 Child I Will Hurt You \n\nIII's haunting cover photo of a Muslim woman protecting her son might seem initially like it was chosen just to get attention, but it's actually the perfect representation of the album's complex mix of bleakness and comfort. This is Crystal Castles' most serious set of songs yet, with a darker tone and streamlined sound that dovetails with its motifs of outsiders, injustices, and revolution. Ethan Kath and Alice Glass' second album showed the duo was expanding their 8-bit vocabulary, and that comes to fruition here, particularly on the album-opener &quot;Plague&quot; and &quot;Wrath of God,&quot; where Glass' distant rage and Kath's shadowy, claustrophobic synths invert their previously fiery electro-punk into something colder and more lingering. II standouts &quot;Baptism&quot; and &quot;Not in Love&quot; provide the template for some of III's best moments: &quot;Telepath&quot; and &quot;Affection,&quot; which temper their tear-stained whispers with some of the duo's most straightforward and danceable beats, could soundtrack the world's saddest rave; &quot;Transgender&quot; adds a dash of fury to the mix, and &quot;Sad Eyes,&quot; the album's most immediate song, amps up the drama and heartbreak to levels guaranteed to cut a swath on the dancefloor. Melody plays a bigger role on III than it did in Crystal Castles' earlier music, from Glass' more refined and nuanced singing to the beautifully ominous feel of &quot;Mercenary&quot; and especially &quot;Child I Will Hurt You,&quot; which closes the album with a sparkling sadness like a broken snow globe. Artistic progress is as much about subtraction as it is about addition, and on III, Crystal Castles have made room to be sad, angry, pretty, and danceable at the same time. That's an unusual mix of emotions, and while it might be condescending to say that they've grown up, they've certainly outgrown many of the preconceptions about what their music can be.","torrent":{"xt":"urn:btih:8da348bf3f19a864a58d85363766b50d26aa1a03","amp;dn":"Crystal+Castles+-+%28III%29+%282012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8da348bf3f19a864a58d85363766b50d26aa1a03","infoHashBuffer":{"type":"Buffer","data":[141,163,72,191,63,25,168,100,165,141,133,54,55,102,181,13,38,170,26,3]},"announce":[],"urlList":[]}}