{"title":"Designing Green Cement Plants - S.P. Deolalkar","uid":15462967,"size":25193204,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dc3931e6ff736744fa93e58ea835a1b552f3687&amp;dn=Designing+Green+Cement+Plants+-+S.P.+Deolalkar&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470068134,"description":"Designing Green Cement Plants - S.P. Deolalkar (BH, 2016).pdf\r\n\r\nCement production is known to be a polluting and energy-intensive industry. Cement plants account for 5 percent of global emissions of carbon dioxide and one of the main causes of global warming. However, cement it is literally the glue of progress. Designing Green Cement Plants provides the tools and techniques for designing new large cement plants that would promote sustainable growth, preserve natural resources to the maximum possible extent and make least possible additions to the Greenhouse Gases that cause global warming.\r\n\r\nBrief and but authoritative, this title embraces new technologies and methods such as Carbon Capture and Sequestration, as well as methods for harnessing renewable energy sources such as wind and solar. The author also discusses the efficient use of energy and materials through the use recycling. In addition, this book also examines thepossibilities of developing green cement substitutes such as Calera, Caliix, Novacem, Aether and Geopolymer cements.\r\n\r\n\r\n\r\nIncludes the tools and methods for reducing the emissions of greenhouse Gases\r\nExplores technologies such as: carbon capture and storage and substitute cements\r\nProvides essential data to determining the unique factors involved in designing large new green cement plants\r\nIncludes interactive excel spreadsheets\r\nMethods for preforming a cost benefits analysis for the production of green cements as opposed to conventional OPC","torrent":{"xt":"urn:btih:8dc3931e6ff736744fa93e58ea835a1b552f3687","amp;dn":"Designing+Green+Cement+Plants+-+S.P.+Deolalkar","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc3931e6ff736744fa93e58ea835a1b552f3687","infoHashBuffer":{"type":"Buffer","data":[141,195,147,30,111,247,54,116,79,169,62,88,234,131,90,27,85,47,54,135]},"announce":[],"urlList":[]}}