{"title":"Hard Core Logo - A Tribute To 1996 (Soundtrack) [FLAC] Kitlope","uid":6570041,"size":328905154,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8e31cfcb778786e6e1a5af0595bb447ce366f283&amp;dn=Hard+Core+Logo+-+A+Tribute+To+1996+%28Soundtrack%29+%5BFLAC%5D+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kitlope","files":19,"time":1311901422,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nCd Hardware: Plextor PX-716SA \nPlextor Firmware: 1.11 (Final)\nCd Software: Exact Audio Copy V1.0 Beta 1 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 8E31CFCB778786E6E1A5AF0595BB447CE366F283\nFile Size: 313.66 MB\nYear: 1996\nLabel: Sony Music Canada / BMG\nCatalog #: 74321-42086-2\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nHard Core Logo is a 1996 Canadian mockumentary adapted by Noel Baker from the novel of the same name by author Michael Turner. Director Bruce McDonald illustrates the self-destruction of punk rock. Released in 1996, the film documents a once-popular punk band, Hard Core Logo, which is composed of lead singer Joe Dick (Hugh Dillon), fame-tempted guitarist Billy Tallent (Callum Keith Rennie), schizophrenic bass player John Oxenberger (John Pyper-Ferguson), and drummer Pipefitter (Bernie Coulson). Julian Richings plays Bucky Haight, Dick's idol. Several notable punk musicians, including Art Bergmann, Joey Shithead and Joey Ramone, play themselves in cameos. Canadian television personality Terry David Mulligan also has a cameo, playing a fictionalized version of himself.\n\nThe film has been frequently ranked amongst the greatest movies ever to come out of Canada. In a 2001 poll of 200 industry voters, performed by Playback, Hard Core Logo was named the second best Canadian film of the last 15 years. In 2002, readers of Playback voted it the 4th greatest Canadian film ever made.\n\nIn August 2008, McDonald stated that sequels were in the works.\n\n\n\n\n\n\nA Tribute To Hard Core Logo 1996\n\n\nA Tribute to Hard Core Logo is a 1996 album, which was released as an unofficial soundtrack to Bruce McDonald's film Hard Core Logo.\n\nThe film is a mockumentary about the reunion tour of a fictional Canadian punk rock band, Hard Core Logo. Instead of releasing a conventional soundtrack, McDonald compiled a tribute album, asking a number of notable Canadian and international bands to record cover versions of the film's songs. The album was packaged as if Hard Core Logo were a real band, with the participating musicians also contributing quotes about Hard Core Logo's influence on their own music.\n\nAs part of the promotion for the album and film, McDonald placed classified ads in many Canadian publications, purporting to be from fans looking to buy Hard Core Logo memorabilia. Some real fans actually looking to purchase real promotional materials, such as movie posters or rare vinyl copies of the album, were forced to append comments in their advertisements to clarify that their ads were real.\n\nThe music video for &quot;Blue Tattoo&quot; by The Super Friendz appears on the Canadian VHS of the film.\n\nA true soundtrack album, Hard Core Logo, was subsequently released in 1998.\n\n\n\nTracks: \n\n\n1.\tThe Headstones, &quot;Son of a Bitch to the Core&quot;\n2.\tThe Pursuit of Happiness, &quot;Edmonton Block Heater&quot;\n3.\tRusty, &quot;Let's Break Robert Out of Jail&quot;\n4.\tDream Warriors, &quot;Edmonton Block Heater&quot;\n5.\tFishbone, &quot;Words and Music&quot;\n6.\tThe Super Friendz, &quot;Blue Tattoo&quot;\n7.\tThe Lugen Brothers, &quot;Son of a Bitch to the Core&quot;\n8.\t54-40, &quot;Rock and Roll is Fat and Ugly&quot;\n9.\tSol, &quot;Blue Tattoo&quot;\n10.\tDoughboys, &quot;Something's Gonna Die Tonight&quot;\n11.\tChris Spedding, &quot;China White&quot;\n12.\tKinnie Starr, &quot;Canadian Bush Party&quot;\n13.\tOdds, &quot;Pipefitter's Clubhouse&quot;\n14.\tcub, &quot;Who the Hell Do You Think You Are?&quot;\n15.\tSon, &quot;Blue Tattoo&quot;\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:8e31cfcb778786e6e1a5af0595bb447ce366f283","amp;dn":"Hard+Core+Logo+-+A+Tribute+To+1996+%28Soundtrack%29+%5BFLAC%5D+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e31cfcb778786e6e1a5af0595bb447ce366f283","infoHashBuffer":{"type":"Buffer","data":[142,49,207,203,119,135,134,230,225,165,175,5,149,187,68,124,227,102,242,131]},"announce":[],"urlList":[]}}