{"title":"Zeitgeist Refuted","uid":5671732,"size":1109996023,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f3e985dd9ef66c17acd159d4029205d913aea6a&amp;dn=Zeitgeist+Refuted&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Porkster","files":-1,"time":1278379685,"description":"Even secular scholars have rejected the idea of Christianity borrowing from the ancient mysteries. The well-respected Sir Edward Evans-Pritchard writes in Theories of Primitive Religion that &quot;The evidence for this theory is negligible.&quot;\n\nThe first real parallel of a dying and rising god does not appear until A.D. 150, more than a hundred years after the origin of Christianity. So if there was any influence of one on the other, it was the influence of the historical event of the New Testament [resurrection] on mythology, not the reverse. The only known account of a god surviving death that predates Christianity is the Egyptian cult god Osiris.\n\nIn this myth, Osiris is cut into fourteen pieces, scattered around Egypt, then reassembled and brought back to life by the goddess Isis. However, Osiris does not actually come back to physical life but becomes a member of a shadowy underworld...This is far different than Jesus' resurrection account where he was the gloriously risen Prince of life who was seen by others on earth before his ascension into heaven.&quot; --Dr. Norman Geisler\n\n&quot;Not one clear case of any alleged resurrection teaching appears in any pagan text before the late second century A.D., almost one hundred years after the New Testament was written.&quot; --Dr. Gary Habermas This film refutes the following claims made in the film Zeitgeist: -Christianity was borrowed from pagan myths? -The Bible was plagiarized? -Jesus wasn't a historical figure? -Christianity was created for social control? -The Bible is based on astrology?\n\nenjoy!! May YHWH bless you!  ;-)\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n* Be part of Advanced Science\n* Go to site to request reseeding!\n* Copy Our Torrents To All 'Open' Trackers!!!\n","torrent":{"xt":"urn:btih:8f3e985dd9ef66c17acd159d4029205d913aea6a","amp;dn":"Zeitgeist+Refuted","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f3e985dd9ef66c17acd159d4029205d913aea6a","infoHashBuffer":{"type":"Buffer","data":[143,62,152,93,217,239,102,193,122,205,21,157,64,41,32,93,145,58,234,106]},"announce":[],"urlList":[]}}