{"title":"Blackwood Farm - Anne Rice-viny","uid":6417974,"size":1761441,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9095aa32bbe34a233ad18da71d1445bafd6d7a11&amp;dn=Blackwood+Farm+-+Anne+Rice-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306226766,"description":"Blackwood Farm - Anne Rice-viny\n\nIn the past few years, many fans have sworn off Anne Rice, flinging her later novels against the wall with cries of \\&quot;First draft!\\&quot; and \\&quot;Never again!\\&quot; But these same fans may want to take a chance on her Southern gothic Blackwood Farm, a fast-paced and erotically charged, though uneven, novel of the Vampire Chronicles. Blackwood Farm has an unusual flaw: it isn\\'t long enough. Many of its triumphs and tragedies demand more development than they receive. Motivations are sometimes unlikely or unexplained, and the ending is far too rushed.\n\nBlackwood Farm introduces Quinn Blackwood, the sexy, eccentric young gentleman who becomes both a vampire and the heir to the Blackwood estate. All his life, Quinn has been haunted by Goblin, a doppelgÃƒÂ¤nger no one else can see--or believe in. But Goblin is real, and he is becoming maliciously tangible, strengthened by the blood that Quinn unwillingly drinks. Quinn\\'s only hope of liberation from his increasingly dangerous doppelgÃƒÂ¤nger is to find the legendary vampire Lestat. But Lestat has vowed to destroy any vampire who sets foot in New Orleans....\n\nBlackwood Farm features characters from both the Vampire Chronicles and the Mayfair Witches series, but this self-contained novel makes a good entry point for newcomers to Anne Rice\\'s fictional world (however, Vampire Chronicle virgins really should start with Interview With the Vampire, the first in the series and arguably the finest vampire novel of the 20th century","torrent":{"xt":"urn:btih:9095aa32bbe34a233ad18da71d1445bafd6d7a11","amp;dn":"Blackwood+Farm+-+Anne+Rice-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9095aa32bbe34a233ad18da71d1445bafd6d7a11","infoHashBuffer":{"type":"Buffer","data":[144,149,170,50,187,227,74,35,58,209,141,167,29,20,69,186,253,109,122,17]},"announce":[],"urlList":[]}}