{"title":"Nanoelectrochemistry [2015] [PDF]","uid":13228090,"size":102116752,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90c6f3c3397dfcfa1a80c23cd6c9b32372cb9c9f&amp;dn=Nanoelectrochemistry+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1452897096,"description":"Title: Nanoelectrochemistry \r\nAuthor: Michael V. Mirkin, Shigeru Amemiya \r\nFormat: PDF \r\nHardcover: 863 pages \r\nPublisher: CRC Press (March 27, 2015) \r\nLanguage: English \r\nISBN: 9781466561199 \r\n\r\n\r\nNanoscale electrochemistry has revolutionized electrochemical research and technologies and has made broad impacts in other fields, including nanotechnology and nanoscience, biology, and materials chemistry. Nanoelectrochemistry examines well-established concepts and principles and provides an updated overview of the field and its applications.\r\n\r\nThis book covers three integral aspects of nanoelectrochemistry. The first two chapters contain theoretical background, which is essential for everyone working in the field―specifically, theories of electron transfer, transport, and double-layer processes at nanoscale electrochemical interfaces. The next chapters are dedicated to the electrochemical studies of nanomaterials and nanosystems, as well as the development and applications of nanoelectrochemical techniques. Each chapter is self-contained and can be read independently to provide readers with a compact, up-to-date critical review of the subfield of interest. At the same time, the presented collection of chapters serves as a serious introduction to nanoelectrochemistry for graduate students or scientists who wish to enter this emerging field.\r\n\r\nThe applications discussed range from studies of biological systems to nanoparticles and from electrocatalysis to molecular electronics, nanopores, and membranes. The book demonstrates how electrochemistry has contributed to the advancement of nanotechnology and nanoscience. It also explores how electrochemistry has transformed itself by leading to the discovery of new phenomena, enabling unprecedented electrochemical measurements and creating novel electrochemical systems","torrent":{"xt":"urn:btih:90c6f3c3397dfcfa1a80c23cd6c9b32372cb9c9f","amp;dn":"Nanoelectrochemistry+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90c6f3c3397dfcfa1a80c23cd6c9b32372cb9c9f","infoHashBuffer":{"type":"Buffer","data":[144,198,243,195,57,125,252,250,26,128,194,60,214,201,179,35,114,203,156,159]},"announce":[],"urlList":[]}}