{"title":"Bleak House - Charles Dickens  BBC 4 1999","uid":4196662,"size":68801011,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:90f9478024ce1ef130080e7aa5c4ffb6bfda57f0&amp;dn=Bleak+House+-+Charles+Dickens++BBC+4+1999&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fervor","files":6,"time":1211260790,"description":"Bit Rate: 32 Kb/s\nQuality:  Very Good. No problems.\nTotal files:  5\nPlay time: 4 hours 46 minutes. No commercials.\n\nInformation below from  &lt;a href=&quot;\nhttp://www.nothing-fancy.com/michaelkitchen/reviews/bleakhouse.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nothing-fancy.com/michaelkitchen/reviews/bleakhouse.htm&lt;/a&gt;\n\nDramatisation by John Dryden\n\nMichael Kitchen stars as John Jarndyce in a BBC Radio 4 full-cast dramatisation of Dickens&amp;#039; classic tale of London and the law.\n\nAt its heart is the story of the icily beautiful Lady Dedlock, who nurses a dark secret, and the merciless lawyer Tulkinghorn, who seeks to uncover it.\n\nThe generous John Jarndyce, struggling with his own past, and his two young wards Richard and Ada, are all caught up, like Lady Dedlock, in the infamous case of Jarndyce vs. Jarndyce, which will make one of them rich beyond imagination if it can ever be brought to a conclusion.\n\nAs Tulkinghorn digs deeper into Lady Dedlock&amp;#039;s past, he unearths a secret that will change their lives forever, and which is almost as astounding as the final outcome of the Jarndyce case. \n\n\nProduced by: John Dryden for BBC Radio Collection \nISBN: 0563557206 \nFirst Broadcast: November 29, 1998 (BBC Radio 4) \nRecorded at: Chiddingstone Castle, Kent \nDramatised by: John Dryden \nDirected by: John Dryden \nMusic: Sacha Puttnam, Nick Russell Pavier \nRunning Time: approx 5 hours \n\nCast:\nMichael Kitchen ........ John Jarndyce\nClaire Price ........... Esther Summerson\nHoneysuckle Weeks ...... Ada Clare\nRobert Portal .......... Richard Carstone\nDaisy Beaumont ......... Lady Honoria Dedlock\nBerwick Kaler .......... Inspector Bucket and Sir Leicester Dedlock\nAnton Lesser ........... Tulkinghorn\nJohn Shrapnel .......... Kenge\nMichael Fenton Stevens . Harold Skimpole\nRob Jarvis ............. Guppy\nDanny Worters .......... Jo\nBrendan O&amp;#039;Hea .......... Woodcourt\nEllie Haddington ....... Miss Barbary and Hortense\nMichael Atwell ......... Krook\nJean Marsh ............. Miss Flite\nGreg Hicks ............. Snagsby\nJonathon Oliver ........ Vholes\nEamon Boland ... ........George\nRoger Frost ............ Smallweed\nwith Charlie Hayes, Tamara King, Suzanne Rainforth,\nDell Synott, Hugh Terry. \n\nThe Novel:\n(From the BBC Radio Collection notes.)\n\n&quot;The fog is very dense indeed.&quot;\n\nBleak House is many things.\n\n It is a court-room saga in which the Jarndyce and Jarndyce case, a contested inheritance, drags through the Courts of Chancery year in, year out, gradually grinding down hipeful suitors, leading them to despair and ruination.\n\nIt is a romance in which the orphan Esther Summerson discovers the secrets of her origins, is torn between two lovers and eventually finds true love.\n\nIt is a whodunnit in which Dickens has surely created, in Inspector Bucket, one of the greatest fictional detectives in literature - a sort of Poirot and Columbo rolled into one.\n\nIt is also a dark, physchological thriller with what has to be one of Dickens&amp;#039; most evil, coldest creations - the lawyer, Tulkinghorn - a cruel and accomplished manipulator of people. Dickens even enters the world of magical realism - when Krook, the rag-and-bottle shop owner, spontaneously combusts, it seems utterly plausible - while other passages are like pure documentary.\n\nShifting effortlessly between styles and genres - and inventing a few along the way - Dickens has produced one of the great novels and it defies and categorisation. Permeated by a fog of confusion between right and wrong, chaos and order, competing story lines feel their way through the murkiness of sexual tension, child abuse, dpeprivation, obsession, exploitation, unjust justice and murder and leads us to a thrilling conclusion where all the strands become one.\n\nThe confusion is mirrored by a real fog, the endless rain and the mud on the streets of London - the characters literally cannot see where they are going. And out of this fog emerges a true, clear vision, Dickens&amp;#039; moral message; that greed invariably leads to self-loathing and self-destruction, whilst those who put others before themselves triumph and survive.\n\nIt is a story about survival.\n\nThe Dramatisation:\n(From the BBC Radio Collection notes.)\n\nIn this full-cast dramatisation of Dickens&amp;#039; masterpiece, we have attempted to capture the essence of Dickens&amp;#039; intention and have gone right back to the original notes he used to write the novel. We have had to cut out many of the characters which appear in the novel to allow other characters to be developed fully and this has necessitated some restructuring of the plot and writing of additional bridging scenes. For this is not a reproduction so much as an interpretation of Bleak House.\n\nAs in the novel, our drama shifts between two perspectives - Esther&amp;#039;s first person experience and interpretation of events and a darker, fly-on-the-wall observer, the roving microphone, which probes beneath the public faces of many of the characters. It is this constant shifting from the involved observer to the cold, dispassionate one which drives the story forward.\n\nFrom its commission to the final studio mix, this dramatisation has been almost a year in the making. We recorded most of the drama at Chiddingstone Castle in Kent and have used a documentary production style throughout with microphones following the action like cameras, and have recorded entirely outside the artificial environment of a studio where radio drama is traditionally made. Though this is a more complex and expensive approach - especially for period drama, where any overhead planes, lawn mowers or passing cars create a real problem - the benefits can be heard in the subtle performances and in the sense of the place.\n\nFor this drama exists in a real place, a world much like our own.\n","torrent":{"xt":"urn:btih:90f9478024ce1ef130080e7aa5c4ffb6bfda57f0","amp;dn":"Bleak+House+-+Charles+Dickens++BBC+4+1999","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90f9478024ce1ef130080e7aa5c4ffb6bfda57f0","infoHashBuffer":{"type":"Buffer","data":[144,249,71,128,36,206,30,241,48,8,14,122,165,196,255,182,191,218,87,240]},"announce":[],"urlList":[]}}