{"title":"Kallentoft &amp; Lutteman - Na imie mi Zack [PL]","uid":12737845,"size":670020362,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:915d574b6b2e3ed9185adea8ae37c5d32b506826&amp;dn=Kallentoft+%26amp%3B+Lutteman+-+Na+imie+mi+Zack+%5BPL%5D+MP3%40112&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":65,"time":1447199744,"description":"Audiobook PL - 63 części /MP3@\r\nrozmiar: 638 / czas: 13:14:47\r\nczyta: Piotr Grabowski\r\n\r\n&quot;... Wszyscy Bohaterowie zrodzili się z Tragedii...&quot;\r\n\r\nW mieszkaniu w Sztokholmie zostają znalezione cztery, brutalnie zamordowane, Azjatki. Piątą - poważnie okaleczoną - ktoś porzuca pod szpitalem. Obrażenia kobiety wskazują, że została zaatakowana przez psy.\r\nDwudziestosiedmioletni Zack robi błyskotliwą karierę w policji. W ciągu dnia jest pełnym pasji nadkomisarzem w Jednostce do Zadań Specjalnych. Jednak w nocy ucieka od rzeczywistości ...ćpając po klubach.\r\nDobrze wie, że długo tak się nie da - ale bolesne wspomnienia z dzieciństwa sprawiają, że wciąż balansuje na skraju przepaści. Po piętach depczą mu śledczy z wydziału spraw wewnętrznych - tymczasem on, wspólnie z koleżanką &quot;po fachu&quot;, próbuje rozwiązać zagadkę najpotworniejszych morderstw we współczesnej historii Szwecji...\r\nCzy mają do czynienia z chorobliwą nienawiścią do kobiet, rasizmem - a może z handlem ludźmi..?\r\nPewne jest jedno - zginą kolejne kobiety, jeżeli nie uda im się odnaleźć mordercy...\r\n\r\n&quot;... Leży w ciemnościach. Kiedy chce wstać, uderza się w głowę. Próbuje usiąść - ale to niemożliwe...\r\nChropowate drewno. Z każdej strony...\r\nTo trumna..? Pogrzebali mnie żywcem?!!\r\nPróbuje poruszać nogami; zauważa, że może nimi swobodnie przebierać.\r\nZawadza o coś udami - wygląda na to, że nogi wystają ze skrzyni...\r\nCo to takiego? Gdzie ja jestem..?\r\nSłychać warczenie...&quot;\r\n\r\nSkandynawski czarny kryminał (czy też, jak kto woli: Noir) przeżywa ostatnimi czasy prawdziwy renesans - w którym równie ciekawym, obserwowanym ostatnio zjawiskiem jest &quot;praca zespołowa&quot; autorów, głównie ze Szwecji. Śladem niezrównanych Sjöwall i Wahlöö niedawno podążył duet Erik Axl Sund - na światowym rynku doceniony zwłaszcza za trylogię &quot;Victoria Bergman&quot; - teraz zaś przyszedł czas na kolejny, świetny duet ze Szwecji...\r\nMons Kallentoft - okrzyknięty już nowym Królem skandynawskiej powieści kryminalnej - urodził się w roku 1968. Dorastał w Linköpingu, a do kariery pisarza dochodził przez pracę w reklamie i dziennikarstwo. Debiutował w roku 2000 powieścią &quot;Pesetas&quot; (za którą otrzymał nagrodę Katapultpriset - przyznawaną przez Związek Pisarzy Szwedzkich), potem napisał jeszcze kilka (bardzo dobrze przyjętych przez krytykę i czytelników) książek obyczajowych. Do tej pory niemal wszystkie jego książki zostały przetłumaczone na ponad dwadzieścia języków i trafiły na listy bestsellerów - między innymi w Wielkiej Brytanii i Francji. Teraz zaprosił do współpracy Marcusa Luttemana - równie &quot;wielce obiecujęcego&quot; pisarsko autora - i wraz z nim zapoczątkował nowy cykl o skandynawskim &quot;Brudnym Harry'm&quot; pt. Herkules - którego pierwszy tom stanowi powieść &quot;Na imię mi Zack&quot;","torrent":{"xt":"urn:btih:915d574b6b2e3ed9185adea8ae37c5d32b506826","amp;dn":"Kallentoft+%26amp%3B+Lutteman+-+Na+imie+mi+Zack+%5BPL%5D+MP3%40112","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"915d574b6b2e3ed9185adea8ae37c5d32b506826","infoHashBuffer":{"type":"Buffer","data":[145,93,87,75,107,46,62,217,24,90,222,168,174,55,197,211,43,80,104,38]},"announce":[],"urlList":[]}}