{"title":"Kristina Sabaliauskaitė - Silva Rerum [PL]","uid":13429812,"size":712874448,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:917ed11be543d58b98fed107c9e0ec1bf128acda&amp;dn=Kristina+Sabaliauskait%C4%97+-+Silva+Rerum+%5BPL%5D+MP3%40128&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":45,"time":1454623411,"description":"Audiobook PL - 39 części /   \r\nrozmiar: 678 MB / czas: 12:19:52\r\nczyta: Wiktoria Gorodeckaja\r\n\r\nWielka opowieść o burzliwych losach szlacheckiej rodziny, siedemnastowiecznym Wilnie - i naszej historii...\r\n\r\nŚmierć tropi rodzinę Narwojszów. Elżbieta i Jan Maciej cudem uciekają z kozackiej masakry. Dopiero ich dzieci, Urszula i Kazimierz, pokonują fatum ciążące nad rodem. Ona trafi do wileńskiego klasztoru, on pod skrzydła niebezpiecznych wolnomyślicieli. Ich rodzinna kronika, silva rerum, opisuje każde wydarzenia, jednocześnie skrywając niejedną tajemnicę. W mrocznych zaułkach Wilna dzieje się bowiem znacznie więcej. Kazimierz niemal traci życie w studenckich bójkach, w klasztornych krużgankach słychać szelest drogiego habitu przeoryszy upokarzającej młodziutką nowicjuszkę, a przez życie rodziny, niczym niszczycielski żywioł przejdzie Jan Kirdej Biront. Charyzmatyczny buntownik, uczestnik nocnych orgii na dworze Radziwiłła, będzie odpowiedzialny za wybuch namiętności w klasztorze. Zakochany w nastoletniej Urszuli jest nieświadom, że sam budzi pożądanie jej brata. \r\nSilva Rerum to opowieść o balansowaniu między śmiercią a życiem, brzydotą a pięknem, ciałem a duszą, odsłaniająca tajemnice wielokulturowego Wilna. Zmysłowy, barokowy styl, bogactwo historycznego szczegółu i wciągająca akcja przyniosły autorce międzynarodową sławę. Wątki mistyczne przeplatają się tu z awanturniczymi, świętość graniczy z pożądliwością, tradycjonaliści spierają się z wolnomyślicielami, a historia pewnej rodziny staje się kluczem do historii całego kraju...\r\n\r\n&quot;...Świetnie napisana, marquezowska powieść, która dzieje się w siedemnastowiecznej Litwie i przypomina mimochodem, że historia Europy Środkowej jest wspólną opowieścią...&quot;\r\n- Olga Tokarczuk\r\n\r\nTo pierwsza wydana w języku polskim odsłona sagi &quot;Silva Rerum&quot;. Na Litwie ukazały się już kolejne tomy - i w oryginale noszą tytuły &quot;Silva Rerum II&quot; i &quot;Silva Rerum III&quot;","torrent":{"xt":"urn:btih:917ed11be543d58b98fed107c9e0ec1bf128acda","amp;dn":"Kristina+Sabaliauskait%C4%97+-+Silva+Rerum+%5BPL%5D+MP3%40128","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"917ed11be543d58b98fed107c9e0ec1bf128acda","infoHashBuffer":{"type":"Buffer","data":[145,126,209,27,229,67,213,139,152,254,209,7,201,224,236,27,241,40,172,218]},"announce":[],"urlList":[]}}