{"title":"Ganga Zumba - Caca Diegues","uid":4885818,"size":772053294,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:919e8c1d449f666a46e1bcd28bcb092c5389a8ed&amp;dn=Ganga+Zumba+-+Caca+Diegues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rpessoa","files":1,"time":1241721856,"description":"GANGA ZUMBA\nDirected by Carlos Diegues; adapted by Leopoldo Serran, Rubem Rocha Filho and Mr. Diegues from the novel by Joao Felicio dos Santos; photographed by Fernando Duarte; music by Moacyr Santos; produced by Mr. Diegues and Jarbas Barbosa&quot;\n\n\nQuote:\n\nThe Brazilian film 'Ganga Zumba' was made in 1963 but was not released until 1972 because there was a military coup in Brazil in 1964, and films about revolutions, even those taking place in the 17th century, were considered politically dangerous.\nThe film is based on Joao Felicio dos Santos' novel, and focuses on a black slave who ends up in Palmares. \n\n\n\n\nQuote:\n\nGanga Zumba was Diegues's first feature. A reconstruction of the Palmares Republic of runaway slaves in Brazil during the seventeenth century, it corresponded to the search for identity in which many Brazilian artists were then engaged. It also represented the first Cinema Novo film to value Afro-Brazilian culture, as well as the beginning of Diegues's interest in bringing black history to the screen: &quot;I tried to make a black film, not a film about blacks,&quot; he stated. \n\n\n\n\nQuote:\n\nGanga Zumba (1963)\nJanuary 21, 1972\nBrazilian Slaves Flee in 'Ganga Zumba'\nHOWARD THOMPSON.\nPublished: January 21, 1972, New York Times\n\nIn &quot;Ganga Zumba,&quot; Carlos Diegues, the young Brazilian director, uses a small band of non-professional blacks and whites in a jungle to depict a bloody chapter in his country's history. The story is the flight of sugarcane plantation slaves to an island inhabited by earlier fugitives. The time is 1641.\n\nWhile the picture moves like molasses and the performances amount to crude, self-conscious pantomime, this Engish-subtitled movie, burning with sincerity, is curiously admirable, even haunting. And it does indeed suggest a larger human drama throbbing off-screen in the background.\n\nThe players behave with a natural dignity. In their midst is a black youth named Antonio Pitanga, whose strong face conveys volumes. Add to this artlessness the simple eloquence of the dialogue, vivifying the cruelty, horror and despair of slavery.\n\nFinally, Mr. Diegues's dramatic microcosm is rooted with utter authenticity in the primeval landscape of a background that has been photographed with bleak austerity. You can smell Brazil. Above all, you can feel the people we see here and feel for them. \n\n\n\nCast:\n\nAntonio Pitanga ...  Ganga Zumba (as Antonio L. Sampaio) \nLÃƒÂ©a Garcia ...  Cipriana \nEliezer Gomes ...  Anoroba \nLuiza MaranhÃƒÂ£o ...  Dandara \n","torrent":{"xt":"urn:btih:919e8c1d449f666a46e1bcd28bcb092c5389a8ed","amp;dn":"Ganga+Zumba+-+Caca+Diegues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"919e8c1d449f666a46e1bcd28bcb092c5389a8ed","infoHashBuffer":{"type":"Buffer","data":[145,158,140,29,68,159,102,106,70,225,188,210,139,203,9,44,83,137,168,237]},"announce":[],"urlList":[]}}