{"title":"Buddy Guy - 2008 - Skin Deep FLAC","uid":8934709,"size":405782939,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:91d465dba182a783156585d53700571e7168f76a&amp;dn=Buddy+Guy+-+2008+-+Skin+Deep+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1379536682,"description":"Buddy Guy - 2008 - Skin Deep\n\nIt's hard to say that Buddy Guy's career was revived by his appearance in the Rolling Stones' Shine a Light, but his mesmerizing duet on Muddy Waters' &quot;Champagne and Reefer&quot; in that Martin Scorsese concert film was a bracing, welcome reminder of just how good Guy is, especially for listeners who may have let their attention wander in the years since Damn Right, I've Got the Blues. What made Guy so riveting was his coiled aggression: in stark contrast to the deferential Jack White, he came to cut the Stones down and he did so mercilessly, which made it the musical highlight of a show with plenty of great moments. That wildness has kept Buddy Guy unpredictable well into his senior citizenship, and it surfaces on Skin Deep, only perhaps not quite as often as it should. Touted as his first album of original material, Skin Deep does work as an effective showcase for Buddy's most original voice: his wild, gnarly guitar. The production may be crisp and clean but Buddy refuses to play polite, messing up the pristine surfaces with big, nasty, ugly smears of guitar. Even when the record gleams too brightly -- as it does just a little bit too often -- Guy sounds like he's trying to tear things apart from the inside, which lends vigor and energy to numbers that are performed with just a shade too much preciseness. Thankfully, not all of Skin Deep is so clean, as the record opens up with a pair of dynamite collaborations with Robert Randolph -- the stripped-down, swampy Delta blues &quot;Out in the Woods&quot; and the muscular &quot;That's My Home.&quot; Guy also gets in a couple of good numbers with Susan Tedeschi and Derek Trucks -- there's also a duet with Eric Clapton on &quot;Every Time I Sing the Blues,&quot; which slides into a too-comfortable slow groove -- and these are the moments when Skin Deep really clicks, as the songs spark and the band truly cooks. Elsewhere, the music slips toward the conventional, but at least it sounds like Guy is trying to reel it back in with that monstrous guitar, which can still sound wondrous. It's kind of fun to hear the accidental tension between Guy's guitar and the slick surfaces, but when he's paired with a band or production that matches his grit, Skin Deep is so good that it's hard not to wish the whole record sounded just like that. (AllMusic)\n\nTrack list:\n01 - Best Damn Fool\n02 - Too Many Tears (Featuring Derek Trucks &amp; Susan Tedeschi)\n03 - Lyin' Like A Dog\n04 - Show Me The Money\n05 - Every Time I Sing The Blues (Featuring Eric Clapton)\n06 - Out In The Woods (Featuring Robert Randolph)\n07 - Hammer And A Nail\n08 - That's My Home (Featuring Robert Randolph)\n09 - Skin Deep (Featuring Derek Trucks)\n10 - Who's Gonna Fill Those Shoes\n11 - Smell The Funk\n12 - I Found Happiness\n\nPersonnel:\nBuddy Guy - guitar, sitar, vocals\nMarc Franklin - trumpet\nDavid Grissom - guitar\nTom Hambridge - drums, handclaps, tambourine, percussion, vocals, backing vocals\nRichie Hayward - drums\nRob McNelly - guitar\nQuinn Sullivan - guitar\nWillie Weeks - bass\nNathan Williams - accordion\nReese Wynans - keyboards\nLannie McMillan - tenor sax\nKirk Smothers - tenor sax\nBekka Bramlett, Bonnie Bramlett &amp; Wendy Moten - backing vocals\n\nGuest Musicians\nEric Clapton - guitar, vocals\nRobert Randolph - steel guitar, pedal steel\nSusan Tedeschi - vocals\nDerek Trucks - slide guitar, guitar\n\nSplit with Medieval.\nEnjoy and share! ","torrent":{"xt":"urn:btih:91d465dba182a783156585d53700571e7168f76a","amp;dn":"Buddy+Guy+-+2008+-+Skin+Deep+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91d465dba182a783156585d53700571e7168f76a","infoHashBuffer":{"type":"Buffer","data":[145,212,101,219,161,130,167,131,21,101,133,213,55,0,87,30,113,104,247,106]},"announce":[],"urlList":[]}}