{"title":"Howard Marks - Mr Nice and A Video Diary","uid":4979511,"size":1464978877,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:92873c33e6e77bc337680cc719ad86854bf80d3c&amp;dn=Howard+Marks+-+Mr+Nice+and+A+Video+Diary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MartinBLCK","files":4,"time":1246205748,"description":"Howard Marks - A Video Diary\n----------------------------\n\nHoward Marks is famed for being the man resposible for importing most of the marijuana sold in the UK during the 70's and 80's. His exploits are the stuff of folk legend and on this video he reveals yet more previously untold tales of his scams and exploits. As we journey with Howard from Jamaica to Switzerland, from Edinburgh to Amsterdam and various other places in between, it is obvious why he has been described as someone ''who makes Peter Pan look like a geriatric with sleeping sickness'' and how he has made the unusual transformation from being the UK's most wanted man to the worlds most popular drug smuggler. As you would expect from Howard Marks, this is the video that does not shy away from telling the true facts about cannabis and provides an informative and fascinating guide to Ganja and Hashish.\n\n\nHoward Marks - Mr Nice Live\n---------------------------\n\nRecorded during the 'Mr Nice Live' tour of 2002. Howard Marks talks about his life as a smuggler, subsequent imprisonment, and the issue of marijuana prohibition.\n\nHoward Marks built a world-wide smuggling network that allegedly became responsible for the majority of marijuana smoked in the western world throughout the 1970's and most of the 1980's. Once an agent for MI6 (Her Majesty's Secret Service), and the orchestrator of major cannabis deals direct with members of the American CIA, Howard had 43 aliases and over 25 companies world-wide as cover for his truly international smuggling empire. His motivation became the legalisation of cannabis / marijuana, and a determined will to beat the system.\n\nHis autobiography 'Mr Nice' published in 1996 has now sold over 620,000 copies in the UK alone, and still (six years later) remains an international best seller. Mr Nice has been translated into German, Hebrew, Spanish, Italian &amp; French.\n\n\n-----------------------------------------------\nMore stuff here: &lt;a href=&quot;\nhttp://thepiratebay.se/tag/drug+documentaries&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tag/drug+documentaries&lt;/a&gt;                        &lt;a href=&quot;\nhttp://thepiratebay.se/user/MartinBLCK/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/MartinBLCK/&lt;/a&gt;\n\t\t\n","torrent":{"xt":"urn:btih:92873c33e6e77bc337680cc719ad86854bf80d3c","amp;dn":"Howard+Marks+-+Mr+Nice+and+A+Video+Diary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92873c33e6e77bc337680cc719ad86854bf80d3c","infoHashBuffer":{"type":"Buffer","data":[146,135,60,51,230,231,123,195,55,104,12,199,25,173,134,133,75,248,13,60]},"announce":[],"urlList":[]}}