{"title":"American Torture: From the Cold War to Abu Ghraib and Beyond","uid":8642616,"size":2761426,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9290a3015806cf1c51cf427c7771a51255c3603a&amp;dn=American+Torture%3A+From+the+Cold+War+to+Abu+Ghraib+and+Beyond&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1372906030,"description":"Publication Date: March 20, 2007 | ISBN-10: 0745326706 | ISBN-13: 978-0745326702 | Edition: First Edition\n\nGeorge W. Bush calls them an &quot;alternative set of procedures&quot;: forcing victims to stand for forty hours; depriving them of sleep for weeks on end; and strapping prisoners to inclined boards, then flooding their mouths with water. These techniques are torture, and they are legal in the United States.\n\nMichael Otterman reveals the long history of U.S. torture. He shows how these procedures became standard practice in today's war on terror. Initially, the CIA based their techniques on the tactics of their enemies, the Nazis, Soviets, and Chinese. Billions of dollars were spent studying, refining, then teaching these techniques to interrogators charged with keeping communism at bay. They produced procedure manuals that were used in Vietnam, Latin America, and elsewhere. As the Cold War ended, these tortures---engineered to leave deep psychological wounds but few physical scars---were legalized using the very laws that were designed to eradicate their use. After 9/11, they were revived again for use on enemy combatants detained in America's vast gulag of prisoners across the globe---from secret CIA black sites in Thailand to the detention center at Guantanamo Bay, Cuba.\n\nMichael Otterman shows that these interrogation methods violate more than international law and fundamental human rights. They radicalize enemies, undermine credibility, and yield unreliable intelligence. They do not make us more safe. They make us less safe.\n\nReview\nAmerican Torture is a hard-hitting survey revealing how torture became a standard practice in the War on Terror, how it was honed and legalised and how the military and CIA had used torture before both at home and abroad. These tortures were legalized using the laws designed to eradicate their use as the Cold War ended.. -- Internet Bookwatch American Torture is an easy book to read insofar as it is well-written and well-organized. ... Frankly, I'd rather deal with the permanent damage inflicted by American Torture on my psyche than live in benighted ignorance of the damage our nation wreaks on human beings in captivity every day. -- Pensito Review\nAbout the Author\nMichael Otterman is an award-winning freelance journalist and documentary filmmaker. He was a recent visiting scholar at the Centre for Peace and Conflict Studies at the University of Sydney. He has covered crime and culture for an array of publications, including Boston's Weekly Dig. He lives in New York.\n\nPaperback: 296 pages\nPublisher: Pluto Press; First Edition edition (March 20, 2007)\nLanguage: English\nISBN-10: 0745326706\nISBN-13: 978-0745326702\n\n &lt;a href=&quot;\nhttp://www.amazon.com/American-Torture-From-Ghraib-Beyond/dp/0745326706/ref=sr_1_cc_1?s=aps&amp;ie=UTF8&amp;qid=1372898581&amp;sr=1-1-catcorr&amp;keywords=American+Torture%3A+From+the+Cold+War+to+Abu+Ghraib+and+Beyond&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/American-Torture-From-Ghraib-Beyond/dp/0745326706/ref=sr_1_cc_1?s=aps&amp;ie=UTF8&amp;qid=1372898581&amp;sr=1-1-catcorr&amp;keywords=American+Torture%3A+From+the+Cold+War+to+Abu+Ghraib+and+Beyond&lt;/a&gt;","torrent":{"xt":"urn:btih:9290a3015806cf1c51cf427c7771a51255c3603a","amp;dn":"American+Torture%3A+From+the+Cold+War+to+Abu+Ghraib+and+Beyond","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9290a3015806cf1c51cf427c7771a51255c3603a","infoHashBuffer":{"type":"Buffer","data":[146,144,163,1,88,6,207,28,81,207,66,124,119,113,165,18,85,195,96,58]},"announce":[],"urlList":[]}}