{"title":"The True Story of the Triple Nickles, America's First Black Para","uid":9766200,"size":20362774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92b402b594d5bf41374013cfcf83d86714bc14d6&amp;dn=The+True+Story+of+the+Triple+Nickles%2C+America%27s+First+Black+Para&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1394881590,"description":"\n\nTanya Lee Stone, &quot;Courage Has No Color: The True Story of the Triple Nickles, America's First Black Paratroopers&quot;\n ISBN: 0763651176, 0763665487 | 2013 | EPUB | 160 pages | 19 MB\n\n They became America's first black paratroopers. Why was their story never told? Sibert Medalist Tanya Lee Stone reveals the history of the Triple Nickles during World War II. World War II is raging, and thousands of American soldiers are fighting overseas against the injustices brought on by Hitler. Back on the home front, the injustice of discrimination against African Americans plays out as much on Main Street as in the military. Enlisted black men are segregated from white soldiers and regularly relegated to service duties. At Fort Benning, Georgia, First Sergeant Walter Morris's men serve as guards at The Parachute School, while the white soldiers prepare to be paratroopers. Morris knows that for his men to be treated like soldiers, they have to train and act like them, but would the military elite and politicians recognize the potential of these men as well as their passion for serving their country?\n\n Tanya Lee Stone examines the role of African Americans in the military through the history of the Triple Nickles, America's first black paratroopers, who fought in a little-known attack on the American West by the Japanese. The 555th Parachute Infantry Battalion, in the words of Morris, &quot;proved that the color of a man had nothing to do with his ability.&quot;\n\n","torrent":{"xt":"urn:btih:92b402b594d5bf41374013cfcf83d86714bc14d6","amp;dn":"The+True+Story+of+the+Triple+Nickles%2C+America%27s+First+Black+Para","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92b402b594d5bf41374013cfcf83d86714bc14d6","infoHashBuffer":{"type":"Buffer","data":[146,180,2,181,148,213,191,65,55,64,19,207,207,131,216,103,20,188,20,214]},"announce":[],"urlList":[]}}