{"title":"Humble Weekly Sale - Spiderweb Software","uid":8720438,"size":581307586,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:92e02ac43b83b1d4e9017969c9faa00b3b09f452&amp;dn=Humble+Weekly+Sale+-+Spiderweb+Software&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"IAmsoICan","files":9,"time":1374413224,"description":"\nFifteen epic RPGs plus bonus content. The Humble Weekly Sale features a new deal every Thursday. Be sure to jump on this amazing offer before it's gone! This week, pay what you want for the Geneforge Saga, Avadon: The Black Fortress, Avernum: The Great Trials Trilogy, Avernum: First Trilogy, plus Spiderweb Software game art and hint books. If you pay more than the average, you'll also receive Avernum: Escape from the Pit and Nethergate: Resurrection!\n\nAvernum: Escape from the Pit\n\nIt's not the destination, but the journey that matters in Avernum: Escape from the Pit, an old-school RPG reminiscent of those from the 90's with a focus on narrative and open exploration. Avernum is a huge subterranean prison, the final destination of misfits, rebels, and petty criminals. Like you. Take control of a band of four intrepid adventurers who have been banished to Avernum. Explore the infinite caves and dungeons of Avernum, hunt for hidden treasures, engage in turn-based combat, and fight for survival, escape, and maybe even revenge.\n\nNethergate: Resurrection\n\nNethergate: Resurrection is a fantasy RPG revamp of the classic 1999 Nethergate. Choose your side in ancient Britannia, a land devastated by war. Will you rebel to claim your land as a Celt or will you crush the insurgency as a Roman? Unearth secrets, magical spells, and hidden artifacts of Shadowvale as you embark on a bewitching quest.\n\nThe Geneforge Saga\n\nThe Geneforge Saga contains 5 RPGs with a sci-fi twist: Geneforge 1, Geneforge 2, Geneforge 3, Geneforge 4: Rebellion, and Geneforge 5: Overthrow. As one of the lucky ones, you are thrust into the world of Shapers, who have the ability to create and control life to their liking. As an apprentice, you'll be forced to confront the ethics of being a Shaper and make tough decisions as you determine whether to stay loyal to your kind or turn against them to protect the common people in an open storyline spanning 5 engrossing adventures.\n\nAvadon: The Black Fortress\n\nThe first game in the epic fantasy saga, Avadon: The Black Fortress places you in the sprawling land of Lynaeus. As a Hand of Avadon, it is your duty to protect the Pact, an alliance of five nations, and uncover any conspiracies against it. With four character classes and a copious amount of different endings, Avadon: The Black Fortress has immense replay value.\n\nThe First Avernum Trilogy\n\nBanished by the Empire to the depths of Avernum, you must fight your way to the surface in this retro RPG. Avernum: First Trilogy includes Avernum, Avernum 2, Avernum 3, and Blades of Avernum. Through expertly written dialogue and numerous quests, you'll unveil just the beginning of a captivating and immersive plot line in the first trilogy of Avernum.\n\nAvernum: The Great Trials Trilogy\n\nAvernum: The Great Trials Trilogy includes Avernum 4, Avernum 5, and Avernum 6. Long after the events in the first trilogy, Avernum is embroiled in disaster and it is up to you to track down an assassin and save your homeland. The fate of Avernum rests in your hands, so what will become of it?\n\nSpiderweb Game Art and Hint Books\n\nMake your desktop absolutely epic with breathtaking Spiderweb game art!\n\nFor every adventurer, these Spiderweb Hint Books offer the ultimate roadmap to success. Loaded with walkthroughs, cheats, maps, and much more, the hint books are perfect for conquering each Spiderweb Software game or for getting yourself out of a difficult situation.\n\nInstallation\n\nInstall and play","torrent":{"xt":"urn:btih:92e02ac43b83b1d4e9017969c9faa00b3b09f452","amp;dn":"Humble+Weekly+Sale+-+Spiderweb+Software","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92e02ac43b83b1d4e9017969c9faa00b3b09f452","infoHashBuffer":{"type":"Buffer","data":[146,224,42,196,59,131,177,212,233,1,121,105,201,250,160,11,59,9,244,82]},"announce":[],"urlList":[]}}