{"title":"Cinematic Titanic Collection","uid":4413753,"size":2932857753,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:93fcdfa778b3fe00131db8bbb0fc2081a9ce86a6&amp;dn=Cinematic+Titanic+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"-Marcus-","files":3,"time":1222400921,"description":"From the crew that brought you Mystery Science Theater 3000 and Rifftarx (yes, there is some overlap, so don&amp;#039;t throw a hissy-fit), comes Cinematic Titanic. The movies are really funny, and the riffing is even funnier. They dont have a way to donate, but they say that in the future, they will be releasing movies in the form of torrents, for free, so whatev.\n\nEnjoy!\n\n----------------------------------------------------------------------------\n\nOozing Skull\n\nIn the far-off land of Khalid, President Amir lies on his deathbed. If this revered head-of-state dies, the brutal dictatorship that he has so lovingly cultivated will fall into a dark age of uncertainty and chaos. So, in this moment of crisis, his loyal staff are left with no alternative but to choose the only logical and sensible course of action - to transfer Amir&amp;#039;s brain into a younger, healthier, and most importantly, living body.\n\nEnter Doctor Robert Trenton, a mad scientist of the &quot;they all laughed at me and now I&amp;#039;ll show them&quot; school. He, along with his assistant, Dorro, a little man with a big appetite for evil, and Tracy, a conniving beauty with a heart that&amp;#039;s harder than her leathery, over-tanned skin, concoct a deliriously diabolical plan involving murder, body-napping, skullduggery, and oozy, gooey brains.\n\nAfraid to watch this movie alone, aren&amp;#039;t you? Well, now you don&amp;#039;t have to, and neither will future generations, because The Oozing Skull has the almost historic distinction of being the first movie chosen for Cinematic Titanic&amp;#039;s Time Tube. Tom Shales, TV critic for the Washington Post, called the episode &quot;consistently and unfailingly funny.&quot; \n\n\nDoomsday Machine\n\nAmerican spies discover the Chinese have built a weapon capable of destroying planet Earth, a &quot;doomsday machine&quot; if you will, and that they plan to use it within a matter of days. Immediately, Project Astra, a manned U.S. space mission to Venus, is taken over by the military and half of its all-male crew is replaced by women just hours before launch. The reason for this becomes apparent when, shortly after Astra leaves Earth&amp;#039;s orbit, said planet is completely destroyed (in a cataclysm of stock footage). \n\n\n\nThe Wasp Woman\n\nJanice Starlin, purveyor of her own line of cosmetics, finds herself nearing middle-age (in a time when 38 was the new 94). A stranger with an accent and an unnatural love of wasps enters her life and promises her the elixer that will prolong her youth forever - until the wasp becomes the wasped. \n\nThis version of THE WASP WOMAN has been altered by CINEMA TITAN, L.L.C. The alteration and distribution of this version of THE WASP WOMAN has not been authorized, sponsored by or endorsed by the original proprietors and creators of THE WASP WOMAN. CINEMA TITAN L.L.C. on behalf of itself and its licensees expressly denies and disclaims any affiliation or association of this altered version of the motion picture with the original proprietors and creators or THE WASP WOMAN. \n","torrent":{"xt":"urn:btih:93fcdfa778b3fe00131db8bbb0fc2081a9ce86a6","amp;dn":"Cinematic+Titanic+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93fcdfa778b3fe00131db8bbb0fc2081a9ce86a6","infoHashBuffer":{"type":"Buffer","data":[147,252,223,167,120,179,254,0,19,29,184,187,176,252,32,129,169,206,134,166]},"announce":[],"urlList":[]}}