{"title":"Rainer Forst - Toleration in Conflict Past and Present [2013][A]","uid":10412081,"size":5424381,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:941fc4b844b98499eb23e975505c5089b26d33e4&amp;dn=Rainer+Forst+-+Toleration+in+Conflict+Past+and+Present+%5B2013%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1403552926,"description":"Description\nProduct Details\nBook Title: Toleration in Conflict: Past and Present (Ideas in Context)\t\nBook Author: Rainer Forst\nSeries: Ideas in Context (Book 103)\nHardcover: 662 pages\nPublisher: Cambridge University Press (February 25, 2013)\nLanguage: English\nISBN-10: 0521885779\nISBN-13: 978-0521885775\n\n===================================================================================\nBook Description\nPublication Date: February 25, 2013 | ISBN-10: 0521885779 | ISBN-13: 978-0521885775\nThe concept of toleration plays a central role in pluralistic societies. It designates a stance which permits conflicts over beliefs and practices to persist while at the same time defusing them, because it is based on reasons for coexistence in conflict - that is, in continuing dissension. A critical examination of the concept makes clear, however, that its content and evaluation are profoundly contested matters and thus that the concept itself stands in conflict. For some, toleration was and is an expression of mutual respect in spite of far-reaching differences, for others, a condescending, potentially repressive attitude and practice. Rainer Forst analyses these conflicts by reconstructing the philosophical and political discourse of toleration since antiquity. He demonstrates the diversity of the justifications and practices of toleration from the Stoics and early Christians to the present day and develops a systematic theory which he tests in discussions of contemporary conflicts over toleration.\n\n===================================================================================\nReview\n&quot;...Toleration in Conflict is simply the most impressive philosophical work specifically on toleration.... It is an immensely long and thorough work, and it is hard to resist a smile when reading in the Preface.... a book that nobody interested in the theory of toleration can properly ignore...&quot;\n--John Horton, Keele University, Notre Dame Philosophical Reviews\n\n===================================================================================\nBook Description II\nToleration is an indispensable yet ambivalent concept in pluralistic societies. Is it based on mutual respect or on condescension? Why is it right to tolerate what is wrong? This book is the most comprehensive existing study of debates over toleration since antiquity and develops a theory for our time.\n\n===================================================================================\nAbout the Author\nRainer Forst is Professor of Political Theory and Philosophy at the Goethe University in Frankfurt am Main, Germany. In addition, he is Co-Director of the interdisciplinary Research Cluster 'Formation of Normative Orders' and a Permanent Fellow at the Institute for Advanced Studies in the Humanities at the Goethe University. He has also taught at the Free University in Berlin, the New School for Social Research in New York and Dartmouth College and has been offered a full professorship at the University of Chicago and a visiting professorship at Harvard University; he has also been invited to join the Institute for Advanced Studies in Berlin as a Fellow. In 2012, he received the Gottfried Wilhelm Leibniz Prize, the highest honour awarded German researchers.\n===================================================================================","torrent":{"xt":"urn:btih:941fc4b844b98499eb23e975505c5089b26d33e4","amp;dn":"Rainer+Forst+-+Toleration+in+Conflict+Past+and+Present+%5B2013%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"941fc4b844b98499eb23e975505c5089b26d33e4","infoHashBuffer":{"type":"Buffer","data":[148,31,196,184,68,185,132,153,235,35,233,117,80,92,80,137,178,109,51,228]},"announce":[],"urlList":[]}}