{"title":"Hegemony Rome Rise of Caesar v2.1.0.rev32736 Cracked-3DM","uid":11161138,"size":1690576509,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:947607d401992b7489078487ef67fbefbfaa1f9a&amp;dn=Hegemony+Rome+Rise+of+Caesar+v2.1.0.rev32736+Cracked-3DM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1412542402,"description":"Hegemony Rome Rise of Caesar v2.1.0.rev32736 Cracked-3DM\n\nExtract 7zip &amp; play!\n\n\nNew DLC and update 2.1.0 v.32736 | 2014-10-02\nHello everyone,\n\nwe just published a new update which brings a lot of AI improvements as well as a completely new game mechanic for you make usw of:\n\nVersion 2.1 adds an all new mercenary mechanic that lets you hire fully trained veteran units using the new Mercenary Post upgrade. Mercenaries don't need recruits, but they are expensive and don't replaces losses after combat so you'll need to manage them wisely.\n\nFor now, available mercenaries include the standard skirmishers, spearmen, cavalry, etc. plus special units from the campaign like the Cretan Archers or Baelaric Slingers.\n\nAlso, if you take a look at the store page of Hegemony Rome: The Rise of Caesar and you will notice a new DLC which adds additional and even stronger mercenaries to Hegemony Rome!\n\nLast but not least, here's the official changelog:\n\n    New 'Mercenary Post' upgrade for cities\n    New 'Hire Mercenaries' button in the city command panel\n    Disband/Raze button has been moved from the top-right to the centre\n    Units can now be disbanded in the field\n    New warning button before units are disbanded\n    Units will no longer get recruits if their home city doesn't have the upgrades to support them\n    Fixed issue with rebellion speed when city or fort is under attack\n    Improved filtering of data in the graphs window (may lead to a one-time 1-2 min freeze after loading really long games e.g. 1000+ mins)\n    Fixed AI seeding crash\n    Fixed problems disabling DLC from the in-game menu\n    Fixed script crash during the defeated unit tutorial\n    Adjustments to strategic level sandbox AI (work-in-progress)","torrent":{"xt":"urn:btih:947607d401992b7489078487ef67fbefbfaa1f9a","amp;dn":"Hegemony+Rome+Rise+of+Caesar+v2.1.0.rev32736+Cracked-3DM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"947607d401992b7489078487ef67fbefbfaa1f9a","infoHashBuffer":{"type":"Buffer","data":[148,118,7,212,1,153,43,116,137,7,132,135,239,103,251,239,191,170,31,154]},"announce":[],"urlList":[]}}