{"title":"Shaun White Skateboarding-SKIDROW","uid":6616369,"size":6474085168,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:95037dc7ee2d95117a65306e7a0e747ce707adff&amp;dn=Shaun+White+Skateboarding-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soupucia","files":-1,"time":1313802965,"description":"S  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nShaun White Skateboarding (c) Ubisoft\n\n19-08-2011........Release Date &lt;-&gt; Protection.........Ubisoft DRM\nSkateboarding........Game Type &lt;-&gt; Disk(s)..................1 DVD\n\nRELEASE NOTES\n\nShaun White Skateboarding, a game that puts an innovative twist on the\naction-sports genre, is the latest offering in the award-winning\nfranchise developed in collaboration with dual-sport super-athlete,\nShaun White. The most ambitious instalment yet, Shaun White\nSkateboarding brings all the sensations of skateboarding to a wide\naudience making skate dreams possible and allowing players to transform\na dull, lifeless city into their own extraordinary skating utopia.\n\nAs players skate, they add colour, life and brilliance to the city by\nextending handrails into endless grinds, carving alleys into half\npipes, morphing streets into ramps and much more. Players can skate\ntheir way, any way they want, to create their own customized skating\nworld that can also be shared with friends. Shaun White Skateboarding\nempowers skaters to push the limits of what's possible.\n\nFeatures:\n\nTransform - Create incredible skate lines using city structures,\nstretch and twist handrails to dizzying heights, empty fountains to\ncreate bowls, make alleys into epic quarter pipes and so much more.\nNew areas are revealed, better skate lines are created and buildings\nare transformed. Creativity is rewarded with points, gear and new\nskating opportunities\n\nInnovate - With 80+ skate tricks hand-picked by Shaun (including a\nShaun creation called the &quot;Armadillo&quot;), enjoy a unique and fun\ngameplay experience where you can shape, influence and transform the\ncity while pulling off authentic skate moves. Experience all the\nsensations of an expert skater - the big air, sticking a landing,\neating it and more!\n\nExplore - Find or create skate spots you've only dreamed about. The\ncity is stretched over massive districts with tons of challenges to\ncomplete, including race, collect, narrative missions and more\n\nEngage - Jump online to challenge your friends in co-operative or\nadversarial modes: online or local split-screen. Create your own maps,\nplay with friends and see how you rank against players from across the\nworld using online leaderboards\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder to the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy!\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix + irokos\ntitan artdivision","torrent":{"xt":"urn:btih:95037dc7ee2d95117a65306e7a0e747ce707adff","amp;dn":"Shaun+White+Skateboarding-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95037dc7ee2d95117a65306e7a0e747ce707adff","infoHashBuffer":{"type":"Buffer","data":[149,3,125,199,238,45,149,17,122,101,48,110,122,14,116,124,231,7,173,255]},"announce":[],"urlList":[]}}