{"title":"The Auteurs - After Murder Park [1996]","uid":9452084,"size":284417464,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:967aeab2fb025a200d53a5f79fe17fde743404eb&amp;dn=The+Auteurs+-+After+Murder+Park+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389199342,"description":"The pairing of two curmudgeons like Luke Haines and Steve Albini in a studio seems like a marriage made in heaven to some, and the very thought triggers an instant headache to others. The Auteurs are unlike the typical downtrodden U.S. indie bands Albini works with, but they nonetheless walked out of Abbey Road Studios with their nastiest-sounding record. That's probably what Haines wanted, and that's what he got. Grittier guitars and sharper drums don't get in the way of the more intricate arrangements that involve strings and a dash of horn every now and then. First single &quot;Light Aircraft on Fire&quot; is probably the most feisty Haines song yet, kicking down the doors with the opening line, &quot;When you cut your lover's slack, you'll get a f*cking monster back.&quot; Haines' guitar lines sparkle during the chorus but dig like claws during the verses. Ace utility man James Banbury, in his usual Auteurs role as secret weapon, contributes threatening organ swells during the seething &quot;New Brat in Town.&quot; After Murder Park serves the usual combo platter of growlers and barbed lullabies, but Haines definitely sounds more embittered than usual, quite possibly the result of watching too many of Albini's wildlife videos. He paints plenty of &quot;sucks to be you&quot; scenarios with sneering flair, exposing the corrupted side of humanity just as well as his engineer when he's on the other side of the glass. Not many fates could be worse than having Haines write a song with you as the subject, but listening to him air his insightful dirty laundry is an entirely unique experience. Pretentious and snotty as Haines might be, he's one of the sharpest tools in the shed. (4/5)","torrent":{"xt":"urn:btih:967aeab2fb025a200d53a5f79fe17fde743404eb","amp;dn":"The+Auteurs+-+After+Murder+Park+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"967aeab2fb025a200d53a5f79fe17fde743404eb","infoHashBuffer":{"type":"Buffer","data":[150,122,234,178,251,2,90,32,13,83,165,247,159,225,127,222,116,52,4,235]},"announce":[],"urlList":[]}}