{"title":"Men At Work - Overkill","uid":4825145,"size":133173252,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:96957857ba557f8258f1eeba6c2e0af38ed7274d&amp;dn=Men+At+Work+-+Overkill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1238918958,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Overkill&quot; is a song by Australian band Men at Work and featured on their 1983 album Cargo. It was written by lead singer Colin Hay. The song debuted on the Billboard Hot 100 chart at #28 in April 1983 and peaked at #3 in early June. The song found a second life nineteen years later through its relation to hit sitcom Scrubs. It was featured acoustically in the episode &quot;My Overkill&quot;, along with a cameo of Colin Hay singing it. When it was released, it was a departure from the typical Men At Work's style of reggae pop. &quot;Overkill&quot; instead had hard hitting lyrics and blues and roots feel.\n\nHay's solo acoustic version was included on his 2003 album Man @ Work.\n\nLazlo Bane and Colin Hay have an updated version of this song as well as a video.\n\nThe Benjamin Gate have also released a cover version of the song.\n\nDashboard Confessional has also released a cover version of the song.\n\nMen at Work were an Australian reggae-influenced rock band which achieved international success in the 1980s. They are the only Australian artists to have a #1 album and single simultaneously in the United States (with Business as Usual and &quot;Down Under&quot; respectively). At the same time, they also had a simultaneous #1 single and album in the United Kingdom. The group won the 1983 Grammy Award for Best New Artist and sold over 30 million albums worldwide. The band's sound is distinguished by its use of woodwind and brass instruments.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:96957857ba557f8258f1eeba6c2e0af38ed7274d","amp;dn":"Men+At+Work+-+Overkill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96957857ba557f8258f1eeba6c2e0af38ed7274d","infoHashBuffer":{"type":"Buffer","data":[150,149,120,87,186,85,127,130,88,241,238,186,108,46,10,243,142,215,39,77]},"announce":[],"urlList":[]}}