{"title":"Skeptics vs Creationists - Creation Ministries International","uid":11773236,"size":939174,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96dafb7e596fc82e649f635fa8e4a0cd09a863bb&amp;dn=Skeptics+vs+Creationists+-+Creation+Ministries+International&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427159596,"description":"\nSkeptics vs. Creationists: A Formal Debate - Hosted by the Sydney Morning Herald.\nEver wondered what would happen when leading creationists and skeptics clash head-to-head, both sides putting forward their best arguments and evidences? A major newspaper hosted this formal web debate, with rebuttals and counter-rebuttals, featuring scientists from both Creation Ministries International and the Australian Skeptics. You be the judge!\n\n\nAbout the author:\nCreation Ministries International is a group of non-profit ministries in several countries. Though each is a legally and financially autonomous body, we have formally unified our efforts as a federation of ministries under the banner ?CMI-Worldwide? that helps to ensure unity, harmony, and efficiency of outreach.\n\nOur role is to support the church in proclaiming the truth of the Bible and thus its Gospel message. We provide real-world answers to the most-asked questions in the vital area of creation/evolution, where the Bible is most under attack today?Genesis.\n\nWe are apolitical and non-denominational (as an organisation, not as individuals within it). We try to confine ourselves to matters as defined broadly by our Statement of Faith, and try to not get involved as a ministry in other controversies or issues within Christendom, no matter how important we, as individuals, might regard these","torrent":{"xt":"urn:btih:96dafb7e596fc82e649f635fa8e4a0cd09a863bb","amp;dn":"Skeptics+vs+Creationists+-+Creation+Ministries+International","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96dafb7e596fc82e649f635fa8e4a0cd09a863bb","infoHashBuffer":{"type":"Buffer","data":[150,218,251,126,89,111,200,46,100,159,99,95,168,228,160,205,9,168,99,187]},"announce":[],"urlList":[]}}