{"title":"Requiem 1.7.4 iTunes DRM Remover","uid":4374326,"size":397074,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:971a620676aae184412c7daaa0d766a83d87cb35&amp;dn=Requiem+1.7.4+iTunes+DRM+Remover&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OompahLoompah108","files":1,"time":1220326477,"description":"Go here for Requiem 1.8.6 -&gt; &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4775230&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4775230&lt;/a&gt;\n\n\n- Requiem 1.7.4, released September 1 -\nCompatible with both Windows and Mac!\n\n\nRequiem is an open source program that will strip the DRM from your iTunes music and video files. While people have found other ways around the DRM, such as burning their music and ripping it, that will lose sound quality. That's where this program comes in - it not only removes the DRM from music AND videos, it does so losslessly.\n\nDISCLAIMER: Do not expect Requiem to decrypt video rentals.  This was only intended for purchases, but even if you attempted to, don't expect it to work.\n\n- Changes since last version -\n* handle internationalized Windows installations - This means if your path is in another language (such as German), it will find the Windows path with no problems\n* modify how we get the product ID - This (probably) means a better way of getting the product keys\n\n- Requirements -\n* You must be running iTunes 7.7.1 and be authorized to play the content you want decrypted.\n* As of this date, Quicktime 7.5 works.  If you have a lower version of Quicktime and it doesn't work, update it to version 7.5\n* You'll need to install Java (http://www.java.com/getjava/) if you want to use the the Java GUI that is included that can be used on both Windows and Mac platforms.\n\nJust double click on the Requiem.jar file and the GUI will come up. \n(However, for Mac users, I would recommend the RequiemDroplet.app because it is easier to use because of the Drag &amp; Drop feature.)\n=================================================================================\n\nThree last notes to end on:\n\n1. Do NOT share your de-DRM'd iTunes purchases on a file-sharing network. Why? Apple has personal information in your purchased content.  Requiem does not remove the personal information from your files. Your identity is at stake and Apple could ban your account (at the very least) if caught. (I, OompahLoompah108, have no control of this feature in Requiem, I am just the uploader, not the developer.)\n\n2. I need to thank legodude83089 from Demonoid for initially distributing these files. I'm just putting them up here at TPB because it's more popular and registering is not required for downloading.  You can find the same version here: www. demonoid .com /files/details/1604800/775222/\nAnd of course, I should thank Brahms, the creator of Requiem.\n \n3. Please obey the Golden Rule of File-Sharing, &quot;Share with others, as you would want others to share with you.&quot;  Okay, I made up that quote - but please, share as long as you can, even a week is much appreciated.  Thanks in advance.\n\nCheers! :)","torrent":{"xt":"urn:btih:971a620676aae184412c7daaa0d766a83d87cb35","amp;dn":"Requiem+1.7.4+iTunes+DRM+Remover","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"971a620676aae184412c7daaa0d766a83d87cb35","infoHashBuffer":{"type":"Buffer","data":[151,26,98,6,118,170,225,132,65,44,125,170,160,215,102,168,61,135,203,53]},"announce":[],"urlList":[]}}