{"title":"40 Below Summer - Fire at Zero Gravity (2013) [FLAC]","uid":8533049,"size":512809736,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:97c3b591ff0a744f4e7d84265eab217487d06f43&amp;dn=40+Below+Summer+-+Fire+at+Zero+Gravity+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1370203786,"description":"\n  40 Below Summer - Fire at Zero Gravity (2013) [FLAC]\n \n  Released: 2013\n  Duration: 1:07:06\n  Genre: Pop/Rock\n  Style: Alternative, Heavy Metal, Hard Rock\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Fire At Zero Gravity \n  02 Bottom Feeder \n  03 Coalesce \n  04 Painting The White House Black\n  05 Vela\n  06 Eternal \n  07 My Name Is Vengeance \n  08 Predator \n  09 Daywalker \n  10 Little Miss Happiness \n  11 Our Own December \n  12 Human Gamma Bomb \n  13 Earthquake \n  14 Total Harmonic Destruction \n  15 God Complex\n  16 Firefly (Bonus Track)\n\n  Coming from New Jersey, 40 Below Summer delivers a sole and surpassed aggressiveness on their edgy and heavy rock tunes, at the same time supporting it with an indubitable sense of melody. Adjoining puissant metal-style inflections and other fiery references, Summer follows the path of other new metal squads. Constituting in late 1998 in New Jersey, Summer first formed by the common initiative of drummer Carlos Aguilar, a Peruvian natural, and vocalist Max Illidge, after the two first met while playing in a band called Alien. Illidge had a curious show business background, since he made his first TV appearance at the age of 12 as the little boy in Talking Heads' &quot;Burning Down the House&quot; video clip. Later joining the crew were guitarists Joey d'Amico and Jordan Plingos, along with bassist Hector Graziani. Following the completion of the lineup, Summer began playing regularly, not only in New Jersey, but also in New York. \n\n  It was also at that time that the crew decided on recording its first demo tape, &quot;Sideshow Freaks.&quot; The recording eventually reached No Name Management, a business with heading bands like Slipknot or Fear Factory that, without delay, invited the New Jersey team to sign in. After appearances at several showcases, the band finally settled on signing a deal with the London/Sire Records label. Invitation to the Dance, 40 Below Summer's debut album, hit the record stores in 2001, but their label folded soon after Invitation's release. Undeterred, the band stayed on the road as much as possible and, following an impressive New York gig with E-Town Concrete, signed a new deal with Razor &amp; Tie in summer 2003; The Mourning After followed that fall. Plingos exited the band a year later and was replaced by ex-Motograter guitarist Ty Fury. Aguilar left in spring 2005, and a month after, Fury also departed to form Synthetic Delusion with former members of Motograter. 40 Below Summer soon announced it would be calling it quits, playing its last show together (with its original lineup) in September 2005 at New Jersey's Starland Ballroom. The remaining members went on to form the group Black Market Hero. The band posthumously released the CD/DVD The Last Dance in fall 2006 via Crash Music, and the following June 40 Below Summer's out of print debut EP, Rain, was reissued by Crash Music with an additional seven bonus tracks.","torrent":{"xt":"urn:btih:97c3b591ff0a744f4e7d84265eab217487d06f43","amp;dn":"40+Below+Summer+-+Fire+at+Zero+Gravity+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c3b591ff0a744f4e7d84265eab217487d06f43","infoHashBuffer":{"type":"Buffer","data":[151,195,181,145,255,10,116,79,78,125,132,38,94,171,33,116,135,208,111,67]},"announce":[],"urlList":[]}}