{"title":"MeandSheSquare..pdf","uid":9167666,"size":614254,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97c6b5ccd2ea36cc9b43ffe595c0aa453e5da645&amp;dn=MeandSheSquare..pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"junkboy27","files":-1,"time":1384016580,"description":"A boy working in a BPO gets trapped between love and desires.His life swings to office,love,friendship and career. He can chose only one. \n\nManav is a 25 year old flamboyant guy who works with a BPO. He is selfish and finds himself full of overconfidence. He has a girlfriend but, like most of the young guys, he thinks of being the next Casanova. He has no goals, no dreams and no confines but, all of a sudden, everything changes when a girl named Nikita enters his life through a weird bet -- a bet with his friend Rajesh that changes three lives completely. Fun-filled romance and flirting becomes a matter of life and death. A hurricane of emotions and feelings destroys everything and leaves Manav wondering about the meaning of love, living and liabilities.What happens when Nikita enters the love life of Manav? Why do Rajesh and Manav enter a bet which changes their lives? What was the bet all about? Who does Manav chooseNikita or Sambhavi? Or does he get the chance to choose? What is the end of this love storyor does it end at all? Days, Weeks, Months, Years, Decades and Centuries; nobody knows how old the phenomenon of love truly is. We keep on hearing, watching and feeling different love stories but do we ever get bored? The story which you are about to read is not only a love story but it also has humour, hate, betrayal and self-realization. It gives a lesson in the end as well.\n","torrent":{"xt":"urn:btih:97c6b5ccd2ea36cc9b43ffe595c0aa453e5da645","amp;dn":"MeandSheSquare..pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c6b5ccd2ea36cc9b43ffe595c0aa453e5da645","infoHashBuffer":{"type":"Buffer","data":[151,198,181,204,210,234,54,204,155,67,255,229,149,192,170,69,62,93,166,69]},"announce":[],"urlList":[]}}