{"title":"Mark Cunningham &amp;ndash; Beyond Seduction","uid":11153714,"size":5013593180,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:981e0a1bf7bbed890a20bd9e8e512186f974fae6&amp;dn=Mark+Cunningham+%26ndash%3B+Beyond+Seduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Zincfling","files":11,"time":1412380774,"description":"Who has ever dreamt of taking a lover, a friend, or a casual acquaintance and transforming her into the woman of your dreams? Of doing your own &quot;makeover&quot; until she is the eager, responsive and appreciative babe you've wanted since you figured out what wanting is all about?\n\nHi all,\n\n \n\nAfter having a few days to experience my new reality, I have some realizations of just how powerful Mark's New York Seduction Seminar was.  If you weren't there I have to say, you missed some awesome techniques, tools, discussions, and people.\n\n \n\nOnly now do I really realize what Mark was doing the whole weekend.  He was showing us the way to build the kind of seducer we wanted within ourselves, step by step by step.  So that when completed, like a remolded house we still were the same person but with a new foundation, new structure, and solid attractiveness that draws and keeps a potential buyer interested.  Unlike others who teach to paint the outside, mow the grass, and tell you not to worry about the faulty wiring.\n\n \n\nThe next step always relied on the previous being properly designed and fastened presently into position.  There were times in the seminar where things got really electric and a few times when people were frustrated.  I applaud Mark for being the teacher he is and his dedication to us for making sure everyone had the opportunity to get the most they could at any given moment.  At the end on Sunday, when the dust cleared and the rubble was quietly lying, on the ground there were 40+ changed individuals in the room.\n\n \n\nI had spent a number of years studying words to say and certain ways to act, doing well with persuasion and seduction, but never reaching the level I had envisioned myself at.  I believe there is nothing wrong with that, but it can only get you to a certain level.  This single event however has forever changed who I am and how I view the world.  I now understand, once you change your thoughts.your actions follow and you can elevate to a higher level.  And you can never go back.  Who the hell would want to?  \n\n \n\nSound powerful...you have no idea.  Unless of course, you were one of the few that could make it.  If not and if Mark releases the tapes or if he ever decides to do it again, my advice would be to grab the opportunity to change for yourself.\n\n \n\nOf course, a thanks to Cassi as well for all she does.\n\n \n\nWayne Wilson\n\n ","torrent":{"xt":"urn:btih:981e0a1bf7bbed890a20bd9e8e512186f974fae6","amp;dn":"Mark+Cunningham+%26ndash%3B+Beyond+Seduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"981e0a1bf7bbed890a20bd9e8e512186f974fae6","infoHashBuffer":{"type":"Buffer","data":[152,30,10,27,247,187,237,137,10,32,189,158,142,81,33,134,249,116,250,230]},"announce":[],"urlList":[]}}