{"title":"Abigail [The Wives of King David, #02] -Jill Eileen Smith","uid":14414386,"size":1069721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9856bdd1f99784a814f54c81d9a0787421741832&amp;dn=Abigail+%5BThe+Wives+of+King+David%2C+%2302%5D+-Jill+Eileen+Smith&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1461478802,"description":"What price must she pay for true love?\r\n\r\nHer days marked by turmoil and faded dreams, Abigail has resigned herself to a life with a man she does not love. But when circumstances offer her a second chance at happiness with the handsome David, she takes a leap of faith to join his wandering tribe. Still, her struggles are far from over. How can she share his love with the other women he insists on marrying?\r\n\r\nAbigail follows the bestselling Michal and continues Jill Eileen Smith's rich story of David's wives.\r\n\r\n&quot;With skill honed by years of historical research, made sharper still with a gifted passion for storytelling, Jill Eileen Smith crafts the story of Abigail in a way that takes us deep into the heart of King David and into the heart of a woman determined to follow God's will, no matter the cost to her--or to the man she loves.&quot;--Tamera Alexander, bestselling author of From a Distance and The Inheritance\r\n\r\n&quot;Smith's writing swept me back to ancient days and brought Abigail and David's love story vividly to life.&quot;--Deborah Raney, award-winning author of Almost Forever and the Clayburn Novels\r\n\r\n&quot;A rich tapestry of an era filled with love and longing that rings true across the centuries.&quot;--Siri Mitchell, author of Love's Pursuit\r\n\r\nJill Eileen Smith is the bestselling author of Michal. Her research into the lives of David's wives has taken her from the Bible to Israel, and she particularly enjoys learning how women lived in Old Testament times. Jill lives with her family in Michigan","torrent":{"xt":"urn:btih:9856bdd1f99784a814f54c81d9a0787421741832","amp;dn":"Abigail+%5BThe+Wives+of+King+David%2C+%2302%5D+-Jill+Eileen+Smith","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9856bdd1f99784a814f54c81d9a0787421741832","infoHashBuffer":{"type":"Buffer","data":[152,86,189,209,249,151,132,168,20,245,76,129,217,160,120,116,33,116,24,50]},"announce":[],"urlList":[]}}