{"title":"Huvudjägarna 2011 SWESUB","uid":15356982,"size":1176124455,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:98663f675e559ca3dfab7cd35db8526bd606a27b&amp;dn=Huvudj%26auml%3Bgarna+2011+SWESUB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hoyabella","files":2,"time":1468979821,"description":"\n                         Huvudjägarna 2011 SWESUB\r\n\r\n\r\n\r\n\r\nNorska filmen Huvudjägarna baseras på Jo Nesbøs succéroman. \r\nMed all säkerhet har den redan fått fribiljett till remake i Hollywood, med tanke på pyramidalsuccén i Norge\r\nliksom i Danmark, där den under premiärhelgen mottogs bäst genom tiderna av norska filmer. \r\n\r\n\r\n\r\nDet senare beror dock säkert delvis på att danska storstjärnan \r\nNikolaj Coster-Waldau har en av huvudrollerna som storskurk, visar det sig.\r\nSjälva historien handlar om Roger, framgångsrik headhunter, som dessvärre \r\nhar ett komplex som han själv uttrycker: Han är bara 1.68 lång, och det måste \r\ngivetvis kompenseras. \r\n\r\nFrån denna något gottköpspsykologiska utgångspunkt \r\nnystas en historia upp en alltför mondän fru, \r\nett alltför dyrt hus. Katastrofen, åtminstone ekonomiskt, \r\nborde därmed vara ett faktum, inte minst med tanke på att kompensationen består i konststölder.\r\n \r\nAksel Hennie, som gestaltar Roger, har redan en gedigen karriär bakom sig inom både film och teater, \r\nbland annat med huvudrollen i filmen Max Manus (2008), en av de största nordiska filmsatsningarna genom tiderna. \r\nI rollen som Roger ger han prov på en sårbarhet som väcker betraktarens grundläggande sympati, \r\noch därmed skapar en grund för själva spänningen i berättelsen.\r\n\r\n\r\n\r\nEtt är samtidigt säkert: Huvudjägarna är gastkramande från första stund, \r\noch innehåller långt fler förvecklingar än vad någon kunde föreställa sig under \r\ndrygt en och en halv timme. Den lanseras som actionthriller, och bär syn för sägen. \r\nSamtidigt som den placerar sig mitt i prick i den nordiska deckarvågen handlar det här om andra, \r\nhelt grundläggande värden som tillit och svek.\r\n\r\n\r\nEn dimension som samtidigt lätt kan riskera att gå förlorad i den allmänna spänningen \r\när den samhälls- och samtidskritik som faktiskt finns där, inte minst traderad från \r\nromanförlagan. Här artikuleras en tydlig skepsis mot headhuntern och hela hans extravaganta \r\nlivsstil, som kräver konststölder från egna klienter för att gå ihop.\r\n\r\n\r\nHär ryms också rätt skarp kritik mot hela den retorik som annars ådagaläggs i filmen, \r\ndär renommé till sist blir den enda faktor som gäller, oberoende av om det avser \r\nkonst eller företagande. Moderna tider, moderna seder – det är ytterst kraven från \r\nomvärlden som ingen längre tycks kunna undgå. Men ironins vapen, som Nesbø så skickligt \r\nförstått att utnyttja, består också i filmversionen av berättelsen","torrent":{"xt":"urn:btih:98663f675e559ca3dfab7cd35db8526bd606a27b","amp;dn":"Huvudj%26auml%3Bgarna+2011+SWESUB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98663f675e559ca3dfab7cd35db8526bd606a27b","infoHashBuffer":{"type":"Buffer","data":[152,102,63,103,94,85,156,163,223,171,124,211,93,184,82,107,214,6,162,123]},"announce":[],"urlList":[]}}