{"title":"The Kingdom of God (E-Books) Language English &amp; Arabic","uid":4696115,"size":528750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:990f314e417a771b150cf8d4ad4d145e87465ac7&amp;dn=The+Kingdom+of+God+%28E-Books%29+Language+English+%26+Arabic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"new boy","files":-1,"time":1233566141,"description":"The Kingdom of God - Steve Hanna (Books) Language English &amp; Arabic\n\nWhat you need to know about the kingdom of God?\n\n\n&quot;You are about to read of a man whose religious devotion and zeal for godliness were extraordinary. He studied the religious law of his community with great fervor and was expertly trained in the traditions of the elders.  He was God-fearing and pious. As a servant of the God of Abraham, he determined to protect his people from the influence of infidels and to preserve for his generation the sacred teachings of both the Written Law and the Oral Law. While still a young man, the sudden emergence of a strange religious sect stirred up the religious community of his day. He became actively involved in an effort to destroy the growing popularity of this disturbing movement. He resorted to ruthless tactics, using force and violence to instill fear in the hearts of the people. He felt justified in the use of brutal methods since it was his duty to defend the religion of God at all costs! However, during his campaign to eliminate the troublemakers and apostates, an astounding miracle took place that changed his life forever!\n\nIn the process of a life-changing experience, this man realized that his understanding of God, God's laws, and God's kingdom was incomplete. He needed more than just the knowledge of religious law. He needed to increase his knowledge of God and the true nature of God's kingdom. He needed experiential knowledge that could release to him spiritual power to resist the forces of evil and the whispers of  Satan. He became aware of the &quot;greater jihad,&quot; the need to conquer his own soul instead of conquering others. He saw the ultimate futility of armed violence and realized the only power that could ever change the hearts of people was the power of God's mercy and compassion.\n         \nO God, as we read about this life-changing power, increases us in knowledge so that the beautiful attributes of your kingdom might rule in our hearts. O Lord, guide us along the straight path; protect us from the mischief of Satan; and lead us to eternal bliss. May your kingdom be revealed; and may your will be fulfilled in our lives as we determine to fully submit to you.&quot;\n\n(The Kingdom of God; Steve Hanna)","torrent":{"xt":"urn:btih:990f314e417a771b150cf8d4ad4d145e87465ac7","amp;dn":"The+Kingdom+of+God+%28E-Books%29+Language+English+%26+Arabic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"990f314e417a771b150cf8d4ad4d145e87465ac7","infoHashBuffer":{"type":"Buffer","data":[153,15,49,78,65,122,119,27,21,12,248,212,173,77,20,94,135,70,90,199]},"announce":[],"urlList":[]}}