{"title":"Marital Separation and Lethal Domestic Violence - 1st Ed (2015)","uid":12577846,"size":2212790,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99b008a5d96a2241b15ece1af817609d28f012ee&amp;dn=Marital+Separation+and+Lethal+Domestic+Violence+-+1st+Ed+%282015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1444919601,"description":"Publisher: Routledge; 1 edition (April 1, 2015)\r\nLanguage: English\r\nISBN-10: 1455776750\r\nISBN-13: 978-1455776757\r\n\r\nThis book is the first to investigate the effects of participation in separation or divorce proceedings on femicide (murder of a female), femicide-suicide, homicide, and suicide. Because separation is one of the most significant predictors of domestic violence, this book is exclusively devoted to theorizing, researching, and preventing lethal domestic violence or other assaults triggered by marital separation. The authors provide evidence supporting the use of an estrangement-specific risk assessment and estrangement-focused public education to prevent murders and assaults. This information is needed not only by instructors in criminal justice and sociology programs, but by researchers theorizing about or investigating domestic violence. In the world of practitioners, family court judges, divorce mediators, family lawyers, prosecutors involved in bail hearings, shelter staff, and family counselors urgently need this resource. Ellis et al. include discussion questions and chapter objectives to support learners in the classroom or in community-based settings, and instructor support material includes PowerPoint lecture slides, additional teaching and research resources, and a test bank. This text advocates convincingly for prevention of domestic violence, and gives academics and practitioners the tools they need. This text advocates convincingly for prevention of domestic violence, and gives academics and practitioners the tools they need","torrent":{"xt":"urn:btih:99b008a5d96a2241b15ece1af817609d28f012ee","amp;dn":"Marital+Separation+and+Lethal+Domestic+Violence+-+1st+Ed+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99b008a5d96a2241b15ece1af817609d28f012ee","infoHashBuffer":{"type":"Buffer","data":[153,176,8,165,217,106,34,65,177,94,206,26,248,23,96,157,40,240,18,238]},"announce":[],"urlList":[]}}