{"title":"Mick Fleetwood's Zoo - I'm Not Me(1983)[EAC,log,cue. FLAC]","uid":8273973,"size":277046875,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:99c3a4b2e488f323713ef54f42e01aac58fe5a40&amp;dn=Mick+Fleetwood%27s+Zoo+-+I%27m+Not+Me%281983%29%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1363667973,"description":"01. Angel Come Home (04:22)\n02. You Might Need Somebody (03:32)\n03. Tonight (04:04)\n04. I Want You Back (02:58)\n05. I'm Not Me (03:47)\n06. State of the Art (04:10)\n07. Tear It Up (03:18)\n08. This Love (04:19)\n09. I Give (02:47)\n10. Just Because (02:47)\n11. Put Me Right (04:00)\n\nTwo years after his first solo excursion -- The Visitor in 1981 -- Mick Fleetwood formed his own Zoo, enlisting musicians that Lindsey Buckingham hired as live support for his own 1981 solo debut, Law &amp; Order. Fleetwood joined guitarist/singer Billy Burnette, guitarist Steve Ross, and bassist George Hawkins behind Buckingham when Lindsey was supporting Law &amp; Order, and this crew provides the core for the 1983 album I'm Not Me. Buckingham himself pops up on the single &quot;I Want You Back,&quot; a nifty, nervy little pop song that strongly recalls Fleetwood Mac circa Mirage, and there are other elements of that 1982 FM LP scattered throughout I'm Not Me, particularly when it drifts toward softer, sweeter material, as on the opening cover of the Beach Boys' &quot;Angel Come Home.&quot; Here, co-producers Fleetwood and Richard Dashut create a gorgeously detailed tapestry of harmonies and guitars, a soft rock suppleness that resurfaces on &quot;You Might Need Somebody&quot; and &quot;This Love,&quot; but the album was initially conceived as a bit of a straightforward rock &amp; roll revival and those elements survive, too, in the form of the Johnny Burnette cover &quot;Tear It Up&quot; and a version of Lloyd Price's &quot;Just Because.&quot; Not surprisingly, these two extremes don't quite gel, but the songs that provide a bridge between the two sounds -- the pop tunes in the middle, &quot;Tonight,&quot; &quot;I'm Not Me,&quot; and, especially, &quot;I Want You Back&quot; -- help tie the album together even if it doesn't quite give it cohesion. But cohesion is sometimes an overrated quality in a pop record: I'm Not Me is a mess but each of the individual parts carries its own charms, and it's an overlooked little gem of early-'80s mainstream pop/rock.","torrent":{"xt":"urn:btih:99c3a4b2e488f323713ef54f42e01aac58fe5a40","amp;dn":"Mick+Fleetwood%27s+Zoo+-+I%27m+Not+Me%281983%29%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99c3a4b2e488f323713ef54f42e01aac58fe5a40","infoHashBuffer":{"type":"Buffer","data":[153,195,164,178,228,136,243,35,113,62,245,79,66,224,26,172,88,254,90,64]},"announce":[],"urlList":[]}}