{"title":"PINK FLOYD 1973 - 1982  AC3 5.1 Surround","uid":4834354,"size":938227712,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9a42f591f14fb695712d6dde5ac17279729dd81e&amp;dn=PINK+FLOYD+1973+-+1982++AC3+5.1+Surround&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bubanee","files":7,"time":1239258749,"description":"THERE IS AN UPDATED VERSION OF THIS TORRENT CALLED\n\nPINK FLOYD - 1973 to 1983 AC3 5.1 SURROUND\n\n                    &quot;&quot;INFORMATION ABOUT THESE DISCS&quot;&quot;\n\nFirst of all this is not a SACAD format so you DO NOT NEED ANY SPECIAL\n   BULLSHIT EQUIPMENT to play this\nit is in dvd form for you to burn with DVD Shrink or the like..\nOr it's in .ISO   Either way it's\nin surround sound format in DVD exactly the same as the dvd movies\nyou buy from a shop\nhas a menu for seperate Album and/or Song select via the menu button..\nOn some disc it will display\n\nExample...   &quot;album 1/3 or Song 1/4 to View use ACROSS not   \n  Next to view the other Pages..  1 page usually\n   consists of around 9 give or take albums same applies for songs\n     this is only a guide each disc is different&quot;  Say like this disc here has only\n      1 page for albums and for each has 1 page for songs.\n       Except the wall and the final cut which will have several, because its longer\n  On your screen you will have a back ground picture\n   and written on it will be.. song name, album name and band name...\n\nWill auto play from the first song on The Disc.. Enjoy....\nIt's just like a C.D all songs are Separate no matter what album if there is several and you pick a certain song it will play it and then so on..  \n\nYes It is in DVD format for PAL.. Not that it matters that much since most DVD players play Both (PAL - NTSC)\nThere are programs like DVD clone to convert to NTSC if needed\n\n   \nRemember Your Recording is only as good as the BLANKS and SPEED you set and choose!!\n\n\nThe AC3 i use is &quot;Dolby LFE&quot; 2 front, 1 centre, 2 surround and 1 low freq.. \nthere all set at +0 so it's up to you to fiddle around with the sound levels \nOn your Stereo or whatever you use.\nWill play with standard 2 speakers just like a factory DVD.\n\n\nSEED IT! or its gone forever...\n\nAlso Seeding other AC3 5.1s and MP3.. just click on my name\n\ni was originally using the bit rate of 640kbps but found a lot of dvd players\nwere going mental so i dropped down to 448kbps which is standard for all players \n                &lt;&lt;SO THE SOUND IS EQUAL TO A DVD VIDEO&gt;&gt;  \n\nFrom the Bubanee, Mumlith, Dadanee, Sissy, Boranee, Roxynee and The Sha Sha","torrent":{"xt":"urn:btih:9a42f591f14fb695712d6dde5ac17279729dd81e","amp;dn":"PINK+FLOYD+1973+-+1982++AC3+5.1+Surround","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a42f591f14fb695712d6dde5ac17279729dd81e","infoHashBuffer":{"type":"Buffer","data":[154,66,245,145,241,79,182,149,113,45,109,222,90,193,114,121,114,157,216,30]},"announce":[],"urlList":[]}}