{"title":"Illuminati Music Videos (Conspiracy Documentary Video) 720 {xyz}","uid":9691697,"size":3230859029,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:9a485b6bad02c8f5818f1e4e5152f9ff0c8748b2&amp;dn=Illuminati+Music+Videos+%28Conspiracy+Documentary+Video%29+720+%7Bxyz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"one_last_round","files":1,"time":1393876667,"description":"Name: Music Videos That Still Want Your Soul (720) \n\n \nThis video is fair use under 17 U.S. Code Â§ 107 and is non-profit video. Music Videos used were all under ten percent of the original music video. For any music video over five minutes, less than 30 seconds was used from the source. Please be at least 18 to watch.\n \n\nThis film takes an honest look at popular music videos released mostly from 2012-2013. Music videos are subversive by nature. Subversive; trying to destroy or damage something, especially an established political system. My film will attempt the argument that music videos try to destroy and damage a person morally by shaping their values and behavior. This is accomplished by the viewer not being aware of this agenda and the propaganda. Then through repetition, targeting the youth, and by creating an idol image, the target usually accepts the subversive idea. The idea is made to look fun and popular, through having many young, attractive people in music videos. My film will show countless music videos that are subversive by definition. \n\nThis video has dual audio. Audio Track 2 is commentary. Please feel free to share this film with your friends and family.\n\n There are three versions 1080, 720, 480. The 1080 and 720 both have the same bitrate @ 5500. The 480 has a 2777 bitrate. I suggest downloading the 1080 if you plan on watching the film on a 1080 monitor or on a 1080 TV that's 36 inches or less. I think the 720 would look better on big screens because there is less blocking because of the ideal bitrate for the 720 version. Maybe someone can test out both and get back to me. The 480 version is for people that don't have a HD TV or computer monitor.\n\n Check out my facebook page by searching for: Craig Woyak Productions\n\n Sound Track:\n\n admiralbob77 - Longing for Tumbleweeds (ft. snowflake)\n cdk - Silence Await\n Donniedrost - Heaven Hell (ft. SerenityFrost)\n Ghost k - Dummy\n Gurdonark - Found\n Hansatom - Mock the Afflicted (ft. Robert Warrington)\n Ramblinglibrarian - How Do You Feel About That?\n Wired Ant - Mal Printemps (ft. Thomas \nTritschler, Martian Soul Trekkers)\n Zeos - Photo theme: Window Like\n Basematic - Orc March\n mindmapthat - Vox Vs. Uke(6 Vocal Stems 1 Ukulele Stem) ","torrent":{"xt":"urn:btih:9a485b6bad02c8f5818f1e4e5152f9ff0c8748b2","amp;dn":"Illuminati+Music+Videos+%28Conspiracy+Documentary+Video%29+720+%7Bxyz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a485b6bad02c8f5818f1e4e5152f9ff0c8748b2","infoHashBuffer":{"type":"Buffer","data":[154,72,91,107,173,2,200,245,129,143,30,78,81,82,249,255,12,135,72,178]},"announce":[],"urlList":[]}}