{"title":"Karma and Rebirth in Classical Indian Traditions (gnv64)","uid":8388660,"size":45949910,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9abcbf2099c68c53b00469f0d6f77a393338c234&amp;dn=Karma+and+Rebirth+in+Classical+Indian+Traditions+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1366356015,"description":"Karma and Rebirth in Classical Indian Traditions \nby Wendy Doniger O'Flaherty (Editor)\nUniversity of California Press | 1980 | ISBN 0-520-03923-8 | xv+342 pages | PDF | 43.8 mb &lt;a href=&quot;\nhttp://www.amazon.com/Karma-Rebirth-Classical-Indian-Traditions/dp/8120816714&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Karma-Rebirth-Classical-Indian-Traditions/dp/8120816714&lt;/a&gt;\n\nKarma is perhaps rhe most famous concept in Indian philosophy, but there is no comprehensive study of its various meanings or philosophical implications. Under the sponsorship of rhe American Council of Learned Societies and the Social Science Research Council, leading American Indologists met on several occasions to discuss their ideas about karma. The result is this volume.\nExchanges of draft essays led to a harmony of approach and an underlying set of methodological assumptions: a corpus of definitions of karma, a dia-lectic between abstract theory and historical explana-tion, an awareness of logical oppositions in theories of karma. No &quot;solution&quot; to the paradox of karma is offered, but the volume as a whole presents a con-sistent and encompassing approach to the many dif-ferent, often conflicting, Indian statements of the problem.\nThe particular value of the book lies in both its scope and its rich detail. Following an introductory essay, Wendy Doniger O'Flaherty presents the Vedic and Puranic background to the theory of karma. The various chapters respond to one another in a stimulating process of dialectic, opposition, and the reformulation of questions chat the volume presents but does not pretend to settle.\nThis book will have a considerable impact upon the teaching of Indian philosophy. At the very least, it demonstrates the impossibility of speaking of &quot;the theory of karma,&quot; as is so often done. It also supplies the basis for a full study of this important theory. Finally, it raises basic methodological problems about the study of a non-Western system of soteriology and rebirth, questions regarding the interaction of medical and philosophical models of the human body, the incorporation of philosophical theories into practical religions with which they are logically incompatible, and the problem of historical reconstruction of a complex theory of human life.","torrent":{"xt":"urn:btih:9abcbf2099c68c53b00469f0d6f77a393338c234","amp;dn":"Karma+and+Rebirth+in+Classical+Indian+Traditions+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9abcbf2099c68c53b00469f0d6f77a393338c234","infoHashBuffer":{"type":"Buffer","data":[154,188,191,32,153,198,140,83,176,4,105,240,214,247,122,57,51,56,194,52]},"announce":[],"urlList":[]}}