{"title":"MY GYM PARTNERS A MONKEY [SEASONS 1-4]","uid":7941681,"size":3015873114,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9cfb6fddbb8a26f92ac4b0f0de7016174896f213&amp;dn=MY+GYM+PARTNERS+A+MONKEY+%5BSEASONS+1-4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mike3313","files":-1,"time":1356004101,"description":"IT TOOK ME A WHILE TOO GET ALL FOUR SEASONS DOWNLOADED\nPLEASE SEED AND COMMENT AND ILL KEEP THEM COMING\n\nCOMMENT A REQUEST FOR SHOWS UR LOOKING FOR AND ILL MAKE THEM A TORRENT AND UPLOAD THEM =)\n\n\n\nMy Gym Partner's a Monkey is an American animated television series created by Timothy and Julie McNally Cahill and produced by Cartoon Network Studios. It premiered on Cartoon Network on December 26, 2005, and on The WB Television Network on January 7, 2006. The story revolves around Adam Lyon, a human who, after a clerical error listed his surname as &quot;Lion,&quot; is forced to transfer to Charles Darwin Middle School, a school for local anthropomorphic zoo animals, where he is partnered with Jake Spidermonkey in gym, with whom he quickly becomes best friends.\n\nThe series aired 96 episodes, one special and a feature film during its run. The series ended its 4-season run on November 27, 2008. On April 27, 2012, this series returned to Cartoon Network to show reruns on the revived block, Cartoon Planet. Two DVD volumes have been released in 2007 and 2008.\n\nMy Gym Partner's a Monkey was a ratings success for Cartoon Network, gaining millions of viewers. The series was met with generally positive reviews from critics. It was nominated for four Annie Awards and one Emmy Award, winning the Emmy Award.","torrent":{"xt":"urn:btih:9cfb6fddbb8a26f92ac4b0f0de7016174896f213","amp;dn":"MY+GYM+PARTNERS+A+MONKEY+%5BSEASONS+1-4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cfb6fddbb8a26f92ac4b0f0de7016174896f213","infoHashBuffer":{"type":"Buffer","data":[156,251,111,221,187,138,38,249,42,196,176,240,222,112,22,23,72,150,242,19]},"announce":[],"urlList":[]}}