{"title":"The Gourds - Cow Fish Fowl or Pig [2002][EAC,log,cue. FLAC]","uid":8859957,"size":427921757,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9d28905a6c9f8dd260721f360b73ad8d20a2a759&amp;dn=The+Gourds+-+Cow+Fish+Fowl+or+Pig+%5B2002%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":20,"time":1377750459,"description":"Artist:The Gourds\nRelease:Cow Fish Fowl or Pig\nReleased: 2002\nLabel: Sugar Hill\nCatalog#: SHCD 3953\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:americana,country\n\nPART 1 The cow brings home the fish \n\n1. My Name Is Jorge (3:49)\n2. Roll &amp; Tumble (3:57)\n3. 1st in Line (2:52)\n4. Foggy Blossom (Mechanical Bride) (3:42)\n5. The Bridge (2:36)\n6. Ants on the Melon (with due regards to Virginia Adair) (3:39)\n7. Hellhounds (2:57)\n8. Blankets (2:50)\n\n\n\nIntermission\n\n9. Short Guy Spiritual Rap (short Guy From &quot;Chi-Town&quot;) (2:43)\n\n\n\nPart 2 The fowl tells the pig of each transgression\n\n10. Bottle &amp; A Dime (3:11)\n11. Right in the Head (2:30)\n12. Ham-Fisted Box of Gloves (4:21)\n13. The Prayer That Fell Upon the Mirror (1:52)\n14. Best of Me (3:22)\n15. Sweet Nutty (3:09)\n16. Ceiling's Leaking (3:43)\n17. Smoke Bend (8:36)\n\nThe photo of the Gourds on the back of the CD booklet makes an odd impression: just a few good old boys, sloppily dressed with beers in hand, sort of a shorthaired version of Lynyrd Skynyrd. But this anti-intellectual pose is just a pose. The title itself, Cow Fish Fowl or Pig seems a bit fantastic, as though someone in the band had spent time in a Masters of English Literature program. &quot;My Name Is Jorge&quot; even includes surrealistic references to William S. Burroughs, Henry Ford, and Muhammad Ali. While this may sound a bit serious, the bandmembers balance their brainy wit with good-time Americana filled with fiddles, electric guitars, accordions, and drums. One of the Gourds' most appealing traits, in fact, is the way they change arrangements from piece to piece, turning &quot;Bottle and a Dime&quot; into Cajun-drenched rock and &quot;The Prayer That Fell Upon the Mirror&quot; into an acoustic feast. &quot;Blankets&quot; rolls along gently as the lyric tells the tale of a love affair that didn't quite work out. The album is split into two parts, &quot;the cow brings home the fish&quot; and &quot;the fowl tells the pig of each transgression,&quot; and is divided by a spiritual rap delivered by the &quot;Short Guy from 'Chi-Town.'&quot; This guest rap has the same &quot;this is real&quot; quality as a field recording, as the Short Guy tells how Christ delivered him from cocaine and other evils. The only downside to this innovative band is a vocal drone that seeps into most of its songs, casting a depressive air over the material (think new wave Americana). The combination of intelligent lyrics and a rich musical stew, however, offers listeners more substance than the average roots band. Fans will find Cow Fish Fowl or Pig as appealing as anything the Gourds have recorded.","torrent":{"xt":"urn:btih:9d28905a6c9f8dd260721f360b73ad8d20a2a759","amp;dn":"The+Gourds+-+Cow+Fish+Fowl+or+Pig+%5B2002%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d28905a6c9f8dd260721f360b73ad8d20a2a759","infoHashBuffer":{"type":"Buffer","data":[157,40,144,90,108,159,141,210,96,114,31,54,11,115,173,141,32,162,167,89]},"announce":[],"urlList":[]}}