{"title":"Why Red Doesn't Sound Like a Bell (2011) epub","uid":10404408,"size":5846914,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d9096a00b90849b01006896f740213308649c99&amp;dn=Why+Red+Doesn%27t+Sound+Like+a+Bell+%282011%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1403437205,"description":"Why Red Doesn't Sound Like a Bell: Understanding the feel of consciousness\n\n\n This book proposes a novel view to explain how we as humans -- contrary to current robots -- can have the impression of consciously feeling things: for example the red of a sunset, the smell of a rose, the sound of a symphony, or a pain.\n\nThe book starts off by looking at visual perception. Our ability to see turns out to be much more mysterious than one might think. The eye contains many defects which should seriously interfere with vision. Yet we have the impression of seeing the world in glorious panavision and technicolor. Explaining how this can be the case leads to a new idea about what seeing really is. Seeing is not passively receiving information in the brain, but rather a way of interacting with the world. The role of the brain is not to create visual sensation, but to enable the necessary interactions with the world.\n\n\n The &quot;sensorimotor&quot; approach is not simply a philosophical argument: It leads to scientifically verifiable predictions and new research directions. Among these are the phenomena of change blindness, sensory substitution, &quot;looked but failed to see&quot;, as well as results on color naming and color perception and the localisation of touch on the body.\n\n The approach is relevant to the question of what animals and babies can feel, and to understanding what will be necessary for robots to become conscious.\n","torrent":{"xt":"urn:btih:9d9096a00b90849b01006896f740213308649c99","amp;dn":"Why+Red+Doesn%27t+Sound+Like+a+Bell+%282011%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d9096a00b90849b01006896f740213308649c99","infoHashBuffer":{"type":"Buffer","data":[157,144,150,160,11,144,132,155,1,0,104,150,247,64,33,51,8,100,156,153]},"announce":[],"urlList":[]}}