{"title":"The Incredible Burt Wonderstone.mp4","uid":8332338,"size":494019644,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9da7aab6b19f19218cde7546f95c2333d0c72256&amp;dn=The+Incredible+Burt+Wonderstone.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1364912260,"description":"* MP4  * CAM  * 01H33M25S  * 895x458  * 29.97 frames  * Audio : mp4a 4800Hz AAC~SBR\n\n\n* Plot :\n\nIn 1982, young Albert is harassed by bullies. His mother gives him a special magic trick set by veteran magician Rance Holloway as his birthday present. He studies the instructional video and begins to practice some tricks, attracting the attention of a classmate, Anthony. They practice together and eventually become Burt Wonderstone and Anton Marvelton, earning them an ongoing gig at the Aztec Casino in Las Vegas. However, after ten years of performing the same tricks over and over again, Anton is fed up with Burt's ego, which has already cost them previous female assistants, called Nicole in the act. In a rush, Burt enlists production assistant Jane as the new Nicole.\n\nBurt and Anton encounter up-and-coming street magician Steve Gray performing a unique yet horrifying magic card trick for his TV magic show, Brain Rapist. Audience numbers soon dwindle at Burt and Anton's show. Taking a cue from Gray's own endurance-based stunts, Anton suggests that he and Burt try a similar tack--locking themselves up in a plastic cage called the Hot Box hung above the ground. Because he has not prepared himself for the stunt, Burt panics, causing him and Anton to fall to the ground, injuring Anton who angrily parts ways with Burt. Jane too leaves the act.\n\nBurt's efforts to keep the show running on his own fail. Aztec owner Doug Munny shuts down the production and Burt is left broke. Despondent, Burt tries to find work and is eventually hired as an entertainer at an assisted-living facility catering to former Vegas entertainers. There he meets Holloway, who retired several years before. Holloway counsels Burt about magic. Burt is shocked to see Jane--herself an aspiring magician--working for Gray. Appalled by Gray's style, Holloway and Burt polish their own tricks. Jane visits her grandmother at the facility and patches things up with Burt.\n\n\n\n* enjoy ...","torrent":{"xt":"urn:btih:9da7aab6b19f19218cde7546f95c2333d0c72256","amp;dn":"The+Incredible+Burt+Wonderstone.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9da7aab6b19f19218cde7546f95c2333d0c72256","infoHashBuffer":{"type":"Buffer","data":[157,167,170,182,177,159,25,33,140,222,117,70,249,92,35,51,208,199,34,86]},"announce":[],"urlList":[]}}