{"title":"Desperate Housewives Season 4 (With Swesub to Episode 13)","uid":4201781,"size":7344853026,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9e96ac7451295b7261f2fc695f40dd7ab35a0594&amp;dn=Desperate+Housewives+Season+4+%28With+Swesub+to+Episode+13%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"henke192","files":-1,"time":1211542627,"description":"Desperate Housewives Season 4 \n\n\n\nSeason 4 \n\n--------------------------------------------------------------------------------\n\nSeason 4, Episode 1: Now You Know\nOriginal Air Date: 30 September 2007\nAfter agreeing to run away with Carlos on her wedding night to Victor, Gabby gets a call from Carlos, informing her that Edie has tried to commit suicide. Meanwhile, Lynette tries to hide the fact that she has cancer from everyone, despite the fact she has no hair. Bree continues to hide the fact that her daughter is illegitimately pregnant by pretending to be pregnant herself. An old friend of Susan\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s, named Katherine Mayfair, moves back onto Wisteria Lane along with her second husband, gynecologist Adam Mayfair, and Kathrine\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s teenage daughter Dylan, all of whom have more secrets to hide.\n\nNext US airings:\nSun. May 25 9:00 PM ABC  \n\n\nSeason 4, Episode 2: Smiles of a Summer Night\nOriginal Air Date: 7 October 2007\nSusan is mistaken for a stripper. Lynette bans Tom from her chemotherapy sessions. Meanwhile, Bree does some investigating in Katherine\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s house and overhears Katherine and Dylan arguing about Dylan\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s birth father. Edie blackmails Carlos into getting engaged. Also, Gabby reveals a shock from the past to Lynette.\n\n\nSeason 4, Episode 3: The Game\nOriginal Air Date: 14 October 2007\nSusan and Mike have a charades party at their house. Meanwhile, Stella makes some pot-laced brownies for Lynette to rid her of the painful chemotherapy side effects. Bree tells the other housewives about what she overheard in Katherine\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s house and about the Mayfair\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s secret. Also, Gabrielle is unhappy to learn about Carlos and Edie\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s engagement.\n\n\nSeason 4, Episode 4: If There\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s Anything I Can\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;t Stand\nOriginal Air Date: 21 October 2007\nEdie receives unexpected news from her doctor, Susan tries to score points with the new neighbors and receives unexpected results, and Bree receives an unexpected baby shower, as well as an unexpected visitor. Meanwhile, Tom receives an unexpected evening with Lynnette.\n\n\nSeason 4, Episode 5: Art Isn\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;t Easy\nOriginal Air Date: 28 October 2007\nBattle lines are drawn between Katherine and Lynette over the vacant position of Association President when a unique piece of art shows up on Wisteria Lane, while Bree\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s former mother-in-law draws battle lines over Danielle\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s unborn child.\n\n\nSeason 4, Episode 6: Now I Know, Don\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;t Be Scared\nOriginal Air Date: 4 November 2007\nAs Halloween approaches, Edie\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s biggest fear comes true when Carlos walks out on their relationship. Susan finds Mike\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s father, who was supposedly dead. Danielle goes into labor right in the middle of Bree\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s Halloween party... and somebody has to deliver the baby.\n\nNext US airings:\nSun. May 25 12:00 AM LIFE  \n\n\nSeason 4, Episode 7: You Can\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;t Judge a Book by Its Cover\nOriginal Air Date: 11 November 2007\nLynette\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s estranged sisters, Lydia and Lucy, come to visit. While having dinner with Susan and Mike, Bree and Orson realize they share different views on whether Danielle\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s newborn baby should be circumcised. On a boat, Victor confronts Gabrielle about her affair with Carlos, and she responds by throwing him into the ocean. Later, Bree informs Susan that she thinks Mike is a drug addict.\n\nNext US airings:\nSun. June 1 12:00 AM LIFE  \n\n\nSeason 4, Episode 8: Distant Past\nOriginal Air Date: 25 November 2007\nA mysterious stalker from Adam Mayfair\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s past, named Sylvia, shows up on Wisteria Lane. Police detectives question Gabrielle about Victor\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s whereabouts while Carlos argues with her about reporting Victor\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s attempt on their lives. Danielle\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s crying baby puts stress on Bree and Orson\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s marriage, as well as on Andrew who decides to move out. Meanwhile, Lynette has a reunion with her long-lost stepfather, Glen, over wanting to find her mother now living on the streets. Susan notices Mike is behaving strangely and soon realizes that he is still hiding his painkiller addiction after she has a meeting with his dealer Barrett.\n\n\nSeason 4, Episode 9: Something\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s Coming\nOriginal Air Date: 2 December 2007\nGabrielle announces to her friends that she and Carlos are going to run away together to get away from the revenge-seeking Victor now out after both of their hides. But things take an unexpected turn when a large tornado hits Whisteria Lane. Gabrielle finds herself seeking shelter in the crawlspace with Edie under her house where the bicker about the men in their lives. Bree and Orson are forced to deal with the crazy Sylvia Green who continues to pursue Adam while the hostile Katherine comes clean about their pasts. Lynnette, Tom and their wild kids are forced to seek shelter in Mrs. McKlusky\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s basement which prompts out more complications over Tom\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s allergic reaction to Ida Greenburg\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s pet cat. Meanwhile, Mike accompanies Susan to the hospital after she twists her ankle where she confronts him about his painkiller addiction and realizes the severity of how it\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s escalated.\n\n\nSeason 4, Episode 10: Welcome to Kanagawa\nOriginal Air Date: 6 January 2008\nIn the aftermath of the tornado that has devastated Whisteria Lane, Lynette\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s husband, Tom, and all their children survived, but Ida Greenburg didn\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;t. Lynette decides to team with Karen McCluskey to have a private memorial service for their neighbor by scattering her ashes on a old baseball field. Meanwhile, Bree and Orson move in with Susan and Julie while their house is being repaired, only to find themselves recruiting Andrew to woo their contractor to get him to finish the damaged roof of their house, while Susan, more emotionally vulnerable and crazy then ever, plots to get Bree to stay to keep her company while Mike is in rehab. Gabrielle learns that Milton Lang has cut her out of her husbands will, leaving her broke, while Carlos is in the hospital blinded from his injuries. Also, Katherine kicks Adam out of their house after finding out that he lied about having an affair with the late Sylvia Greeen, but an incriminating letter left by Katherine\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s late aunt forces the both of them to come to terms with a dark secret, and Dylan also discovers the letter.\n\n\nSeason 4, Episode 11: Sunday\nOriginal Air Date: 13 April 2008\nA few skeletons in Kathryn Mayfair\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s abundant closets are sneaking out, and a surprise wedding ceremony takes place.\n\n\nSeason 4, Episode 12: In Buddy\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s Eyes\nOriginal Air Date: 20 April 2008\nLynette gets a surprise when a person from her past shows up at the pizzeria.\n\n\nSeason 4, Episode 13: Hello, Little Girl\nOriginal Air Date: 27 April 2008\nBree and Katherine decide to become business partners, and Mike discovers the truth about the accident that almost killed him.\n\n\nSeason 4, Episode 14: Opening Doors\nOriginal Air Date: 4 May 2008\nLynette finds out that the twins, Preston and Porter, responsible for starting the fire at Rick\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s restaurant. But the true culprit is the crafty Kayla who finally begins escalating her twisted quest to destroy the Scarvo family by trickery and intimidation. While Lynette sees through the charming, but very sociopath, Kayla\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s nefarious plans, Tom, blinded by his own denial, refuses to believe that Kayla is responsible for everything bad that is happening to them. Meanwhile, Bree gives Orson an ultimatum to turn himself in after finding out that he was the one who attempted to kill Mike. Orson refuses, and is forced to move out of the house. But as always, the man-hungry Edie appears and offers her house for Orson to stay in while he looks for a new place. Susan reconnects with her ex-husband, Karl whom he meets at a Lamaze class. Carlos and Gabrielle rent out their spare bedroom to Ellie, a young artist, whom Gabrielle suspects is running a prostitution ring from their house. Also, Katherine finally finds out that Dylan is secretly meeting with her ex-husband Davis.\n\n\nSeason 4, Episode 15: Mother Said\nOriginal Air Date: 11 May 2008\nGabrielle and Carlos finally learn the truth about Ellie\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;work\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;, and they also discover the police are already onto Ellie, and have been staking out the Solis home for some time and want to use the Solis\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039; to arrest Ellie in a sting operation. Edie does something shocking involving Orson, and this will lead to a shocking conclusion to her time on Wisteria Lane. Also, Adele Delfino, Susan\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s mother-in-law, arrives for a visit.\n\n\nSeason 4, Episode 16: The Gun Song\nOriginal Air Date: 18 May 2008\nSusan finally gives birth to her new baby, and all of her friends on Wisteria Lane welcome the new addition to Susan and Mike\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s family. Meanwhile, Bree and Katherine do some shooting. Gabrielle forms a strong bond with Ellie. The evil Kayla pushes her plan to destroy the Scavo family into full force when she fabricates a story that Lynette is physically abusing her, and Kayla further uses her natural-born skill of lying and manipulation to play on the easily fooled Tom, and the residents, sympathies.\n\n\nSeason 4, Episode 17: Free\nOriginal Air Date: 18 May 2008\nIn the cliff-hanging season final, several residents of Wisteria Lane are faced with deadly threats... including Katya\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s threat to Lynette with the alleged \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;abuse\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; charges. Meanwhile, Susan realizes she will soon lose someone she loves. Also, Katherine Mayfair\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s secret about her past and of what happened is finally revealed.\n\n","torrent":{"xt":"urn:btih:9e96ac7451295b7261f2fc695f40dd7ab35a0594","amp;dn":"Desperate+Housewives+Season+4+%28With+Swesub+to+Episode+13%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e96ac7451295b7261f2fc695f40dd7ab35a0594","infoHashBuffer":{"type":"Buffer","data":[158,150,172,116,81,41,91,114,97,242,252,105,95,64,221,122,179,90,5,148]},"announce":[],"urlList":[]}}