{"title":"Extreme Picture Finder v3.27.4.1 (FIXED) [Cracked] cigoL","uid":12149812,"size":10055065,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9f20ae73c7723235da52163a65ba218f42792cdd&amp;dn=Extreme+Picture+Finder+v3.27.4.1+%28FIXED%29+%5BCracked%5D+cigoL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_cigoL","files":4,"time":1437589007,"description":"More information here: http://www.exisoftware.com/picture_finder/\n\nNOTE: This is a re-upped fix. The one I uploaded last night had a bug. Sorry about that.\n\nBatch image downloader - download all images from website\n\nBatch image downloader - download all images from websiteExtreme Picture Finder is a powerful batch image downloader. Download all images from any website automatically and very fast. But not only images! It allows you to download music, video or any other files - just enter the website address, choose what files to download and where to save them and let Extreme Picture Finder do the rest for you. And you can instantly view the downloaded files in the built-in image viewer.\n\nThe program can be configured to download images from password-protected websites, forum threads, even social networks. Using advanced settings you can make Extreme Picture Finder skip certain parts of websites, like entire folders or single pages to make the download process even faster. \n\nDon't know where to start downloading? Extreme Picture Finder offers a built-in online projects database with thousands of website addresses sorted by category: Desktop Wallpapers, Cars, Girls, Nature and many, many others.\n\nAnother great feature of the program is, as the name suggests, a built-in picture finder. Just enter the keyword and the program will find and download thousands of pictures for you. It has different search modes allowing you vary the level of your interaction with the download process. You can let the program find and download only thumbnails and you'll see hundreds of images flying to you in a matter of seconds - this is the fastest search mode. Then you can choose which full-size images to download manually. Of course, you can make Extreme Picture Finder find, download and save both thumbnails and full-size images automatically, or only full-size images. Plus the program can save all images that were found on the same page, where the original full-size image is located - the related images","torrent":{"xt":"urn:btih:9f20ae73c7723235da52163a65ba218f42792cdd","amp;dn":"Extreme+Picture+Finder+v3.27.4.1+%28FIXED%29+%5BCracked%5D+cigoL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f20ae73c7723235da52163a65ba218f42792cdd","infoHashBuffer":{"type":"Buffer","data":[159,32,174,115,199,114,50,53,218,82,22,58,101,186,33,143,66,121,44,221]},"announce":[],"urlList":[]}}