{"title":"John Lancester - Capital","uid":8635442,"size":379015512,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a015323cddb960fe2017ab381a2ac22d63784308&amp;dn=John+Lancester+-+Capital&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Wldsthrnboy","files":-1,"time":1372730750,"description":"Written by John Lanchester \nFormat: MP3 \n\nPepys Road: an ordinary street in the Capital. Each house has seen its fair share of first steps and last breaths, and plenty of laughter in between. Today, through each letterbox along this ordinary street drops a card with a simple message: We Want What You Have.\n\n\n\nAt forty, Roger Yount is blessed with an expensively groomed wife, two small sons and a powerful job in the City. An annual bonus of a million might seem excessive, but with second homes and nannies to maintain, he's not sure he can get by without it. Elsewhere in the Capital, Zbigniew has come from Warsaw to indulge the super-rich in their interior decoration whims. Freddy Kano, teenage football sensation, has left a two-room shack in Senegal to follow his dream. Traffic warden Quentina has exchanged the violence of the police in Zimbabwe for the violence of the enraged middle classes. For them all, this city offers the chance of a different kind of life.\n\n\n\nCapital is a post-crash state-of-the nation novel told with compassion and humour, featuring a cast of characters that you will be sad to leave behind.","torrent":{"xt":"urn:btih:a015323cddb960fe2017ab381a2ac22d63784308","amp;dn":"John+Lancester+-+Capital","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a015323cddb960fe2017ab381a2ac22d63784308","infoHashBuffer":{"type":"Buffer","data":[160,21,50,60,221,185,96,254,32,23,171,56,26,42,194,45,99,120,67,8]},"announce":[],"urlList":[]}}