{"title":"Coast to Coast - 2013-08-02 - Haunted Locations","uid":8782390,"size":54917393,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a0df5537917ae2b0090e884e668bde2e08be95d5&amp;dn=Coast+to+Coast+-+2013-08-02+-+Haunted+Locations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":5,"time":1375745118,"description":"Host: George Noory\nGuests: Rebecca F. Pittman, Open Lines  \n\n\nIn the first half of the program, author Rebecca F. Pittman discussed haunted locations such as Colorado's Stanley Hotel and Louisiana's Myrtles Plantation. Having experienced more than one ghostly encounter, she mused that &quot;once you have it and you can't explain it away anymore, you can't close your mind again. To that end, she recalled one incident at the Stanley Hotel, which occurred during the building's &quot;off season,&quot; where her group was blasted by a cloud of cherry blend tobacco smoke. Just as quickly as the smoke emerged, she said, it suddenly dissipated rather than fade away. Chillingly, this specific type of tobacco was a favorite of a man named Lord Dunraven, who is said to haunt that very floor of the hotel.\n\nOn the nature of ghosts, Pittman mused that she actually feels sorry for these disembodied spirits, since they appear to want to communicate with the living but are limited by how they can do it. &quot;In all the places I've stayed, I've never felt threatened,&quot; she said, &quot;I've felt they were just trying to get our attention, for whatever reason.&quot; With the increased popularity of ghost hunting, Pittman cautioned that more and more locations may be claiming to be haunted as a way of attracting visitors. &quot;It's almost becoming oversaturated and turning it into a circus, which I find distressing,&quot; she lamented. That said, she expressed confidence that, based on her personal experiences, the locations she has researched are &quot;definitely haunted.&quot;\n\n--------------------------------------------\n\nAt the start of Open Lines, George spoke with Chris from Morningstar Entertainment, a television production company that is producing a new show about people who believe they are aliens living on Earth. While he acknowledged that these stories could be seen as outlandish, Chris was hopeful that the series could give skeptics pause and make them rethink their perspective on the possibilities of ETs. Remarkably, in only two months of work on the series, he has been contacted by about 150 people who claim to be &quot;earthbound ETs.&quot; He encouraged Coast listeners who believe that they are aliens or may have been related to aliens to contact him via email.\n\nLater in the program, John from Tulsa recounted an eerie tale of potential after-death communication. He explained that his wife's great aunt passed away after seven years of being bedridden. After deciding to bury her with her watch, they were startled to discover that the timepiece, which had long since been abandoned, showed the exact time of the woman's death. &quot;She hadn't worn it in over seven years, but it was the exact time she had passed that morning,&quot; he marveled. Other callers during Open Lines included Gail in England, who talked about her investigation of crop circles in the UK, and John in Salt Lake City, who detailed his visit to the infamous Skinwalker Ranch in Utah.\n\nNews segment guests: Lauren Weinstein, Dr. Peter Breggin, and Engelbert Humperdinck","torrent":{"xt":"urn:btih:a0df5537917ae2b0090e884e668bde2e08be95d5","amp;dn":"Coast+to+Coast+-+2013-08-02+-+Haunted+Locations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0df5537917ae2b0090e884e668bde2e08be95d5","infoHashBuffer":{"type":"Buffer","data":[160,223,85,55,145,122,226,176,9,14,136,78,102,139,222,46,8,190,149,213]},"announce":[],"urlList":[]}}