{"title":"David Murray Black Saint Quartet - Sacred Ground (2007)","uid":5668666,"size":403674630,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a1a33f7fe2939cd538499f57d9a1cd6a7578e3a5&amp;dn=David+Murray+Black+Saint+Quartet+-+Sacred+Ground+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mariorg","files":-1,"time":1278203862,"description":"Personnel:\n~~~~~~~\n* David Murray: tenor saxophone, bass clarinet\n* Lafayette Gilchrist: piano\n* Ray Drummond: bass\n* Andrew Cyrille: drums\n* Cassandra Wilson: vocal (1, 7)\n\nJustin Time Records &lt;a href=&quot;\nhttp://www.justin-time.com/albums.php?lang=en&amp;pid=5326&amp;aid=164&amp;anid=204&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.justin-time.com/albums.php?lang=en&amp;pid=5326&amp;aid=164&amp;anid=204&lt;/a&gt;\n\nTroy Collins\n\nWith three decades of recording to his credit, multi-reedist and composer David\nMurray's oeuvre is a varied one; his dabbling in pan-global multi-ethnic fusions\nand ensembles has ranged from solo recitals to big bands.\n\nMurray's tenth album for Justin Time Records, Sacred Ground is inspired by his\nrecent film soundtrack for Marco Williams' Banished, which documents the rarely\ndiscussed expulsion of thousands of African-American families from their homes\nat the close of the Civil War through to The Great Depression.\n\nSacred Ground is the first official recording of Murray's quartet without his\nlong-standing pianist John Hicks, who passed away last year. Lafayette\nGilchrist, a former student of Hicks, assumes his role with intensity and\nflair. Bassist Ray Drummond and drummer Andrew Cyrille have been two of Murray's\nmain collaborators for years, bringing fresh perspectives to traditional\nconcepts.\n\nVocalist Cassandra Wilson joins Murray's stellar line-up on the dramatic ballads\nthat open and close the album, with intrepid lyrics written by poet Ishmael\nReed.\n\nAn indictment against the oppression of former slaves after the Civil War, the\ntitular opener features Wilson's soulful croon animating Reed's texts with\nsimmering intensity. Rending at the supple fabric of the ballad structure, the\nquartet brings the piece to a simmering boil, climaxing with Murray's brawny\ntenor erupting in blistering, altissimo catharsis.\n\nNot all mordant introspection, the carefree West Indian lilt of &quot;Transitions&quot;\nprovides respite, with Murray, Gilchrist and Cyrille delivering vibrant,\npneumatic statements.\n\nThe mournful &quot;Pierce City&quot; and &quot;Banished&quot; redirect the album through anguished\nlamentation. Filled with raw emotion, &quot;Banished&quot; unveils Murray's caterwauling\nbass clarinet over a roiling dirge, anchored by Drummond's sinewy arco\nbowing. &quot;Believe In Love&quot; and &quot;Family Reunion&quot; re-emerge from the depths with\noptimistic verve, the former a sultry tango work-out, the latter a riveting hard\nbop excursion.\n\nBringing the album full-circle, Cassandra Wilson rejoins the quartet on &quot;The\nProphet of Doom,&quot; a slinky blues work-out that draws socio-political parallels\nto the exploited Cassandra of Greek mythology with wry attitude and erudite\nrefrains, mirrored by Murray's effusive tenor.\n\nA focused and powerful statement from a multi-faceted artist, Sacred Ground is a\nperfect introduction for novices to Murray's voluminous discography.","torrent":{"xt":"urn:btih:a1a33f7fe2939cd538499f57d9a1cd6a7578e3a5","amp;dn":"David+Murray+Black+Saint+Quartet+-+Sacred+Ground+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1a33f7fe2939cd538499f57d9a1cd6a7578e3a5","infoHashBuffer":{"type":"Buffer","data":[161,163,63,127,226,147,156,213,56,73,159,87,217,161,205,106,117,120,227,165]},"announce":[],"urlList":[]}}