{"title":"Kameron Hurley - Bel Dame Apocrypha [1-3]","uid":11620150,"size":621609918,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a1badf6aaf33f670ff6804eafcdd5b8a3564f2aa&amp;dn=Kameron+Hurley+-+Bel+Dame+Apocrypha+%5B1-3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":3,"time":1417535788,"description":"\nGod's War (Bel Dame Apocrypha #1) \n\nNyx had already been to hell. One prayer more or less wouldn't make any difference...\n\nOn a ravaged, contaminated world, a centuries-old holy war rages, fought by a bloody mix of mercenaries, magicians, and conscripted soldiers. Though the origins of the war are shady and complex, there's one thing everybody agrees on...\n\nThere's not a chance in hell of ending it.\n\nNyx is a former government assassin who makes a living cutting off heads for cash. But when a dubious deal between her government and an alien gene pirate goes bad, Nyx's ugly past makes her the top pick for a covert recovery. The head they want her to bring home could end the war--but at what price?\n\nThe world is about to find out.\n\n---\n\nInfidel (Bel Dame Apocrypha #2)\n\nNyx is a bodyguard in Mustallah, the capital city of Nasheen. The centuries-long holy war between Nasheen and Chenja is taking its toll, with shortages and rationing causing the Queen to lose power and popularity. While protecting the daughter of a Ras Tiegan Diplomat, Nyx is attacked by a group of assassins. Nyx survives, but begins to suffer from a strange, debilitating condition that nobody can identify. Caught up in a whirl-wind of intrigue involving Bel Dam Assassins plotting against the Queen, Nyx must learn who the rouge Bel Dam is, and find a cure for her illness, while avoiding the wrath of the queen she is trying to protect. The danger that swirls around her may have finally become to much, and Nyx's colleagues and friends began to die. Will Nyx be next?\n\n---\n\nRapture (Bel Dame Apocrypha #3)\n\nAfter years in exile, Nyxnissa so Dasheem is back in action in service to the bel dames, a sisterhood of elite government assassins tasked with eliminating deserters and traitors. The end of a centuries-long holy war between her country, Nasheen, and neighboring Chenja has flooded the streets of Nasheen with unemployed - and unemployable - soldiers whose frustrations have brought the nation to the brink of civil war.\n\nNot everyone likes this tenuous and unpredictable &quot;peace,&quot; however, and somebody has kidnapped a key politician whose death could trigger a bloody government takeover. With aliens in the sky and revolution on the ground, Nyx assembles a team of mad magicians, torturers,and mutant shape-shifters for an epic journey across a flesh-eating desert in search of a man she's not actually supposed to kill.\n\nTrouble is, killing is the only thing Nyx is good at. And she already left this man to die","torrent":{"xt":"urn:btih:a1badf6aaf33f670ff6804eafcdd5b8a3564f2aa","amp;dn":"Kameron+Hurley+-+Bel+Dame+Apocrypha+%5B1-3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1badf6aaf33f670ff6804eafcdd5b8a3564f2aa","infoHashBuffer":{"type":"Buffer","data":[161,186,223,106,175,51,246,112,255,104,4,234,252,221,91,138,53,100,242,170]},"announce":[],"urlList":[]}}