{"title":"AMERICAN REUNION 2012 DVDrip - GLOBE","uid":7468598,"size":1668213282,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a1ca3c8617ccaa9e6ed31e1de7d276fa36c870bc&amp;dn=AMERICAN+REUNION+2012+DVDrip+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"globeplus","files":-1,"time":1343074762,"description":"* XVID DVDRip  * 01H53M49S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n\n* FILE INFO :\n\n\n\n- THE DUB WORK JOINED THE 2 CDS FROM THE DVDRIP OF THIS MOVIE\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n\n* Plot :\n\nThirteen years after graduating high school, Jim Levenstein (Jason Biggs), Chris &quot;Oz&quot; Ostreicher (Chris Klein), Kevin Myers (Thomas Ian Nicholas), Paul Finch (Eddie Kaye Thomas), and Steve Stifler (Seann William Scott) have moved on with adult life and responsibilities. Jim is still married to Michelle (Alyson Hannigan) and they now have a two-year-old son, Evan. However, since the birth of their son, Jim and Michelle's sex life has slowly but surely begun to deteriorate. Oz is an NFL sportscaster living in Los Angeles with his supermodel girlfriend Mia (Katrina Bowden). Kevin is married to Ellie and works from home as an architect. Finch has supposedly gone missing, and Stifler works as a temp at an investment firm.\n\nWhen former classmate John (John Cho), one half of the 'MILF' duo, organizes a Class of 1999 high school reunion in East Great Falls, Jim and Michelle arrive at Jim's old home, where his father Noah (Eugene Levy) is now a widower. Jim encounters his neighbor Kara (Ali Cobrin), who he used to babysit and is soon to turn 18. Jim meets up with Oz, Kevin and Finch at a bar, where they meet Selena (Dania Ramirez), a former classmate and Michelle's friend from band camp. Stifler unknowingly happens across the group, and joins them for weekend activities.\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:a1ca3c8617ccaa9e6ed31e1de7d276fa36c870bc","amp;dn":"AMERICAN+REUNION+2012+DVDrip+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1ca3c8617ccaa9e6ed31e1de7d276fa36c870bc","infoHashBuffer":{"type":"Buffer","data":[161,202,60,134,23,204,170,158,110,211,30,29,231,210,118,250,54,200,112,188]},"announce":[],"urlList":[]}}