{"title":"E_C_Knuth-The_Empire_Of_The_City,1944.pdf","uid":4585009,"size":1939237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a20ba5bbfe85cfba1265dd099bb1050f89302846&amp;dn=E_C_Knuth-The_Empire_Of_The_City%2C1944.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"antiusury","files":1,"time":1229585137,"description":"December 31, 1945 (2nd Edition) Empire of the City by E. C. Knuth\n\nThe foregoing matter of the first edition was written about two years ago and the &quot;One World&quot; camarilla has since advanced very close to its planned objective as may be apparent from a copy of the &quot;Articles of Agreement of the \nInternational Monetary Fund and International Bank for Reconstruction and Development,&quot; adopted at Bretton Woods, New Hampshire, July 22, 1944; which appeared in &quot;International Conciliation, No. 413&quot; dated September, 1945, a booklet issued by the Carnegie Endowment for International Peace with a preface by Dr. Nicholas Murray Butler.\n\nThe following sentences were selected from Article IX, Sections 1 to 9:\nThe fund shall possess full juridical personality. Shall have immunity from judicial process. \n\nProperty and assets of the Fund, wherever located and by whomever held, shall be immune from search, requisition, confiscation, expropriation, or any other form of seizure by executive or LEGISLATIVE ACTION.\n\nThe archives shall be held inviolable.\n... all property and assets shall be free from restrictions, regulations, controls, and moratoria of any nature.\n\nThe officers and personnel shall be immune from legal processes, immigration restrictions, alien registration requirements, and national service obligations; shall be immune from taxation and customs duties, immune from liability for taxes and duties.\n\nNo taxation of any kind shall be levied on any obligation or security, dividend or interest of the Fund.\n\nThis is obviously merely a precise rewording of the ambiguous provisions of the &quot;Laws of England;&quot; which, as variously developed hereinbefore, have placed the Bank of England over and above LEGISLATIVE ACTION heretofore, and made of it a sovereign world supergovernment; with the House of Commons prohibited even from discussing its activities, while the House itself was subject to the orders of &quot;the executive&quot; as to the legislation required by &quot;The City.&quot;\n\nLink to the IMF incorporation docs is near the end of the book.\n\n\nSearch also for Empire of the City - Ring of Power movie, EMPIRE_OF_THE_CITY_-_Ring_of_Power_-_(audio_fixed)_[mininova].torrent\n","torrent":{"xt":"urn:btih:a20ba5bbfe85cfba1265dd099bb1050f89302846","amp;dn":"E_C_Knuth-The_Empire_Of_The_City%2C1944.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a20ba5bbfe85cfba1265dd099bb1050f89302846","infoHashBuffer":{"type":"Buffer","data":[162,11,165,187,254,133,207,186,18,101,221,9,155,177,5,15,137,48,40,70]},"announce":[],"urlList":[]}}