{"title":"Plastics from Bacteria - Natural Functions and Applications","uid":12427827,"size":21233293,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a321aaaf406c96ae3a208b76959b33d002c17c73&amp;dn=Plastics+from+Bacteria+-+Natural+Functions+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1442412944,"description":"Plastics from Bacteria - Natural Functions and Applications - Guo-Qiang Chen (Springer, 2010).pdf\n\nISBN 978-3-642-03286-8\n\nDue to the possibility that petroleum supplies will be exhausted in the next decades to come, more and more attention has been paid to the production of bacterial pl- tics including polyhydroxyalkanoates (PHA), polylactic acid (PLA), poly(butylene succinate) (PBS), biopolyethylene (PE), poly(trimethylene terephthalate) (PTT), and poly(p-phenylene) (PPP). These are well-studied polymers containing at least one monomer synthesized via bacterial transformation. Among them, PHA, PLA and PBS are well known for their biodegradability, whereas PE, PTT and PPP are probably less biodegradable or are less studied in terms of their biodegradability. Over the past years, their properties and appli- tions have been studied in detail and products have been developed. Physical and chemical modifications to reduce their cost or to improve their properties have been conducted. PHA is the only biopolyester family completely synthesized by biological means. They have been investigated by microbiologists, molecular biologists, b- chemists, chemical engineers, chemists, polymer experts, and medical researchers for many years. PHA applications as bioplastics, fine chemicals, implant biomate- als, medicines, and biofuels have been developed. Companies have been est- lished for or involved in PHA related R&amp;D as well as large scale production. It has become clear that PHA and its related technologies form an industrial value chain in fermentation, materials, feeds, and energy to medical fields","torrent":{"xt":"urn:btih:a321aaaf406c96ae3a208b76959b33d002c17c73","amp;dn":"Plastics+from+Bacteria+-+Natural+Functions+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a321aaaf406c96ae3a208b76959b33d002c17c73","infoHashBuffer":{"type":"Buffer","data":[163,33,170,175,64,108,150,174,58,32,139,118,149,155,51,208,2,193,124,115]},"announce":[],"urlList":[]}}