{"title":"Optical SuperComputing","uid":6509361,"size":3734004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a51d486ddffd22ef126900941c11bc27480dae5e&amp;dn=Optical+SuperComputing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309559677,"description":"Shlomi Dolev, Mihai Oltean, &quot;Optical SuperComputing&quot;\nSp in er | 2009 | ISBN: 364210441X | 155 pages | PDF | 4,5 MB\n\nThis book constitutes the refereed proceedings of the The Second International Workshop on Optical SuperComputing, OSC 2009, held in Bertinoro, Italy, in November 2009.\n\nThe 18 revised full papers presented together with 1 invited lecture were carefully reviewed and selected from numerous submissions for inclusion in the book. Being an annual forum for research presentations on all facets of optical computing for solving hard computation tasks, OCS addresses the following topics of interest: designs of optical computing devices, algorithmics and complexity issues of optical computing, computation representation by photons and holograms, neural and brain inspired architectures, electro-optic devices, practical implementations, analysis of existing devices and case studies, optical photonics and laser switching technologies, optical and photonic memories, optical signal processing subsystems, optical networks for high-performance computing, optical interconnections, quantum optical systems, applications and algorithms for optical devices, Alpha particles, X-rays, and nano-technologies for optical computing.","torrent":{"xt":"urn:btih:a51d486ddffd22ef126900941c11bc27480dae5e","amp;dn":"Optical+SuperComputing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a51d486ddffd22ef126900941c11bc27480dae5e","infoHashBuffer":{"type":"Buffer","data":[165,29,72,109,223,253,34,239,18,105,0,148,28,17,188,39,72,13,174,94]},"announce":[],"urlList":[]}}