{"title":"The High Decibels - The High Decibels (2008) [FLAC]","uid":10666290,"size":231900973,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a5373f0c6c1728bca3124c1bf72de489baa41130&amp;dn=The+High+Decibels+-+The+High+Decibels+%282008%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Gomu69","files":-1,"time":1406804409,"description":"The High Decibels - The High Decibels (2008) [FLAC]\n\nReleased: 2008\nDuration: 32:45\nGenre: Rap, Hip-Hip\nStyle: Blues, Jazz, Funk\nSource: CD (log + cue)\nCodec: FLAC\nBit Rate: ~ 1411 kbps\nBits Per Sample: 16\nSample Rate: 44,100 Hz\n\n01 - Miss Cindy\n02 - That Dude\n03 - Crash With No Cushion\n04 - Who Knew Duke\n05 - Duke Gonna Get'em\n06 - Eye Of The Storm\n07 - Home Run Hitters\n08 - No Peace In The Streets\n09 - A Word I Said\n10 - The Great Must Last\n11 - Prophesy\n12 - Bossman Blues\n\nQuoted from: http://cdbaby.com/cd/highdecibels\n\n#4 Nationwide CMJ Hip Hop! &quot;The High Decibels blend the blues with hip-hop on their self-titled debut to create a fresh, inspiring record. -- OkayPlayer\n\n\n\nDuke Johnson and his hypeman, Chief, are taking the blues back from a long list of white guys who started hijacking it in the '60s ... The High Decibels show that the blues aren't dead, and neither is hip-hop. -- Urb\n\n\n\nGliding from hip-hop and rock to blues with frightening ease is the second coming of schoolyard funk in the form of Oakland trio High Decibels.&quot; -- Pensatos\n\n\n\nWith the solid support of college radio and hip hop/alternative press, the High Decibels have gained a reputation as one of the freshest and most innovative new hip hop groups. Featuring two MCs and a crackerjack live band, the group slides easily between classic rap and rock styles, bringing a brash, adventurous spirit back to a genre that sorely lacks it.\n\n\n\nFrontman Duke Johnson, an East Oakland native, started freestyling at the age of 12 in the schoolyard with some friends, including his current HD partner, hypeman Chief. His first live performance was at a talent show at a local high school. Mid-performance, his backing CD started skipping, and the audience booed him offstage.\n\n\n\n\nDiscouraged from performing rap, Duke decided to try poetry and spoken word. Equipped with plenty of subject matter from his experiences living in Oakland, he gathered his confidence and entered a few slam events. Transfixing audiences with real life depictions of struggles and shootings -- one he witnessed at the age of 8 -- Duke soon became a top ranked slam poet in the Bay Area.\n\n\n\n\nIt was at a slam event in Berkeley where Duke caught the interest of rock/funk producer and guitarist KC Booker, who was looking to collaborate with some hip hop artists. Duke agreed to give rap one more try, and when Booker and Johnson recorded their first tracks -- a potent mix of authentic hip hop and hard, funky blues -- the chemistry was undeniable.\n\n\n\nBringing Dukes childhood buddy Chief into the mix as a hypeman was the final essential ingredient. Coupled with a live band and Chief's raw, kinetic energy onstage, the High Decibels shows proved to be high-energy, crowd-stirring affairs. Their genre-crossing musical style and a solid debut album has helped them earn outstanding critical reviews and a top 5 position on CMJ's Hip Hop Chart.","torrent":{"xt":"urn:btih:a5373f0c6c1728bca3124c1bf72de489baa41130","amp;dn":"The+High+Decibels+-+The+High+Decibels+%282008%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5373f0c6c1728bca3124c1bf72de489baa41130","infoHashBuffer":{"type":"Buffer","data":[165,55,63,12,108,23,40,188,163,18,76,27,247,45,228,137,186,164,17,48]},"announce":[],"urlList":[]}}