{"title":"Coast to Coast AM March 14 2013","uid":8267317,"size":56255841,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a66780778eeaa777d02445440d7a8da5123bc848&amp;dn=Coast+to+Coast+AM+March+14+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1363540195,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-14-13\nHost: \tGeorge Noory\nGuests: \tCraig Hulet, Stanton Friedman, Noe Torres\n\nAnalyst of geopolitics and foreign policy Craig B. Hulet discussed the use of drones in war zones, as well as potential drone strikes on U.S. citizens. He also addressed concerns about the government trying to curb gun rights, and other freedoms. One of the biggest problems with unmanned drones is that &quot;they are absolutely terrible at marksmanship. The collateral damage is always horrendous,&quot; he stated, explaining that typically 10-30 civilians are killed when going after a single al-Qaeda terrorist. The drones have no capability of having laser guided missiles or precision targeting, he continued. The US is not &quot;winning the war&quot; in Afghanistan, and has increasingly used drones because they can't sustain this level of warfare any longer, he added.\n\nObama has been secretive about how the drones are being used, and one of his administration's goals is to have 3,500 drone bases around the world, including domestic, Hulet said. Drones are already in the air in 11 major American cities, including Seattle, where protests against their use have taken place, he reported. Hulet described an incident in North Dakota where a drone was used to assist a SWAT team that came to arrest an armed man accused of stealing cattle. The explanation for the drone's presence was that it was there to secure the safety of the SWAT team.\n\nIn what he considers an erosion of citizens' rights and privacy, Air Force drones can now legally spy on you, TSA's &quot;mission creep&quot; is making the country a police state, California is using face recognition scanners to spy on people, and Obama's executive order expands Homeland Security into local law enforcement.\nUfology Update\n\nFirst hour guests, ufologists Stanton Friedman and Noe Torres talked about extraterrestrial visitation, and UFO disclosure. The discovery of many, many new exoplanets (within our galaxy alone there are 8 billion planets) opens up the real possibility that life is not unique to Earth, Friedman noted. Torres commented on the issue of UFO disclosure, and suggested that it may likely come from a country other than the US. Friedman added that he expects that more retired military personnel will come forward with what they know and have witnessed.\n\nNews guests: Capt. Kelly Sweeney, Scott Carter, Steve Kates 'Dr. Sky'\nWebsite(s):\n\n    craigbhulet.com\n    stantonfriedman.com\n    roswellbooks.com\n\nBook(s):\n\n    The Hydra of Carnage\n    Flying Saucers and Science\n    Aliens in the Forest: The Cisco Grove UFO Encounter\n\n","torrent":{"xt":"urn:btih:a66780778eeaa777d02445440d7a8da5123bc848","amp;dn":"Coast+to+Coast+AM+March+14+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a66780778eeaa777d02445440d7a8da5123bc848","infoHashBuffer":{"type":"Buffer","data":[166,103,128,119,142,234,167,119,208,36,69,68,13,122,141,165,18,59,200,72]},"announce":[],"urlList":[]}}