{"title":"Aim For the Sunrise - No Kings, No Chains","uid":7696186,"size":87791668,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a8b2fe06919946767d5b3c0f0af7bd7d12cfd1fc&amp;dn=Aim+For+the+Sunrise+-+No+Kings%2C+No+Chains&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1349367635,"description":"Band: Aim For the Sunrise\nAlbum: No Kings, No Chains\nDate: 12.10.01\nQuality: 320kbps VBR MP3\n\n\nABOUT AIM FOR THE SUNRISE\nSwedish metal five-piece Aim For The Sunrise started off in 2009 and has managed to establish themselves as one of the most prominent bands on the Swedish metal scene. The band has built a strong fan base in their native Sweden as they have toured with bands like Intohimo and Walking With Strangers.\n\nThe band has also played with internationally well-known bands such as The Chariot (US), Anberlin (US), Blindside (Swe), Adept (Swe), Iwrestledabearonce (US) and The Eyes Of A Traitor (UK). In 2010 and 2011 the band played at festivals such as Bring The Noise Festival, YEAH!, Strandfestivalen and Frizon Festivalen.\n\nThe song &quot;At least I live as I believe&quot; was featured on the Panic &amp; Action Records compilation cd &quot;Burn All The Small Towns II&quot;. In addition to that the bands EP &quot;The Bigger Picture: HOPE&quot; has received more than 400.000 plays on Spotify, and sold over 3000 songs on Itunes.\n\nThe band has just recorded their first album with the producer Dino Medanhodzic.The album will be released at the label Panic &amp; Action. The album scheduled for release in late September with a Sweden tour in early October.\n\nAlthough Aim For The Sunrise is a young band they appear as if performing music on stage is the only thing they know how to do. With an energetic live show there is no doubt that they will continue to win the hearts of every crowd they play for.","torrent":{"xt":"urn:btih:a8b2fe06919946767d5b3c0f0af7bd7d12cfd1fc","amp;dn":"Aim+For+the+Sunrise+-+No+Kings%2C+No+Chains","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8b2fe06919946767d5b3c0f0af7bd7d12cfd1fc","infoHashBuffer":{"type":"Buffer","data":[168,178,254,6,145,153,70,118,125,91,60,15,10,247,189,125,18,207,209,252]},"announce":[],"urlList":[]}}