{"title":"Intentional Interviewing and Counseling: Facilitating Client Dev","uid":8063802,"size":4520533,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a925629eb2eb1b27ad761dac00d02214e0cc622e&amp;dn=Intentional+Interviewing+and+Counseling%3A+Facilitating+Client+Dev&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xmangosaintx","files":1,"time":1359133219,"description":"AS FROM AMAZON:\n\nBook Description\nPublication Date: November 3, 2009 | ISBN-10: 0495601268 | ISBN-13: 978-0495601265 | Edition: 7\nThe popular and effective student CD-ROM has been updated to include a variety of learning activities and more than 30 interactive exercises. Each CD-ROM chapter includes most or all of the following: flashcards, interactive exercises, case study, video activity, weblink critique, quiz, Portfolio of Competence, client feedback form, and specific skills forms. Each feature is intended to improve students' learning and practice of the skills. Flashcards encourage rehearsal of key chapter concepts, short movie vignettes bring to life specific issues regarding the interview, and quizzes allow students to test their level of achievement. The CD-ROM helps students work through case studies, interactive exercises, and video activities, and puts all feedback forms, key training documents, and handouts right at the student's and instructor's fingertips. These updated forms are central for self-assessment and for skill practice and feedback. Students can access the Portfolio of Competence and use the reflections on personal style and the self-evaluation of chapter competencies checklist to develop a personalized portfolio that will prove invaluable in their journey to become effective helpers. Furthermore, students can e-mail their assignments directly from the CD-ROM to their instructors if requested. We have endeavored to provide choices for our readers by offering the book alone (ISBN 0-495-59974-3) or the book and CD-ROM prepack (ISBN 0-495-60123-3).\n\n","torrent":{"xt":"urn:btih:a925629eb2eb1b27ad761dac00d02214e0cc622e","amp;dn":"Intentional+Interviewing+and+Counseling%3A+Facilitating+Client+Dev","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a925629eb2eb1b27ad761dac00d02214e0cc622e","infoHashBuffer":{"type":"Buffer","data":[169,37,98,158,178,235,27,39,173,118,29,172,0,208,34,20,224,204,98,46]},"announce":[],"urlList":[]}}