{"title":"Beach Day - Trip Trap Attack (2013) [FLAC]","uid":8953395,"size":234636790,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a98ce782fb42de0c32b119616ef36ea51c4cefcc&amp;dn=Beach+Day+-+Trip+Trap+Attack+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1379945072,"description":"\n  Beach Day - Trip Trap Attack (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Garage, Noise Pop, Alternative\n  Source: CD (log)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Walking on the Streets\n  02 Boys \n  03 Beach Day\n  04 Stay\n  05 Seventeen\n  06 Trip Trap Attack\n  07 A Little Weird\n  08 Come Back to Me\n  09 Wasting All My Time\n  10 Am I the Only One\n  11 We've Gotta Go\n\n  Review\n\n  Beach Day is another in a long line of bands looking to dig up the bones of the girl groups of the early '60s and give them some new life. The list is too long to even get started on here, but let's just say many have tried and relatively few have succeeded. The Florida trio's first album, Trip Trap Attack, is a noble effort that gets them about 95 percent of the way to success. Subtract the dozy ballad that sucks up way too much oxygen and stops the album dead in its tracks, and a punchy little album full of super-hooky songs, pleasantly scuffed and simple musical backing, and Kimmy Drake's powerful vocals is left. It really takes off on the peppy rockers like &quot;Boys,&quot; &quot;A Little Weird,&quot; and the handclappy &quot;Beach Day,&quot; where the bandmembers bop and skip along happily, snapping their gum and daring the boys to keep up. \n\n  They also show a little versatility by giving Northern soul a shot and nailing it dead on &quot;Stay,&quot; trying out some bopping new wave melancholy on the very Josie Cotton-sounding track &quot;Am I the Only One,&quot; and showing some admirable depth and soul on midtempo tracks like &quot;Walking on the Streets&quot; and &quot;Wasting All My Time.&quot; Jim Diamond's reverby but clean production really helps these songs stick hard and the simple guitar-bass-drums lineup keeps things well grounded. Unfortunately, Beach Day aren't as good when they slow it way down on &quot;Seventeen,&quot; which lays the schmaltz on a bit too thick and gets perilously close to bar band territory. Things are much better on the album's other ballad, &quot;Come Back to Me,&quot; which is much less predictable and features some excellent guitar work by Drake. Apart from that one stumble, Trip Trap Attack is a really strong record that sounds made for the beach, but also for anytime you want a blast of nostalgia that's not too musty and has some modern kick.\n\n  Artist Bio\n\n  The Hollywood, Florida-based trio Beach Day was formed when Kimmy Drake (guitar/vocals), Natalie Smallish (bass/vocals), and Skyler Black (drums) met at a show they were playing with three different bands and decided to join forces and start their own thing. Their punky, surfy take on the classic girl group sound began getting some positive response and they signed with Kanine Records in the summer of 2012. The band released its debut single, &quot;Beach Day,&quot; in July of 2012, then followed it up with another single, &quot;Walking on the Streets,&quot; in November. Mixed by Jim Diamond (White Stripes, Dirtbombs), their debut album, Trip Trap Attack, was released in June of 2013.","torrent":{"xt":"urn:btih:a98ce782fb42de0c32b119616ef36ea51c4cefcc","amp;dn":"Beach+Day+-+Trip+Trap+Attack+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a98ce782fb42de0c32b119616ef36ea51c4cefcc","infoHashBuffer":{"type":"Buffer","data":[169,140,231,130,251,66,222,12,50,177,25,97,110,243,110,165,28,76,239,204]},"announce":[],"urlList":[]}}