{"title":"THIRTY The Manifesto, A Grassroots approach to Democracy","uid":8399930,"size":206568,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa38fb6f2b0395bb32b50797e02c955fb58a778c&amp;dn=THIRTY+The+Manifesto%2C+A+Grassroots+approach+to+Democracy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1366670141,"description":"Think-Thirty\n\nA Grassroots approach to Democracy. A manifesto for moving forward!\n\n\n  &lt;a href=&quot;\nhttps://thinkthirty.wordpress.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thinkthirty.wordpress.com/&lt;/a&gt;\n\n\n                                   THIRTY\n\nDemocracy is not inalienable right nor victory won. Though it might be enshrined on paper, embodied in institutions, democracyÎ“Ã‡Ã–s struggle is such that it is never done. Though many seek to define it in terms of liberties and rights, they mistake cause for effect, true democracy based not on rights but two singular responsibilities: participation and accountability.\n\nA citizen must participate not merely in name, but in action and deed. As such, they must remain informed not merely by the opinions of others, but by their own efforts. They must be willing to engage in discourse with those of common and opposing opinion alike. And they must resist apathy and paternalism: a sense that because others seek to govern and thus think of such matters in their stead, their own sense of responsibility for either is abated.\n\nThe illusion of democracy is not democracy. It may wear the same form and take an eerily similar shape but can be recognized in its deceit. As true democracy is set toward a common goal, false democracy is divorced from it. Its institutions built on apathy and laziness increasingly representing the good of the few at the expense of the many. The many placated by platitudes and crumbs, the very institutions they ensconced and enshrined, twisted and turned against them.\n\nBut there in lies the power of democracy, its recognition of truth: that power lies with the many, never the few; those that lead empowered by those that follow or not at all.\n\nAll power is given. Yet, in so much as we give power unto others they will seek to retain it. With Machiavellian machinations they will twist and corrupt the very institutions with which we have sought to constrain them. It is not a question of right or wrong. That one not so tempted be considered virtuous, and the other full of sin, is irrelevant. Often as not, such arguments belie the point that men are corruptible, whether circumstance sees fit to corrupt them or not.\n\nThus, one must seek to strengthen the foundations upon which our democracy is based. Not in infinitely corruptible institutions or sacred papers perverted by endless reinterpretation of seemingly incontrovertible rules. True change may only come from a rethinking of that foundation upon which our democracy is based: the representation of the many by the so very few.\n\nWhile this appears a consequence of geography and size I would argue it is more a consequence of design. That the institutions we recognize, that now exist, are based on anachronistic constraints from founding fathers, founding freedoms, of bygone times. And despite a sense of growth and change, in essence, those foundations remain as ever the same.\n\nIt is these foundations that must be addressed. Not in terms of ideology and ideals, but in their raw structure; the basic mechanics. Our actions are defined as much by the tools we use as the ideas that underlie them. Thus, I would propose a reinvention of a tool. The tool that defines our democracy: one man, one vote.\t\t\n","torrent":{"xt":"urn:btih:aa38fb6f2b0395bb32b50797e02c955fb58a778c","amp;dn":"THIRTY+The+Manifesto%2C+A+Grassroots+approach+to+Democracy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa38fb6f2b0395bb32b50797e02c955fb58a778c","infoHashBuffer":{"type":"Buffer","data":[170,56,251,111,43,3,149,187,50,181,7,151,224,44,149,95,181,138,119,140]},"announce":[],"urlList":[]}}