{"title":"Thieves and Kings V1-V4 Issues 01-36","uid":7811377,"size":380057561,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:aa984451f0926709d2f742518ac9618b27be89fa&amp;dn=Thieves+and+Kings+V1-V4+Issues+01-36&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1352542798,"description":"This torrent contains the first four TPB collections published by I Box. They are officially known as the 'Red Book', 'Green Book', 'Blue Book' and 'Shadow Book' respectively. I'm one issue - or on TPB, I suppose - away from completing V5, the 'Winter Book'. Shortly thereafter Oakley ended the publication of new individual issues. Volume 6, 'Apprentices, Book 1' was released as a 104 page TPB, the new format for the series going forward. \n\n\n'Thieves &amp; Kings' V1-V4 Issues 01-36, approx 840 pages\n\nI Box Publishing (self-published), 1994-2006 (and is officially still ongoing)\n\nWritten, Illustrated and Published by Mark Oakley\n\n\nThis is the story of Rubel, sworn thief to the beautiful princess Katara of Asaria, who must make his way through the politics and power struggles of the city of Highborn in the land of Oceansend amongst soldiers, pirates, kings, and magicians; all while avoiding Soracia, the Shadow Lady and Queen of Halves, an immortal sorceress who seeks to capture his soul. Joined by Quinton, an ancient wizard, and his young girl apprentice, Heath Wingwhit, Rubel must chart a path through demon traps, poisonings, dragon dreams, the plots of mad princes, evil sorceresses, trolls, and monsters of every ilk, all while trying to restore the princess to her rightful throne.\n\nThieves &amp; Kings is a Canadian comic book series written, penciled and published independently by Mark Oakley. The first issue was published in September 1994, with the creator planning on publishing a complete saga comprising 100 issues and about 2000 pages. The series is available as individual comic issues and in trade paperback form.\n\nThieves &amp; Kings is distinct from most other comics in that the creator makes extensive use of illustrated story pages in addition to the traditional sequential art found in most comics.","torrent":{"xt":"urn:btih:aa984451f0926709d2f742518ac9618b27be89fa","amp;dn":"Thieves+and+Kings+V1-V4+Issues+01-36","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa984451f0926709d2f742518ac9618b27be89fa","infoHashBuffer":{"type":"Buffer","data":[170,152,68,81,240,146,103,9,210,247,66,81,138,201,97,139,39,190,137,250]},"announce":[],"urlList":[]}}