{"title":"AfroCuban AllStars &amp; Felix Baloy - Baila Mi Son 2000 TQMP","uid":4587317,"size":337570334,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ab007bd116bd7dedb034d65aaa9240c1053cfcbf&amp;dn=AfroCuban+AllStars+%26+Felix+Baloy+-+Baila+Mi+Son+2000+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Breezin","files":17,"time":1229683404,"description":"Quotes from amazon:\n\n&quot;Those already familiar with the Buena Vista Social Club (&quot;BVSC&quot;) already have an idea of what to expect with this one. Those who are familiar with the Afro-Cuban Allstars have an even BETTER idea of what to expect. Felix Baloy teamed up with the Afro-Cuban Allstars on their releases and laid down some brilliant vocals. Here, he takes on a more &quot;solo&quot; effort. Really though, it's the Afro-Cuban Allstars (and the incredible Juan De Marcos Gonzalez) backing him up. Those who know, Afro-Cuban Allstars are a more up-tempo, jazzier take on what the BVSC is doing. The songs are much more dancier, salsa oriented. The mellow stuff is best found on the BVSC release, or any of the solo efforts by members of the BVSC (i.e., Ibrahim Ferrer, Compay Segundo, Ruben Gonzalez, Omara Portuondo, etc.). This stuff is for dancing and getting the fiesta started. If you aren't familiar with the BVSC or Afro-Cuban Allstars, but ARE familiar with anything in the &quot;Cubanismo&quot; series, you can compare this release to that kind of stuff. However, in my humble opinion, this (and every other BVSC or Afro-Cuban Allstars release) is MUCH, MUCH better than the Cubanismo series. And, I will admit, that is saying a great deal because the Cubanismo series isn't bad at all. In short, get this, get this, get this! It's much harder to come by than any of the other releases I mentioned, but it is sooooooo very worth having. A must in your collection!&quot;\n\n&quot;I cannot say enough in praise of Juan de Marcos GonzÃƒÂ¡lez, for it was HE who brought together the Buena Vista Social Club project and made it happen. GonzÃƒÂ¡lez has a unique talent for bringing together the greatest musicians and singers available, then orchestrating the most outstanding Cuban music so as to present it in a way that is sure to delight music lovers everywhere. Fans of Afro Cuban music will find none better. His Afro Cuban All Stars are a somewhat fluid ensemble that has featured such Cuban greats as Teresa Garcia Caturla, Ibrahim Ferrer, RubÃƒÂ©n GonzÃƒÂ¡lez, Amadito Valdez, &quot;Cachaito&quot; LÃƒÂ³pez, Barbarito Torres, and &quot;Guajiro&quot; Mirabal, among others.&quot;\n\n&quot;This was my second Cuban album after Buena Vista Social Club. However these tracks are far more dance-able than BVSC: everything from Cha Cha Cha to Meringue and Salsa.\nFor those who know the music of Felix Baloy - this is another &quot;feel-good&quot; album - brilliant for getting you in the mood for an evening of going out, or for getting you up in the morning.&quot;\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;680a1a0d0d1201062804011e0d460604&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:ab007bd116bd7dedb034d65aaa9240c1053cfcbf","amp;dn":"AfroCuban+AllStars+%26+Felix+Baloy+-+Baila+Mi+Son+2000+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab007bd116bd7dedb034d65aaa9240c1053cfcbf","infoHashBuffer":{"type":"Buffer","data":[171,0,123,209,22,189,125,237,176,52,214,90,170,146,64,193,5,60,252,191]},"announce":[],"urlList":[]}}