{"title":"BBC Pilgrimage with Simon Reeve 3of3 720p x264 AAC HDTV ","uid":9368629,"size":1650645583,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ab50f42513bf9c16fa478590f481bb1bd683fe76&amp;dn=BBC+Pilgrimage+with+Simon+Reeve+3of3+720p+x264+AAC+HDTV+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":-1,"time":1387479387,"description":"Pilgrimage (BBC)\n\nTravel Documentary hosted by Simon Reeve, published by BBC in 2013 - English narration\n\n\nInformation\n------------------------------\n\nFor centuries pilgrimage was one of the greatest adventures on earth, involving epic journeys across the country and around the world. This series sees Simon Reeve retrace the exciting adventures of our ancestors. He learns about the forgotten aspects of pilgrimage, including the vice, thrills and dangers that all awaited travellers. He explores the faith, the hopes, desires, and even the food that helped to keep medieval Britons and more recent travellers on the road.\n\n\n1)  Holy Island to Canterbury \nSimon embarks on a 400 mile journey to Canterbury from the north of England, beginning at the mystical Holy Island, just off the rugged coast of Northumberland. To reach the island, one of the earliest sites of Christian pilgrimage in Britain, Simon follows a line of posts marking out a crossing that emerges from the North Sea at low tide.\nMedieval Britons believed that journeys of endurance, suffering and sacrifice to a holy site would help them find a place in heaven. Now more than half a million visitors make the crossing every year, mostly by car, to enjoy both the rich history of the island and magnificent wilderness.\nTravelling further south through England, Simon gets to try medieval food; marvels at the beauty and majesty of Lincoln Cathedral, once the tallest building on the planet; and joins thousands on an annual pilgrimage at a remote village in Norfolk.\nSimon discovers the inspiration behind pilgrimage has not always been religious devotion and piety. Pilgrimage was often a chance for long-suffering peasants to get away from a life of drudgery and explore their land. Many were attracted to the road by the opportunity for adventure and an excuse to do a little sinning away from home.\nSimon visits the area of London where brothels paid rent to the Bishop of Winchester while tempting passing pilgrims. He learns more about exquisite medieval travel souvenirs that have been discovered in the muddy banks of the Thames.\nHeading out of the capital, Simon meets a group of Chaucer enthusiasts who walk the pilgrimage route made famous by the Canterbury Tales, and gets to play the part of a lovelorn Prince during a retelling of a Chaucerian tale.\nSimon also meets a pilgrim who has carried a heavy life-size cross thousands of miles, and gets to see the 700-year-old cranium of a monk while staying at an ancient monastery.\nThe draw of relics for pilgrims was immense before Henry VIII's Reformation, when the golden age of pilgrim was abruptly ended. Until then Britain's ultimate medieval pilgrimage destination was the site where Thomas Becket was murdered: Canterbury.\n\n2)  France to Italy \nSimon Reeve follows in the footsteps of thousands of travellers from previous centuries, as he travels from northern France to northern Spain, and then crosses western Europe to arrive in Rome.\nIn the Middle Ages, pilgrimage shaped much of Europe, as inns and churches sprung up along routes and villages near popular shrines developed into towns. To see how this is still happening, Simon visits a route that has come back to life. The Camino is a 500-mile trek not for the faint hearted, starting in a bustling French town before it climbs over the Pyrenees and winds through northern Spain to Santiago de Compostela. Along the way, he visits a church with a bizarre display of live chickens, experiences the kindness of volunteers who run hostels and meets pilgrims from around the world who are walking for a variety of reasons. At the end of the route, he joins the crowds at the pilgrims' mass as one of the biggest incense burners in the world swings over his head.\nIn Switzerland, Simon undertakes one of the oldest and most perilous pilgrim routes in Europe. The Great St Bernard Pass, high in the Alps, has claimed many lives over the centuries, including at least one Pope. Simon treks to a monastery and refuge at the top of the pass that has not closed its doors to visitors for 1000 years. He meets some young Americans there and joins in their yoga class, hears their stories, and helps them to clean the monastery.\nTo see how modern pilgrimage melds into tourism, Simon goes to the shrine devoted to the monk Padre Pio who died in 1968 in San Giovanni Rotondo in the east of Italy. Padre Pio's fame spread globally and the economic impact on the town has been huge. Simon sees the gaudy shrine made from melted down gold jewellery donated by pilgrims, meets the monk who runs the Padre Pio TV station, and discovers that many modern pilgrims rather like staying in fancy hotels.\nFinally, Simon arrives in Rome and St Peter's Square when pilgrims gather in their thousands to be blessed by the Pope. He reflects on his realisation that for those who follow a pilgrim's path, it is more about what they discover on the way than reaching journeys end.\n\n3)  Istanbul to Holy Land \nSimon Reeve follows in the footsteps of travellers who made long, arduous and dangerous journeys to reach Jerusalem.\nHe begins in Istanbul, Turkey, a busy medieval staging post for pilgrims to the Holy Land. Before falling to the Ottoman empire, it was the centre of Roman Christianity under Emperor Constantine. His mother Helena, arguably the first pilgrim to the Holy Land, brought back relics from Jerusalem to fill the city's churches, which made it a major destination for pilgrimage in its own right for centuries to come. Simon visits the magnificent Hagia Sophia and a traditional Turkish bath, discovering that pilgrims brought public bathing back with them to Europe, showing how pilgrimage spread practical ideas as well as religious ones.\nSimon travels on to the Holy Land, following in the footsteps of Victorian travellers who used the definitive guide book of the period, published in 1876 by Thomas Cook, whose grand excursions to the Holy Land pioneered the modern package holiday.\nHe drives into the West Bank and on to Bethlehem. Despite not being religious, he is moved to tears by the memory of family Christmases when he sees the spot where Christ is said to have been born inside the Church of the Nativity. He then visits the isolated 6th century monastery of Mar Saba, a place few outsiders are permitted to enter today. Simon camps in the desert and goes fishing in the Sea of Galilee. He also meets David, a reformed drug addict who lives in a village inside the ancient town of Nazareth where people dress, live and work as if they are characters from the Bible.\nIn Jerusalem, Simon meets a doctor who treats visitors who become so overwhelmed that they become convinced they personally are the Messiah. Several million people a year from all three major religions come to visit or worship in one of the most highly-contested square miles on the planet. Simon visits the Israeli CCTV command centre where everyone is kept under constant surveillance.\nFinally, Simon joins in the ancient ritual of walking the Via Dolorosa, the route taken by Jesus as he carried his cross to the site of his crucifixion, ending at the Church of the Holy Sepulchre. At journey's end, he reflects on what pilgrimage can offer for a non-believer, bringing a sense of achievement and a chance to learn more about the history and culture that shapes our lives to this day.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img811.imageshack.us/img811/9356/0cfa.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img811.imageshack.us/img811/9356/0cfa.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img22.imageshack.us/img22/6586/9t3k.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img22.imageshack.us/img22/6586/9t3k.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img191.imageshack.us/img191/2016/cema.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img191.imageshack.us/img191/2016/cema.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img811.imageshack.us/img811/7301/q56b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img811.imageshack.us/img811/7301/q56b.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img823.imageshack.us/img823/2725/tsx8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img823.imageshack.us/img823/2725/tsx8.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img201.imageshack.us/img201/3444/2anx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img201.imageshack.us/img201/3444/2anx.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img17.imageshack.us/img17/614/om2t.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img17.imageshack.us/img17/614/om2t.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img201.imageshack.us/img201/3229/hxco.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img201.imageshack.us/img201/3229/hxco.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img34.imageshack.us/img34/3854/kjmr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img34.imageshack.us/img34/3854/kjmr.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;5018393738101c647e61&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: CRF 19 (~3315Kbps)\n * Video Resolution: 1280x720\n * Video Aspect Ratio: 16:9\n * Frame Rate: 25 FPS\n * Audio Codec: AAC-LC\n * Audio Bitrate: Q=0.42 (~132Kbps) VBR 48KHz\n * Audio Channels: 2\n * Run-Time: 59 mins\n * Number of Parts: 3\n * Part Size: 1.45 GB (average)\n * Source: HDTV\n * Encoded by: JungleBoy\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/p01kqjg3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/p01kqjg3&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Still%20Ringing%20After%20All%20These%20Years&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Still%20Ringing%20After%20All%20These%20Years&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Come%20Bell%20Ringing&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Come%20Bell%20Ringing&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20City%20of%20Culture&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20City%20of%20Culture&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Archbishop%20of%20Canterbury%27s%20New%20Year%20Message&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Archbishop%20of%20Canterbury%27s%20New%20Year%20Message&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Goodbye%20to%20Canterbury&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Goodbye%20to%20Canterbury&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=How%20to%20Build%20a%20Cathedral&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=How%20to%20Build%20a%20Cathedral&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Bibles%20Buried%20Secrets&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Bibles%20Buried%20Secrets&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Italy%20Unpacked&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Italy%20Unpacked&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Churches%20-%20How%20to%20Read%20Them&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Churches%20-%20How%20to%20Read%20Them&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Vatican%20-%20The%20Hidden%20World&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Vatican%20-%20The%20Hidden%20World&lt;/a&gt;\n\n3)  ed2k Links \n\n\nor\n\n\n\n\nAdded by &lt;a href=&quot;\nhttp://docuwiki.net/?title=User%3AJungleBoy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=User%3AJungleBoy&lt;/a&gt;\n\nSource: &lt;a href=&quot;\nhttp://docuwiki.net/index.php?title=Pilgrimage_(BBC)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/index.php?title=Pilgrimage_(BBC)&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ab50f42513bf9c16fa478590f481bb1bd683fe76","amp;dn":"BBC+Pilgrimage+with+Simon+Reeve+3of3+720p+x264+AAC+HDTV+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab50f42513bf9c16fa478590f481bb1bd683fe76","infoHashBuffer":{"type":"Buffer","data":[171,80,244,37,19,191,156,22,250,71,133,144,244,129,187,27,214,131,254,118]},"announce":[],"urlList":[]}}