{"title":"HandsOnHardcore - Christen Courtney (Cant Turn Down This Offer","uid":12539958,"size":322960677,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ac08b2db467d47eeab9470f3239cd581164d5afb&amp;dn=HandsOnHardcore+-+Christen+Courtney+%28Cant+Turn+Down+This+Offer&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1444385806,"description":"Christen Courtney aka Christen is a blonde teenager from Hungary. Sheâ™s got green eyes, natural tits and a wonderful smile. Well, this sounds like the beginning of a lovely story about an innocent girl but Christenâ™s a sly old dog, dirty, horny as fuck and damn sexy! In todayâ™s lusty episode of our DDF Network Hands on Hardcore series, Christen has an appointment with her lawyer. First of all she poses in front of our DSLR cams and lets us catch a glimpse of her curvy butt cheeks while she gets dressed in her bathroom.Christen enters the lawyerâ™s apartment and tries to seduce him with her hot looks. Choky Ice gets an instant boner the second he sees his gorgeous new client. Christen grabs his boner while he touches her vagina, then she lies back and spreads her long legs to feed him her trimmed pussy. He enjoys licking her twat and inserts his nasty fingers into her fuckhole. She returns the favor by blowing his hard cock.After he plays with her tits and sucks her nipples, she rides him like a cowgirl before shifting into doggy style position, so he can cram her tight quim with his long hard rod. Choky prepares her tight asshole with his thumb before fucking the blonde teen in the ass. He then bangs her spoon style and finally shoots his cum on her pussy lips. Christen rubs that white jizz all over her hole. Sheâ™s glad, he couldnâ™t turn down her offer!\r\nTags: Anal, Blonde, Cum on pussy, Fingering, Hardcore, High Heels, Lingerie, Blowjob\r\n \nhttp://imgdone.com/viewer.php?file=35928760620869559226.jpg\r\n \nhttp://imgdone.com/viewer.php?file=53464100455600904551.jpg","torrent":{"xt":"urn:btih:ac08b2db467d47eeab9470f3239cd581164d5afb","amp;dn":"HandsOnHardcore+-+Christen+Courtney+%28Cant+Turn+Down+This+Offer","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac08b2db467d47eeab9470f3239cd581164d5afb","infoHashBuffer":{"type":"Buffer","data":[172,8,178,219,70,125,71,238,171,148,112,243,35,156,213,129,22,77,90,251]},"announce":[],"urlList":[]}}