{"title":"Thom Brennan - Mist [new-age]","uid":3441208,"size":99921836,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ac69d4cae60c32d7513694262332669a7145427c&amp;dn=Thom+Brennan+-+Mist+%5Bnew-age%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tryandthenbuy","files":6,"time":1139291895,"description":"Artist     : Thom Brennan\nAlbum      : Mist\nSource     : CD\nYear       : 2000\nGenre      : New Age\nLabel      : Raingarden Music\n\nCodec      : Lame 3.89 \nQuality    : CBR, 224kbps, stereo\n\nID3-Tag    : Yes, Version 1 &amp; 2.3\n\nPosted By  :   on 10-08-2005\n\n\nIncluded   : This Info-File (NFO)\n\nTracklisting\n------------\n01 - Raingardens\n02 - Pond Life\n03 - Cedars Stand Against the Rain\n04 - Mist\n\nPlaying Time : 59:26\nTotal Size   : 95.2 MB\n\n\nThom Brennan - Synthesist, Sound Design, Programming and Production\n\n\nPure drifting, ambient, synthesised music with not even the suggestion of a rhythm. The four tracks here are soft, delicate pieces twinkling and meandering - ever shifting. Gentle, glistening chimes and bells enhance long, flowing, densely layered waves and drones of sound. If you listen carefully sounds from nature are present, so carefully placed as to feel almost incidental.\n\nInspired by the rainforest valleys on the coastal west side of the Olympic National Park with its peaks reaching 12 000 feet; Mist is like a sonic haze hanging in the air, serene and beautiful. The mood is relaxing and uplifting. The constantly evolving tonal shadows and resonating veils never suppress the light - rather they filter and refract it into various alluring forms. Not dark then, but not bright sunshine either - moist, open, alive with possibilities as inconstant as the weather.\n\nMist is the first release from Thom Brennan for around five years and there is a marked change in approach from previous material. Most of the melodies and sequencer patterns are gone in favour of a more minimal method. The four pieces here are all shaped from a single fluid fabric - sumptuously layered synthetic drones, echoing chimes and the sense of a comfortable, endless ebb and flow. The atmosphere is rich and dense; tracks unfold one into the other with subtle grace. Thom says of the location that inspired the music: &quot;Unlike tropical rainforests, these are dense habitats of moss, ferns, and 500 year old Cedar evergreens. For much of the year, it is under a constant drizzle. It is a place of incredible bio-density, and one can feel the presence of life.&quot; \n\n","torrent":{"xt":"urn:btih:ac69d4cae60c32d7513694262332669a7145427c","amp;dn":"Thom+Brennan+-+Mist+%5Bnew-age%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac69d4cae60c32d7513694262332669a7145427c","infoHashBuffer":{"type":"Buffer","data":[172,105,212,202,230,12,50,215,81,54,148,38,35,50,102,154,113,69,66,124]},"announce":[],"urlList":[]}}