{"title":"powr.broccoli-kopimi","uid":4741944,"size":35516295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad91f7e4815122f38412092a08f8c821819c2e26&amp;dn=powr.broccoli-kopimi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mk_","files":20,"time":1235599755,"description":"\nIn the shadow of the culture industry's final crisis of the 20th-\ncentury, grows a larger portrait of the POwr, broccoli and Kopimi.\nEach step of the culture industry's failures is followed by the\nuncanny successes of the structurally diffused spread of an Internet\nelite, spread worldwide. The book you're about to read has no author,\nno designer, no translators, no distribution channel. Nevertheless,\nyou have it in front of you. How did it happen?\n\nRead the frightening instructions of a loosely coherent core of\nIT specialists grafted into an unsuspecting generation of youths,\nand how the group stole the eggs, dollars and jpegs in front of\nthe powerless establishment and strong financial interests. Learn\nhow servers, seeders, trackers, e-mail, company formation, foreign\ninvestors, Ikko's weekly allowance, scandalous advertisements,\nlinks and search services, infiltrated and destroyed an entire\nworld that had nowhere to run, no one to consult, and no one to\ntrust...\n\nThe machine, which operates under the radar frequency is\nunhindered from the Cambodian jungle to the gay neighborhoods\nof San Francisco, via the empty beaches of Tel-Aviv, and into\nthe Internet of plain folks in JÃƒÂ¶nkÃƒÂ¶ping suburbs and Gothenburg\nharbor. It leaves no one unmoved and mangles everything it in\nits path. Technically superior and physically independent it's\nconstantly transformed, mutated and reappears in new guises and\nunder new codenames. With a stranglehold on its opponents it's\ncompletely untouched and even more - incomprehensible.\n\nIt has rightly been said that this is the first time Kopimi\nhas freed the world and we can be sure that it's not the last.\n\n\n(Releasenotes: Download, share, translate, remix, bend, modify,\ncopy, trash, bash, move, publish, burn, hide, remake, plz KOPIMI!)","torrent":{"xt":"urn:btih:ad91f7e4815122f38412092a08f8c821819c2e26","amp;dn":"powr.broccoli-kopimi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad91f7e4815122f38412092a08f8c821819c2e26","infoHashBuffer":{"type":"Buffer","data":[173,145,247,228,129,81,34,243,132,18,9,42,8,248,200,33,129,156,46,38]},"announce":[],"urlList":[]}}