{"title":"Democracy Now - 01 dec 2011","uid":6857530,"size":456341312,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ae20e39db4ed292646b438845fb07b4690324b3f&amp;dn=Democracy+Now+-+01+dec+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1322755931,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 01, 2011\n\n-  Clinton Meets With Military Junta in Burma\n-  18 Killed in Iraq Violence; Iraq PM Open to U.S. &quot;Trainers&quot;\n-  No U.S. Apology for Deadly Pakistan Attack\n-  Britain Cuts Iran Ties; E.U. Mulls New Sanctions\n-  Central Banks Unveil New Lending Rules\n-  Environmental Groups, E.U. Criticize U.S. Stance at Climate Summit\n-  350 Arrested in Occupy Raids\n-  Bloomberg: NYPD is &quot;My Own Army&quot;\n-  Arizona Protesters Pepper-Sprayed, Arrested at ALEC Meeting\n-  Cain Vows to Remain in GOP Race\n-  Whistleblower: Canadian Police Could Have Arrested Serial Killer of Women 3 Three Years Earlier\n-  Former Salt Lake City Mayor Rocky Anderson Unveils Presidential Bid\n\n\nSpecial reports\n\n- Egypt's Muslim Brotherhood Takes Early Lead in First Post-Mubarak Elections\n\nEarly results from Egypt's first post-revolutionary elections indicate the Muslim Brotherhood's Freedom and Justice party will emerge as the biggest winner. We speak with Democracy Now! special correspondent Anjali Kamat who has just returned to the United States after reporting in Cairo since the fall of former president Honsi Mubarak. Anjali describes how Egypt's elections take place against the backdrop of economic insecurity, and renewed street clashes between pro-democracy demonstrators and security forces that have left more than 40 dead and thousands injured. She also discusses Egypt's use of U.S.-supplied tear gas to quell massive demonstrations, and a photo she took of police dragging protesters injured by rubber bullets and live ammunition, then leaving them in piles of garbage.\n\n\n- Democracy Now! Correspondent Anjali Kamat on Reporting the Revolutions in Egypt and Libya\n\nDemocracy Now! special correspondent Anjali Kamat has just returned from Cairo after nearly a year reporting on the revolutions in Egypt and Libya. Anjali was on the ground in Cairo covering the uprising that overthrew Hosni Mubarak and the ensuing crackdowns on protesters opposed to military rule. Kamat also made two trips to Libya to cover the uprising and ultimate overthrow, with the aid of NATO forces, of the Gaddafi regime. &quot;One of the things that was really remarkable over the past year that I saw in both Egypt and Libya is the fearlessness of people,&quot; Kamat says. &quot;I was really taken aback by the scenes of crowds of people running into armed tanks, running into vehicles that [opened] opening fire - people just without any fear.&quot; Kamat also addresses an issue that has divided many progressive critics of Western militarism: The reality that the NATO intervention in Libya, despite charges of hypocrisy and ulterior motives, enjoyed widespread amongst Libyans seeking to topple the hated Gaddafi regime.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ae20e39db4ed292646b438845fb07b4690324b3f","amp;dn":"Democracy+Now+-+01+dec+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae20e39db4ed292646b438845fb07b4690324b3f","infoHashBuffer":{"type":"Buffer","data":[174,32,227,157,180,237,41,38,70,180,56,132,95,176,123,70,144,50,75,63]},"announce":[],"urlList":[]}}