{"title":"Keys to the Kingdom","uid":8018994,"size":6055184,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae56a223ce86e932c36071ed6fafca9e9e23274a&amp;dn=Keys+to+the+Kingdom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"d347hBy73","files":-1,"time":1358164220,"description":"Keys to the Kingdom: Impressioning, Privilege Escalation, Bumping, and Other Key-Based Attacks Against Physical Locks\n\n\nPublication Date: October 8, 2012  \nISBN-10: 1597499838 | ISBN-13: 978-1597499835 | Edition: 1\nFormat: EPUB\n\nLockpicking has become a popular topic with many in the security community. While many have chosen to learn the fine art of opening locks without keys, few people explore the fascinating methods of attack that are possible WITH keys. Keys to the Kingdom addresses the topics of impressioning, master key escalation, skeleton keys, and bumping attacks that go well beyond any treatment of these topics in the authors previous book, Practical Lock Picking.\n\nThis material is all new and focuses on locks currently in use as well as ones that have recently emerged on the market. Hackers and pen testers or persons tasked with defending their infrastructure and property from invasion will find these techniques uniquely valuable. As with Deviant Ollams previous book, Practical Lock Picking,  Keys to the Kingdom includes full-color versions of all diagrams and photographs. Check out the companion website which includes instructional videos that provide readers with a full-on training seminar from the author.\n\n\n\nExcellent companion to Deviant Ollams Practical Lock Picking.\nUnderstand the typical failings of common security hardware in order to avoid these weaknesses.\nLearn advanced methods of physical attack in order to be more successful with penetration testing.\nDetailed full-color photos in the book make learning easy, and companion website is filled with invalualble training videos from Dev!\n\n\n\n","torrent":{"xt":"urn:btih:ae56a223ce86e932c36071ed6fafca9e9e23274a","amp;dn":"Keys+to+the+Kingdom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae56a223ce86e932c36071ed6fafca9e9e23274a","infoHashBuffer":{"type":"Buffer","data":[174,86,162,35,206,134,233,50,195,96,113,237,111,175,202,158,158,35,39,74]},"announce":[],"urlList":[]}}