{"title":"Antelman-To Eliminate Opiate 1(who destroys Jews)","uid":4533049,"size":1063888,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b21d6d304dc1a55e189d5ab3bef6d34246631ea8&amp;dn=Antelman-To+Eliminate+Opiate+1%28who+destroys+Jews%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227632203,"description":"This is Marvin S. Antelman&amp;#039;s mindblowing book To Eliminate the Opiate 1 - An In-depth Study of Communist and Conspiratorial Group Efforts to Destroy Jews and Judaism (2004) which presents the history behind the various schisms in Judaism, when they happened, for what reason and by whom. It is highly likely that when an everyday and even the well versed Jew reads these volumes they will begin to ask themselves if all of the things mentioned in this book are true or simply a fantasy of the author. Together with volume 2, Rabbi Antelman assembled so so much unknown information that one may ask how its possible that a single individual could have retrieved all this. The reason why they will ask this is due to their faith&amp;#039;s obvious schism which now honors all the abominations and digressions that their religion and their Bible deem as &quot;evil&quot;, &quot;immoral&quot; or pure corruptions. In this amazing book read all about: Adam Weishaupt, the Jesuit priest who founded the Illuminati on May Day 1776, from which the Communist Party emerged; How Weishaupt&amp;#039;s Illuminati and Frank&amp;#039;s Frankists worked hand in hand to destroy religions and governments; The connection between the Frankists, Illuminati, Jacobins and the French Revolution that changed society; Why Jewish-born Karl Marx was an anti-Semite and wrote A World Without Jews; The 18th Century roots of the Women&amp;#039;s Liberation movement; How the Illuminati founded artificial Judaism; How Judaism was labeled Orthodox in order to destroy it; The plot to destroy the Torah through the field of Biblical criticism; Why the wealthy financed Communist revolutions; The true sources for the Frankenstein Monster; The significance of mystical designs on the American dollar bill and much more. To Eliminate the Opiate is simply a tour-de-force of untold Jewish history and a very good book for both Jews and non-Jews alike to truly understand Jews, Judaism and the various anti-Semitic claims that the ignorant place over these people. 170 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:b21d6d304dc1a55e189d5ab3bef6d34246631ea8","amp;dn":"Antelman-To+Eliminate+Opiate+1%28who+destroys+Jews%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b21d6d304dc1a55e189d5ab3bef6d34246631ea8","infoHashBuffer":{"type":"Buffer","data":[178,29,109,48,77,193,165,94,24,157,90,179,190,246,211,66,70,99,30,168]},"announce":[],"urlList":[]}}