{"title":"Charlie Huston - Sleepless (Retail)","uid":10352433,"size":2124868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2447ebcbc88b37f118acc92ec5aebf7b4b54ffc&amp;dn=Charlie+Huston+-+Sleepless+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheRose88","files":1,"time":1402688324,"description":"Charlie Huston - Sleepless - Retail (epub)\n\n\nWhat former philosophy student Parker Hass wanted was a better world. A world both just and safe for his wife and infant daughter. So he joined the LAPD and tried to make it that way. But the world changed. Struck by waves of chaos carried in on a tide of insomnia. A plague of sleeplessness.\n\nPark can sleep, but he is wide awake. And as much as he wishes he was dreaming, his eyes are open. He has no choice but to see it all. That's his job. Working undercover as a drug dealer in a Los Angeles ruled in equal parts by martial law and insurgency, he's tasked with cutting off illegal trade in Dreamer, the only drug that can give the infected what they most crave: sleep.\n\nAfter a year of lost leads and false trails, Park stumbles into the perilous shadows cast by the pharmaceuticals giant behind Dreamer. Somewhere in those shadows, at the nexus of disease and drugs and money, a secret is hiding. Drawn into the inner circle of a tech guru with a warped agenda and a special use for the sleepless themselves, Park thinks he knows what that secret might be.\n\nTo know for certain, he will have to go deeper into the restless world. His wife has become sleepless, and their daughter may soon share the same fate. For them, he will risk what they need most from him: his belief that justice \nmust be served. Unknown to him, his choice ties all of their futures to the singularly deadly nature of an aging mercenary who stalks Park.\n\nThe deeper Park stumbles through the dark, the more he is convinced that it is obscuring the real world. Bring enough light and the shadows will retreat. Bring enough light and everyone will see themselves again. Bring enough light and he will find his way to the safe corner, the harbor he's promised his family. Whatever the cost to himself.\n\nIt is July 2010.\n\nThe future is coming.\n\nOpen your eyes.","torrent":{"xt":"urn:btih:b2447ebcbc88b37f118acc92ec5aebf7b4b54ffc","amp;dn":"Charlie+Huston+-+Sleepless+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2447ebcbc88b37f118acc92ec5aebf7b4b54ffc","infoHashBuffer":{"type":"Buffer","data":[178,68,126,188,188,136,179,127,17,138,204,146,236,90,235,247,180,181,79,252]},"announce":[],"urlList":[]}}