{"title":"Janine Wilson - 2000 - The Blue Album FLAC","uid":8869937,"size":341366939,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b2abd959685f0f1dba48e6337afe8e45d3d78c63&amp;dn=Janine+Wilson+-+2000+-+The+Blue+Album+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1378034285,"description":"Janine Wilson - 2000 - The Blue Album\n\nToday's music industry is flooded with artists trying to make it big. With all these choices it's difficult to find that one performer who makes you stop and notice. But listen long enough and you can find a special release that stands alone. Such is the case with The Blue Album, the long awaited release by blues vocalist Janine Wilson.\nHer name may not be familiar to you yet, but Janine Wilson has been delighting blues audiences in the Washington, DC, and surrounding areas for almost a decade. The Blue Album treats listeners to an assortment of Janine's favorite songs, including her powerful rendition of &quot;Breaking Up Somebody's Home&quot; and her heartfelt version of &quot;And I Cried&quot;, a song penned by Saffire's Gaye Adegbalola. And this disc is not short on surprises. Check out Janine's version of Elvis Costello's &quot;Almost Blue&quot; and her soulful performance on &quot;Make No Mistake&quot; by Keith Richards. Each carefully chosen song showcases Wilson's versatility - from seductively sweet to impassioned and fiery.\nRecorded predominantly in Austin, Texas, the personnel on The Blue Album reads like a Who's Who of the Austin music scene. Janine recruited the talents of Don McCalister to record and co-produce, as well as perform on the disc. Mixing and additional recording were done with multiple Washington Area Music Award winner, Marco Delmar at Recording Arts in Fairfax, Virginia. Joining Janine and Don are Jesse &quot;Guitar&quot; Taylor of Joe Ely fame on lead guitar, Charlie Larkey (Carole King and The Fugs) on bass, Ernie Durawa (Texas Tornadoes, Delbert McClinton, Willie Nelson) on drums, Floyd Domino (George Strait, Willie Nelson, Merle Haggard) on keys, and former DC guitarist &quot;gone south&quot;, Max Evans (The Thangs and The Ugly Americans). Rounding out this illustrious line up is San Antonio's West Side Horns, featuring Al Gomez and Rocky Morales. Additional tracks were provided by DC's own Chris Watling on saxophones and John Jensen on trombone as well as Marco Delmar on organ and rhythm guitar. With all of this talent it's no wonder Janine has a recording that will get her noticed.\nBorn in Columbus, Ohio, it was clear at an early age that Janine would be a performer. &quot;I used to put on backyard shows with the kids in my neighborhood&quot; she recalls. &quot;We'd sing along to records for our parents.&quot; She went on to study music at Ohio State University where &quot;I had some obstacles to overcome, such as my extreme stage fright. I even failed my sight singing class because of it!&quot; ... humble beginnings for a woman who would eventually relocate to DC and become a mainstay on the music scene there.\nIn January of 2001 Janine won THREE Washington Area Music Awards for Best Blues Female Vocalist, Best Blues Album, and Debut Recording and these awards have only added to Janine's recognition. The release of The Blue Album is bound to bring even more accolades to this talented entertainer. (cdbaby)\n\nTrack list:\n01 - It's Better To Give Than To Receive\n02 - That Last Night\n03 - I Was Good To You Baby\n04 - When My Love Comes Down\n05 - What Passes For Love\n06 - Almost Blue\n07 - Make No Mistake\n08 - Passionate Kiss\n09 - And I Cried\n10 - Breakin' Up Somebody's Home\n11 - Queen Bee\n12 - I Smell Trouble\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:b2abd959685f0f1dba48e6337afe8e45d3d78c63","amp;dn":"Janine+Wilson+-+2000+-+The+Blue+Album+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2abd959685f0f1dba48e6337afe8e45d3d78c63","infoHashBuffer":{"type":"Buffer","data":[178,171,217,89,104,95,15,29,186,72,230,51,122,254,142,69,211,215,140,99]},"announce":[],"urlList":[]}}