{"title":"Voltron: Year One 01-06 (2012|Digital|Roxrite-Empire+theGroup)","uid":9787958,"size":90814886,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b2e29576ef5ad4b90f98705aad334bf37ecfaf8e&amp;dn=Voltron%3A+Year+One+01-06+%282012%7CDigital%7CRoxrite-Empire%2BtheGroup%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1395201654,"description":"Promotional info - &quot;Before Arus. Before Voltron. They were Space Explorer Squadron #686. Soon, they will be known as the legendary Voltron Force---Keith, Lance, Hunk, Sven, and Pidge---five young men entrusted with five powerful robot lions and the responsibility of defending the universe from unimaginable evil. Now, they are one of many Space Explorers under the command of the Galaxy Alliance, tasked with keeping the Earth safe and the skies clear in a universe growing more and more dangerous every day. They're the best central command has to offer, and have never once failed a mission. Everything changes in a flash, and Commander Sven, already hammered by persistent feelings of self-doubt and inadequacy, finds himself in the middle of a conspiracy that reaches to the top of the Galaxy Alliance. All the while he continues to be plagued by nightmares, convinced that he'll make a critical mistake that'll lead to the horrible deaths of his friends. During these critical weeks, we delve fully into the character and motivations of future Blue Lion pilot, Sven, and more specifically, the physical and emotional toll this intense level of responsibility takes on a man who doesn't consider himself worthy of it. When the pressure on him intensifies, he pursues a number of increasingly desperate measures that just might bring these fears to terrible life.&quot;\n\nIssues 01-02 are by Roxrite-Empire; issues 03-06 are by theGroup. All are low-res Digital editions. This a request from KAT. THanks to the scanner groups as always, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:b2e29576ef5ad4b90f98705aad334bf37ecfaf8e","amp;dn":"Voltron%3A+Year+One+01-06+%282012%7CDigital%7CRoxrite-Empire%2BtheGroup%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2e29576ef5ad4b90f98705aad334bf37ecfaf8e","infoHashBuffer":{"type":"Buffer","data":[178,226,149,118,239,90,212,185,15,152,112,90,173,51,75,243,126,207,175,142]},"announce":[],"urlList":[]}}