{"title":"Pidgin 2.10.9 Windows","uid":10746168,"size":9581136,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b32ebd7c8cd72a2cbc0b3a04c3e00303557b643c&amp;dn=Pidgin+2.10.9+Windows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"boy1990","files":1,"time":1407816267,"description":"About Pidgin\n\nBuddy List\nPidgin is a chat program which lets you log in to accounts on multiple chat networks simultaneously. This means that you can be chatting with friends on MSN, talking to a friend on Google Talk, and sitting in a Yahoo chat room all at the same time.\n\nPidgin runs on Windows, Linux, and other UNIX operating systems. Looking for Pidgin for OS X? Try Adium!\n\nPidgin is compatible with the following chat networks out of the box: AIM, ICQ, Google Talk, Jabber/XMPP, MSN Messenger, Yahoo!, Bonjour, Gadu-Gadu, IRC, Novell GroupWise Messenger, Lotus Sametime, SILC, SIMPLE, MXit, MySpaceIM, and Zephyr. It can support many more with plugins.\n\nPidgin supports many features of these chat networks, such as file transfers, away messages, buddy icons, custom smilies, and typing notifications. Numerous plugins also extend Pidgin's functionality above and beyond the standard features.\n\nPidgin integrates with the system tray on Windows, GNOME2, KDE 3, and KDE 4.\n\nPidgin is under constant development. Releases are usually frequent and driven by user contributions, such as bug reports and patches.\n\nPidgin is free and contains no ads. All our code is open source and licensed under the GNU General Public License. This means you can get Pidgin's underlying code and modify it to suit your needs, as long as you publish the changes you make for everyone to benefit from as well.\n\nSupported Languages\n\nPidgin is translated into many different languages, thanks to the generous contributions of our volunteer translators.\n\nAfrikaansAlbanianAmerican EnglishAmharicArabicArmenianAustralian EnglishAzerbaijaniBelarusian LatinBelarusian LatinBengaliBokmal NorwegianBosnianBritish EnglishBulgarianCanadian EnglishCatalanChineseCzechDanishDutch, FlemishDzongkhaEnglishEsperantoEstonianEuskera(Basque)FinnishFrenchGalicianGeorgianGermanGreekGujaratiHebrewHindiHong Kong ChineseHungarianIndonesianIrishItalianJapaneseKannadaKhmerKoreanKurdishLaoLithuanianMacedonianMalayMarathiMongolianMyanmar (Burmese)NepaliNorwegian NynorskOccitanOriyaPashtoPersianPolishPortuguesePortuguese-BrazilPunjabiRomanianRussianSerbianSerbianSimplified ChineseSinhalaSlovakSlovenianSpanishSwahiliSwedishTamilTeluguThaiTraditional ChineseTurkishUkranianUrduValencian-CatalanVietnameseXhosa\nIf your native language is missing from this list or you've found that a translation contains errors, you can help us! Take a look at our tips for translators.\n","torrent":{"xt":"urn:btih:b32ebd7c8cd72a2cbc0b3a04c3e00303557b643c","amp;dn":"Pidgin+2.10.9+Windows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b32ebd7c8cd72a2cbc0b3a04c3e00303557b643c","infoHashBuffer":{"type":"Buffer","data":[179,46,189,124,140,215,42,44,188,11,58,4,195,224,3,3,85,123,100,60]},"announce":[],"urlList":[]}}