{"title":"Simon &amp; Garfunkel - Parsley, Sage, Rosemary And Thyme (Remastere","uid":4457531,"size":362314297,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b492f9043c267bb57cd0af6093ec80d5b21b0588&amp;dn=Simon+%26+Garfunkel+-+Parsley%2C+Sage%2C+Rosemary+And+Thyme+%28Remastere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":-1,"time":1224548083,"description":"*******************************************************************************\n      Simon &amp; Garfunkel - Parsley, Sage, Rosemary And Thyme (Remastered)\n*******************************************************************************\n\nSimon &amp; Garfunkel - Parsley, Sage, Rosemary And Thyme\n\n01.- Scarborough Fair / Canticle  [03:14]\n02.- Patterns  [02:49]\n03.- Cloudy  [02:25]\n04.- Homeward Bound  [02:32]\n05.- The Big Bright Green Pleasure Machine  [02:51]\n06.- The 59th Street Bridge Song (Feelin' Groovy)  [01:58]\n07.- The Dangling Conversation  [02:41]\n08.- Flowers Never Bend With The Rainfall  [02:13]\n09.- A Simple Desultory Philippic (Or How I Was Robert McNamara'd Into \nSubmission)  [02:22]\n10.- For Emily, Whenever I May Find Her  [02:08]\n11.- A Poem On The Underground Wall  [01:56]\n12.- 7 O'Clock News / Silent Night  [02:12]\n13.- Patterns (Bonus)  [02:55]  **\n14.- A Poem On The Underground Wall (Bonus)  [01:51]  **\n\n\n** = BONUS TRACKS, exclusive to this release\n\n\nOriginally Released on September 1966.  This remastered version, which includes \ntwo bonus tracks was released on August 21st, 2001.\n\nRipped with EAC, creating a .cue/.wav audio file, preserving the CD structure, \ngaps and volume levels as in the original CD.\n\n-------------------------------------------------------------------------------\n\nAlbum Review by Bruce Eder\n\nSimon &amp; Garfunkel's first masterpiece, Parsley, Sage, Rosemary and Thyme was \nalso the first album on which the duo, in tandem with engineer Roy Halee, \nexerted total control from beginning to end, right down to the mixing, and it is \nan achievement akin to the Beatles' Revolver or the Beach Boys' Pet Sounds \nalbum, and just as personal and pointed as either of those records at their \nrespective bests. After the frantic rush to put together an LP in just three \nweeks that characterized the Sounds of Silence album early in 1966, Parsley, \nSage, Rosemary and Thyme came together over a longer gestation period of about \nthree months, an uncommonly extended period of recording in those days, but it \ngave the duo a chance to develop and shape the songs the way they wanted them. \nThe album opens with one of the last vestiges of Paul Simon's stay in England, \n&quot;Scarborough Fair/Canticle&quot; -- the latter was the duo's adaptation of a \ncenturies-old English folk song in an arrangement that Simon had learned from \nMartin Carthy. The two transformed the song into a daunting achievement in the \nstudio, however, incorporating myriad vocal overdubs and utilizing a \nharpsichord, among other instruments, to embellish it, and also wove into its \nstructure Simon's &quot;The Side of a Hill,&quot; a gentle antiwar song that he had \npreviously recorded on The Paul Simon Songbook in England. The sonic results \nwere startling on their face, a record that was every bit as challenging in its \nway as &quot;Good Vibrations,&quot; but the subliminal effect was even more profound, \nmixing a hauntingly beautiful antique melody, and a song about love in a \npeaceful, domestic setting, with a message about war and death; Simon &amp; \nGarfunkel were never as political as, say, Peter, Paul &amp; Mary or Joan Baez, but \non this record they did bring the Vietnam war home. The rest of the album was \nless imposing but just as beguiling -- audiences could revel in the play of \nSimon's mind (and Simon &amp; Garfunkel's arranging skills) and his sense of wonder \n(and frustration) on &quot;Patterns,&quot; and appreciate the sneering rock &amp; roll-based \nsocial commentary &quot;The Big Bright Green Pleasure Machine.&quot; Two of the most \nbeautiful songs ever written about the simple joys of living, the languid \n&quot;Cloudy&quot; and bouncy &quot;The 59th Street Bridge Song (Feelin' Groovy),&quot; were no less \nseductive, and the album also included &quot;Homeward Bound,&quot; their Top Five hit \nfollow-up to &quot;The Sound of Silence,&quot; which had actually been recorded at the \nsessions for that LP. No Simon &amp; Garfunkel song elicits more difference of \nopinion than &quot;The Dangling Conversation,&quot; making its LP debut here -- one camp \nregards it as hopelessly pretentious and precious in its literary name-dropping \nand rich string orchestra accompaniment, while another holds it as a ... Read \nMore...\n\n-------------------------------------------------------------------------------\n                      AllMusicGuide Track-by-track Review\n-------------------------------------------------------------------------------\n\nPATTERNS\n\nLed by a slightly bluesy, raga acoustic guitar riff, &quot;Patterns&quot; is a very \ninteresting rhythm exploration for Paul Simon. A vaguely African feel drives the \nsong, and in this way it's not at all unlike some of the rhythm trips that he \nutilized on &quot;Cecilia&quot; and, more importantly, his Graceland album in the late \n'80s. Lyrically, it's one of Simon's psychological explorations into his own \nconsciousness, sounding like a self-therapy session. \n\nCLOUDY\n\nPaul Simon wrote this song in early 1965, and aside from the Simon &amp; Garfunkel \nversion, he recorded a solo demo version with Bruce Woodley, a member of the \nSeekers, much earlier. One of the more obvious pop tunes from Simon (aside from \n&quot;Red Rubber Ball&quot; by the Cyrcle), it shows Simon's ability to fuse folk and \nBroadway pop with extreme ease and craftsmanship. The song's lyrics are a simple \ncelebration of life and great moods, and in this is sort of a cousin of &quot;59th \nStreet Bridge Song (Feelin' Groovy).&quot; According to Simon, the song is &quot;not a \nSimon &amp; Garfunkel tune. They'd never do It.&quot; \n\nHOMEWARD BOUND\n\nFew songs in pop music have captured the melancholy ache of homesickness as well \nas Paul Simon's poignant &quot;Homeward Bound.&quot; The song also goes a long way to \ndispel the glamour myth of a musician on tour. Simon even turns the lyric on \nhimself, taking the romantic troubadour-poet image down a notch, capturing the \nself-doubt and insecurity that accompanies such intense loneliness: &quot;Tonight \nI'll sing my songs again/I'll play the game and pretend/But all my words come \nback to me in shades of mediocrity/Like emptiness in harmony/I need someone to \ncomfort me/Homeward bound/I wish I was/Homeward bound/Home, where my thought's \nescaping/Home, where my music's playing/Home, where my love lies \nwaiting/Silently for me.&quot;\n\nThe myth has it that the song was written by Simon in a train station in Widnes \nin Northern England; in fact, there is apparently a plaque at the station \ncommemorating this. But it is true that Simon wrote it sometime during a 1965 \nsolo tour of England, while he had been based in London. He told writer Paul \nZollo that the song &quot;was written in Liverpool when I was traveling. What I like \nabout that is that it has a very clear memory of Liverpool station and the \nstreets of Liverpool and the club I played at and me at the age of 22.&quot; He has \nalso told other interviewers that it reflects the whole feeling of being on that \ntour, one that he certainly felt sitting in the station at Widnes, as well as \ntelling Hit Parader magazine, &quot;I missed my girl and my friends. It was kind of \ndepressing. I was living out of suitcases, getting on trains every day and going \nto the next place...I got very homesick for London.&quot;\n\nThe arrangement builds each line: the first verse lines beginning softly on \ndescending half-step chords; the melodies and chord progressions on the second \nlines rise, growing more powerful and tense as they ascend into the almost \nbouncy, country-ish chorus. The original studio version, from their third LP, \nParsley, Sage, Rosemary, &amp; Thyme (1967), is still based around the acoustic \nguitar that was the staple of their Dylan-influenced folk sound prior to their \nfirst acoustic/electric hybrid, Sounds of Silence (1965). But like Dylan, the \nduo was also under the spell of the Beatles, and they flesh out their \narrangements with a full pop-band instrumentation, with the aid of Dylan \nproducer Bob Johnston. The bass was played by the legendary Carol Kaye.\n\nAnd, as usual, the harmonies are the thing on &quot;Homeward Bound&quot;; the two longtime \nEverly Brothers fans blend their voices seemingly effortlessly, with Simon's \nsoft voice layered and intertwined with the even more angelic-voiced Art \nGarfunkel's high harmony. The live, non-band versions of the song offer an even \nmore sensitive reading of the song, the voices remaining quiet for the chorus. \nEven the quiet instrumentation on Concert in Central Park treats the song a \nlittle more gently than the original. \n\nTHE BIG BRIGHT GREEN PLEASURE MACHINE\n\nA great putdown song about the effect of television, this song (like Marty \nBlain's &quot;Plastic Fantastic Lover&quot;) succeeds precisely because the overall sound \nof the record conveys the over-saturation and ridiculous nature of the medium. \nSet in the folk-rock idiom, the song is a silly, simple, and downright stupid \n(and that means effective) slice of Americana. The song was later used very \neffectively in the film The Graduate, as well as on the soundtrack.\n\nTHE DANGLING CONVERSATION\n\n&quot;Dangling Conversation&quot; is a classic example of a good song and a better \narrangement that tried to do too much within the context of popular music. The \nfirst of Paul Simon's major songs after &quot;The Sounds of Silence&quot; that did not \ncapture the imagination of the public. In that sense, it's usually regarded as a \nfailure for not making the Top Ten. In fact, it was the last of Simon's attempts \nat &quot; literary rock&quot; -- as a follow-up to &quot;Richard Cory&quot; and &quot;I Am a Rock,&quot; it \nwas also the most subtle of them, a single acoustic guitar backed by a string \nsection and a single drum that may have been too sophisticated for the AM radio \nof its period. The song's references to &quot; Emily Dickinson&quot; and &quot; Robert Frost&quot; \nwere not only non sequiturs when juxtaposed, to anyone who was familiar with the \ntwo literary figures, but also alienated teenagers and adults who might not have \npaid attention in their high school or college English classes. In the end, \nsophisticated listeners tolerated it without embracing the song, and casual \naudiences kept it at arm's length, where its literary conceits seemed to be \nkeeping them. The song was part of Simon &amp; Garfunkel's concert sets in late 1966 \nand 1967, but was quickly dropped once they had more new repertory established. \n\nFLOWERS NEVER BEND WITH THE RAINFALL\n\nAn almost dead ringer for &quot;Red Rubber Ball,&quot; a Paul Simon song never recorded in \nthe studio by Simon &amp; Garfunkel (it was a hit by the Cyrcle), &quot;Flowers That \nNever Bend With the Rainfall&quot; is a simple yet very likeable slice of pop \nconfection. As with many of Simon's songs, this is a simple yet insightful \nself-analysis, filled with pathos and humor. Musically, it showcases Simon's pop \ninstincts in a very powerful and charming way. There are many other songs of his \nfrom this period that are indeed better, but the sense of craftsmanship easily \nputs it on the level of Simon's other, more ambitious creations. \n\nA SIMPLE DESULTORY PHILIPPIC (OR HOW I WAS ROBERT McNAMARA'D INTO SUBMISSION)\n\nA virtual parody of Bob Dylan's &quot;Subterranean Homesick Blues,&quot; &quot;A Simple \nDesultory Philippic&quot; livened up side two of Parsley, Sage with a great sense of \nhumor. Aiming targets at the media, war machinery, and the U.S. government, Paul \nSimon protests &quot;protest music&quot; here, and the effect is hilarious. Utilizing the \nthen-vogue folk-rock style, it works like a rock &amp; roll song, yet at its heart \ncan easily be called a novelty song.\n\nA POEM ON THE UNDERGROUND WALL\n\nOne of the most effective songs from the Parsley, Sage, Rosemary &amp; Thyme album, \n&quot;Poem on an Underground Wall&quot; is, quite simply, Paul Simon's finest piece of \nmusical cinema from this period. A simple, very brief, and colorful narrative of \na subterranean graffiti artist, the sense of drama in Simon's lyric is \npositively devastating. Musically, the song rises and falls with a powerful \nsense of flow, again, like a great film. The duo's unison vocals also get top \nmarks here, being one of their finest performances on the album, which in itself \nis wholly striking.\n\n7 O'CLOCK NEWS/SILENT NIGHT\n\nThe closing track on the Parsley, Sage, Rosemary &amp; Thyme album is one of the \nmore unique and effective studio creations of the limit-smashing 1966-1967 pop \nera. The backdrop of the piece is a piano-backed version of Simon &amp; Garfunkel \nsinging an immaculate and tender version of the classic Christmas hymn &quot;Silent \nNight.&quot; Yet, as the carol fades (barely) into the background, there is a wholly \ndramatic, dry reading of a news broadcast. As the events of 1966 such as civil \nrights marches, the death of Lenny Bruce, the escalation of the Vietnam War, and \nother horrifying events are read, the heavenly Simon &amp; Garfunkel singing again \ngradually takes over. The effect is positively chilling, and creates an organic \ndaydream nightmare that is scary, real, and undeniable.\n\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:b492f9043c267bb57cd0af6093ec80d5b21b0588","amp;dn":"Simon+%26+Garfunkel+-+Parsley%2C+Sage%2C+Rosemary+And+Thyme+%28Remastere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b492f9043c267bb57cd0af6093ec80d5b21b0588","infoHashBuffer":{"type":"Buffer","data":[180,146,249,4,60,38,123,181,124,208,175,96,147,236,128,213,178,27,5,136]},"announce":[],"urlList":[]}}