{"title":"Naruto Movie 3 Guardians of the Crescent Moon Kingdom","uid":5961269,"size":5197449764,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b49656e5e87cfaf90ab929958421c2807a3520a9&amp;dn=Naruto+Movie+3+Guardians+of+the+Crescent+Moon+Kingdom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mike80219","files":4,"time":1289960873,"description":"Format: Animated, Color, DVD, NTSC, Subtitled \nLanguage: English, Japanese \nSubtitles: English, Japanese \nStudio: VIZ VIDEO \nDVD Release Date: November 11, 2008 \nRun Time: 135 minutes \n[img]http://ecx.images-amazon.com/images/I/51guJkSo4QL.jpg[/img]\nGuardians of the Crescent Moon Kingdom is the closest in spirit to the popular TV series of three Naruto features. Under the guidance of Kakashi-sensei, Naruto, Sakura and Rock Lee are assigned to guard Michiru, the fabulous wealthy Prince of the Moon Kingdom, and his spoiled son Hikaru. Michiru is so rich, he buys an entire circus so Hikaru can have the saber-toothed tiger that catches his fancy. A storm at sea and a revolt in the Kingdom provide Naruto with the opportunity to teach Hikaru valuable lessons about friendship. Although Naruto manages to slurp down some ramen, he doesn't crack raunchy jokes or pull pranks. This kinder, gentler knucklehead makes a surprisingly touching teacher. Guardians of the Crescent Moon Kingdom is more satisfying and more entertaining than Ninja Clash in the Land of Snow or Legend of the Stone of Gelel. Director Toshiyuki Tsuru uses rapid intercutting effectively to pump up the energy in the climactic battle that puts Sakura, Naruto, Rock Lee, and Hikaru to the test. The most interesting extras on the second disc are the footage of the voices of the main characters dubbing the film together (anime voice actors normally record their lines alone) and a Ninja Quiz that cleverly re-purposes footage from the movie. (Rated T+ Older Teen; suitable for ages 12 and older: violence) -- Charles Solomon \n\nNaruto, Sakura and Kakashi team up with Rock Lee to protect Prince Michiru and his son Hikaru on their return home to the Crescent Moon Kingdom. Easy enough, until the royal family becomes a royal pain! Prince Michiru can't help indulging his son, even buying him a circus along the way! Naruto has a tough time putting up with both the spoiled Hikaru and a saber-toothed tiger, but the real adventure begins when they reach the Land of the Moon and find themselves facing a villainous uprising. Does Naruto have what it takes to save an entire kingdom?\n\n","torrent":{"xt":"urn:btih:b49656e5e87cfaf90ab929958421c2807a3520a9","amp;dn":"Naruto+Movie+3+Guardians+of+the+Crescent+Moon+Kingdom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b49656e5e87cfaf90ab929958421c2807a3520a9","infoHashBuffer":{"type":"Buffer","data":[180,150,86,229,232,124,250,249,10,185,41,149,132,33,194,128,122,53,32,169]},"announce":[],"urlList":[]}}