{"title":"How It Works - Book of Incredible History 2012 PDF [RAHMANAT1]","uid":7844665,"size":181993975,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4f0891088b9f56046424eab8773095c6ccec3c3&amp;dn=How+It+Works+-+Book+of+Incredible+History+2012+PDF+%5BRAHMANAT1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RAHMANAT1","files":1,"time":1353438420,"description":"Packed with fascinating facts, and covering over 200 million years of history, this book is the perfect guide to the world around us. From the dinosaurs to the Romans and the Battle of Hastings to the Battle of Britain, you'll discover the key moments that shaped the world into what it is today. Whether you want to see how the Taj Mahal was built, how the Titanic sunk, or take a look inside a Spitfire, this is the perfect book to educate and entertain.\nPerfect for those with a curious mind, the How It Works Book of Incredible History aims to bring history to life. Packed with fun and fascinating facts, this is the ideal tool to get kids interested in the world we live in, and how everything around us came to be. Covering ancient history, the prehistoric era, weapons &amp; war, incredible inventions and landmarks that continue to amaze us today, this educational guide will show you the astounding feaÂ¬ts of mankind, and how our world was shaped by those before us. Whether you want to know what life was like for Roman gladiators, how ","torrent":{"xt":"urn:btih:b4f0891088b9f56046424eab8773095c6ccec3c3","amp;dn":"How+It+Works+-+Book+of+Incredible+History+2012+PDF+%5BRAHMANAT1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4f0891088b9f56046424eab8773095c6ccec3c3","infoHashBuffer":{"type":"Buffer","data":[180,240,137,16,136,185,245,96,70,66,78,171,135,115,9,92,108,206,195,195]},"announce":[],"urlList":[]}}