{"title":"Simple Men 1992 DVDRip Sonata Premiere","uid":9233203,"size":737404485,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b681ff47e2d6ac0798d2cc13d81b929652ba07b3&amp;dn=Simple+Men+1992+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":2,"time":1385079186,"description":"A pair of brothers dodge the law while trying to locate their long-lost father in this third feature from independent New York filmmaker Hal Hartley. Robert John Burke stars as Bill McCabe, a failed computer thief who's just been doublecrossed by his girlfriend and partner. Vowing revenge on the next beautiful blonde he encounters, Bill meets up with his younger brother Dennis (William Sage), a philosophy student concerned about their father William (John A. MacKay). It seems the McCabe paterfamilias was a former major league shortstop who became an anarchist bomber in the 1960s, nearly blowing up the Pentagon. On the run for twenty-three years, William was recently caught by the FBI but escaped again. Based on information from their mother, the McCabes travel to Long Island, where William may be hiding. Along the way, the brothers meet the epileptic Elina (Elina Lowensohn) and her friend Kate (Karen Sillas), a beautiful blonde with whom Bill is instantly smitten. While Dennis figures out that Elina is somehow connected to William, Bill contends with Kate's ex-con husband Jack (Joe Stevens) and Jack's best friend Martin (Martin Donovan), both of whom are also in love with her.","torrent":{"xt":"urn:btih:b681ff47e2d6ac0798d2cc13d81b929652ba07b3","amp;dn":"Simple+Men+1992+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b681ff47e2d6ac0798d2cc13d81b929652ba07b3","infoHashBuffer":{"type":"Buffer","data":[182,129,255,71,226,214,172,7,152,210,204,19,216,27,146,150,82,186,7,179]},"announce":[],"urlList":[]}}