{"title":"The Horse, the Wheel and Language -((mobi))","uid":8249398,"size":8005229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6b67f751dae67919282a65e20942aedac3238d3&amp;dn=The+Horse%2C+the+Wheel+and+Language+-%28%28mobi%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrjaguar","files":-1,"time":1363131358,"description":"Roughly half the world's population speaks languages derived from a shared linguistic source known as Proto-Indo-European. But who were the early speakers of this ancient mother tongue, and how did they manage to spread it around the globe? Until now their identity has remained a tantalizing mystery to linguists, archaeologists, and even Nazis seeking the roots of the Aryan race. The Horse, the Wheel, and Language lifts the veil that has long shrouded these original Indo-European speakers, and reveals how their domestication of horses and use of the wheel spread language and transformed civilization.\n\nLinking prehistoric archaeological remains with the development of language, David Anthony identifies the prehistoric peoples of central Eurasia's steppe grasslands as the original speakers of Proto-Indo-European, and shows how their innovative use of the ox wagon, horseback riding, and the warrior's chariot turned the Eurasian steppes into a thriving transcontinental corridor of communication, commerce, and cultural exchange. He explains how they spread their traditions and gave rise to important advances in copper mining, warfare, and patron-client political institutions, thereby ushering in an era of vibrant social change. Anthony also describes his fascinating discovery of how the wear from bits on ancient horse teeth reveals the origins of horseback riding.\n\nThe Horse, the Wheel, and Language solves a puzzle that has vexed scholars for two centuries--the source of the Indo-European languages and English--and recovers a magnificent and influential civilization from the past.\n","torrent":{"xt":"urn:btih:b6b67f751dae67919282a65e20942aedac3238d3","amp;dn":"The+Horse%2C+the+Wheel+and+Language+-%28%28mobi%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6b67f751dae67919282a65e20942aedac3238d3","infoHashBuffer":{"type":"Buffer","data":[182,182,127,117,29,174,103,145,146,130,166,94,32,148,42,237,172,50,56,211]},"announce":[],"urlList":[]}}