{"title":"Santana - Caravanserai 1972 TQMP [FLAC]","uid":4459316,"size":340881544,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b6bf9f1c2a2ffce0e1b3133100a28faa163297f9&amp;dn=Santana+-+Caravanserai+1972+TQMP+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Breezin","files":6,"time":1224625103,"description":"Quote from amazon.com\n\n&quot;Caravanserai&quot; represents Carlos Santana&amp;#039;s finest moment, in my book, even considering his superb first two albums. His jazz/rock fusion becomes largely dominated by jazz here, with less of the raw latin beat/latin sound, altho these are present in more refined form. The jazz is modern, fairly often fast-paced and hard driving, and very rhythmic and melodic. It is the music that is the thing, for only three of the entries have lyrics. Santana delivers a tour de force, a work of compelling beauty, and one of my all-time favorite recordings.\nA highlight (in fact, probably the best track) is the group&amp;#039;s rendition of Jobim&amp;#039;s &quot;Stone Flower.&quot; The Santana band not only expands upon, but outdoes, the Brazilian master&amp;#039;s composition, delivering terrific, smooth guitar and keyboards, par excellence as a rhythmic display. Piano sometimes take over the lead, and the percussion is also great, including a cuica, a new Brazilian instrument. Everything else is also very enjoyable. Among the other songs, &quot;Fuente del Ritmo,&quot; which comes after &quot;Stone Flower,&quot; has a latin percussion beat, sort of bouncy in feel, combined with jazzy guitar work. &quot;Every Step of the Way,&quot; the brilliant concluding number, while repetitive, has a great fast-paced guitar motif that carries one down the visual horizon.\n\nAs to the earliner tunes, the opener, &quot;Eternal Caravan of Reincarnation,&quot; is very pretty with moderate substance, reminiscent of &quot;Singing Winds, Crying Beasts.&quot; It leads right into the excellent &quot;Waves Within,&quot; with soft, beautiful, smooth-flowing riffs, yes, like waves. After more good but brief instrumentation in &quot;Look up (To See What&amp;#039;s Coming Down),&quot; we hit our first vocals in &quot;Just in Time to See the Sun.&quot; Then, &quot;Song of the Wind,&quot; a Santana classic, showcases Carlos&amp;#039;s and Neal Schon&amp;#039;s ability for pretty, high-pitched guitar twangs (reference &quot;Samba Pati Ti,&quot; &quot;Europa,&quot; &quot;Moonflower&quot;). It is followed by &quot;All the Love of the Universe.&quot; Can it match the title? Yes, its great! Schon and organist Gregg Rolie deliver blistering, jazzy solos.\n\nIn fact, each of the titles to the songs seems to be a visual representation of the particular song&amp;#039;s lovely music, always accompanied by great percussion. Hardly anything I&amp;#039;ve ever heard matches the fabulous music, the fluid, driving pleasure that the Santana group dishes out here.&quot;\n\nBreezin Says: The Best Instrumental Guitar Album Ever. (Or is it Jeff Beck&amp;#039;s Blow By Blow?)\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980&amp;#039;s cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;25475740405f4c4b65494c53400b4b49&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya&amp;#039;all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:b6bf9f1c2a2ffce0e1b3133100a28faa163297f9","amp;dn":"Santana+-+Caravanserai+1972+TQMP+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6bf9f1c2a2ffce0e1b3133100a28faa163297f9","infoHashBuffer":{"type":"Buffer","data":[182,191,159,28,42,47,252,224,225,179,19,49,0,162,143,170,22,50,151,249]},"announce":[],"urlList":[]}}