{"title":"Maxine Brown-8 cd","uid":5472821,"size":430041405,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b6c23af4157f540445015add7deb5c247ab70d75&amp;dn=Maxine+Brown-8+cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"flitigalisa","files":177,"time":1269975436,"description":" &lt;a href=&quot;http://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nMaxine Ella Brown (born August 18, 1939, in Kingstree, South Carolina) is an American soul singer.\nShe began singing as a child, performing with two New York based gospel groups when she was a teenager. In 1960, she signed with the small Nomar record label, who released the smooth soul ballad &quot;All in My Mind&quot; (which was written by Maxine) late in the year. The single became a hit, climbing to number two on the R&amp;B charts (number 19 pop), and it was quickly followed by &quot;Funny&quot;, which peaked at number three.\nBrown was poised to become a star and she moved to the bigger ABC-Paramount in 1962, but left the label after an unsuccessful year despite several singles to sign for the New York-based uptown soul label, Wand Records, in 1963.\nBrown recorded her best work at Wand, a Scepter Records subsidiary, having a string of sizable hits over the next three years. Among these were the Carole King/Gerry Goffin songs &quot;Oh No Not My Baby&quot;, which reached number 24 on the pop charts in 1964, and &quot;It's Gonna Be Alright&quot;, which peaked at #26 the following year. She also recorded duets with label-mate Chuck Jackson, including a reworked version of an Alvin Robinson hit, &quot;Something You Got&quot;, which climbed to #10 on the R&amp;B chart. However, the company turned its focus to other bigger-selling acts, such as Dionne Warwick and B.J. Thomas.\nAll backing vocals for Maxine's records were performed by Cissy Houston and the Sweet Inspirations (the same group that backed Elvis), plus emerging writer-producers Nick Ashford and Valerie Simpson. Hoping to increase the line of hits for Maxine and her singing partner, Chuck Jackson, Ashford and Simpson took their song catalog to Scepter Records looking for a deal. When they were turned down, the couple approached Berry Gordy at Motown Records who immediately hired them. Songs that were penned for Maxine and Chuck became blockbuster hits for Ray Charles, such as &quot;Let's Go Get Stoned&quot; (co-written by Josie Armstead), as well as Marvin Gaye and Tammi Terrell's Ain't No Mountain High Enough.\nIn 1969, Maxine left Wand for Commonwealth United where she recorded two singles, the first &quot;We'll Cry Together&quot; reached #10 in the Billboard R&amp;B chart and also made the lower reaches of the Hot 100. A spell with Avco Records followed, but her later recordings generally met with little commercial success. Despite her seeming lack of visibility, Brown is acknowledged as one of the finer R&amp;B vocalist of her time, able to handle soul, jazz, and pop with equal aplomb.\n\nPlease SEED and enjoy, thanks, thanks and thanks so mutch........!\n","torrent":{"xt":"urn:btih:b6c23af4157f540445015add7deb5c247ab70d75","amp;dn":"Maxine+Brown-8+cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6c23af4157f540445015add7deb5c247ab70d75","infoHashBuffer":{"type":"Buffer","data":[182,194,58,244,21,127,84,4,69,1,90,221,125,235,92,36,122,183,13,117]},"announce":[],"urlList":[]}}