{"title":"Almanac - The Rainmakers Video Collection","uid":6956082,"size":721120777,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b7df10366d16a5102521b21d6b7cddc777355295&amp;dn=Almanac+-+The+Rainmakers+Video+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rubusdemonoid","files":-1,"time":1326582773,"description":"Please help to seed this torrent when you are completed as I have over 60 torrents that I try to keep alive and seed for you all. I am not seeding them all, all the time, so if you require a seed just send me a PM request and I\\'ll be happy to oblige. I just can\\'t continue to seed all by myself so often. PLEASE help to seed. Thank you!  :-)\n\n\n\n\nFrom Amazon:\nThe Rainmakers first released this video collection about 15 years ago, but it\\'s taken them forever to make it available on DVD. Finally, it\\'s here, and contains 3 more tracks that weren\\'t on the original VHS release. Included are all their \\&quot;official\\&quot; videos from their time on Mercury Records, plus early footage from their club days as Kansas City bar band Steve Bob &amp; Rich, lots of live concert footage - some multi-camera, some guerrilla one-camera stuff, backstage, in the van, in the studio, on MTV, on Top of the Pops, all kinds of stuff.\n\nReview\nThis DVD is an overview of The Rainmakers from Kansas City, a popular local band of the 1980s-90s, was also popular throughout the mid-west U.S. and strangely, was huge in Norway.\n\nThe collection runs from their earliest incarnation as \\&quot;Steve, Bob &amp; Rich\\&quot; in 1983, of whom I saw many times during my college years at K-State, until the end of their time together around 1998.\n\nThe track list is as follows:\n\n01. Big Fat Blonde, 1983\n02. Kissin\\' Time, 1984\n03. Uncontrollable Urge, 1984 (yes, the Devo song from Devo\\'s first LP)\n04. Let My People Go-Go, 1986\n05. Downstream, 1986\n06. Long Gone Long, 1986\n07. Let My People Go-Go (Top Of The Pops), 1987\n08. Snakedance, 1987\n09. Wages Of Sin, 1988\n10. Small Circles, 1988\n11. Nobody Knows, 1988\n12. Small Circles (acoustic), 1987\n13. Wild Oats, 1988\n14. Spend It On Love, 1989\n15. Hoo Dee Hoo, 1989\n16. Horn O Plenty, 1989\n17. Drinkin\\' On The Job, 1990\n18. Width Of A Line, 1994\n19. Another Guitar, 1995\n20. Good Sons And Daughters, 1998\n21. Hunger Moon, 1998\n22. To The Hum, 1998\n23. Johnny Reb, 1998\n\nMost of the songs are actual live performances of varying sound quality (sometimes great, sometimes not good) and a handful of actual produced 1980s rock videos shown on MTV, etc. of good quality. Much of this obviously came from VHS tapes, so \\&quot;grainy\\&quot; at times. Between tracks are various snippets of conversations and interviews, record store appearances, award ceremonies, etc. This really does give one a great overview of what this band was capable of and how much fun they were on CD and in concert. These guys really were humble mid-westerners who could really rock out but always had some deep statements and irony in their lyrics. A \\&quot;thinking man\\'s band\\&quot;. Some of the live appearances are from Norway, where they were quite popular.\n\nAs a bonus, along the way we get also a snapshot of what it was like to be a vinyl LP-era band of the 1980s, the MTV video era, then into the digital music age. The record store appearances at what appears to be Sound Warehouse (probably in Overland Park, KS) is a great period-piece, of which we may never see the likes of again. Those types of record stores are virtually extinct.\n\nIf you liked The Rainmakers, you will REALLY like this video DVD and it will be an essential purchase. I feel like it was very well done for what they had to work with and the additional bonus of feeling the culture of the 1980s is worth it. Not my favorite decade for music, but The Rainmakers were one of the best bands of the period in the mid-west. This is Rock &amp; Roll, NOT New Wave.\n\nMy only complaint is a lack of any liner notes or list of musicians, or anything except a track list. Several photos of the band are in the fold-over \\&quot;booklet\\&quot;. These shortcomings are mostly made up during the course of the video content.\n\nI did have to chuckle, as I\\'m sure the band did during a news broadcast when longtime KC news anchor Phil Witt introduced Bob as \\&quot;Steve Walkenhorst\\&quot;.\n\nWell thought out, and well-directed/produced, but just grainy enough to not be able to give more than 4 stars for the DVD era. But what average person had digital video cameras in the 1980s?\n\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;","torrent":{"xt":"urn:btih:b7df10366d16a5102521b21d6b7cddc777355295","amp;dn":"Almanac+-+The+Rainmakers+Video+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7df10366d16a5102521b21d6b7cddc777355295","infoHashBuffer":{"type":"Buffer","data":[183,223,16,54,109,22,165,16,37,33,178,29,107,124,221,199,119,53,82,149]},"announce":[],"urlList":[]}}