{"title":"90 Minutes Sega Championship Football DC+NullDC","uid":9709113,"size":321752592,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b8efca564b819a450466d4922b5df5f08d92ea6a&amp;dn=90+Minutes+Sega+Championship+Football+DC%2BNullDC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"razalgul1979","files":-1,"time":1394087670,"description":"A soccer (football) simulator for the Dreamcast featuring full field action as well as sim elements such as the ability to make an all-star team\n\n90 Minutes Sega Championship Football was released for the Sega Dreamcast in 2001, and was made by Smilebit (the same company that made Jet Set Radio and Panzer Dragoon Orta). My expectations for this game were high, but 90 Minutes turned out to be a game that showed lots of promise, but is ultimately below average. \n\n90 Minutes offers a pretty good number of different modes to play, including Exhibition, World Championship, Domestic, Competition, Training, and Utility. Exhibition mode is a standard game of soccer. In World Championship mode the player selects a team and then plays a series of matches and a tournament to try and become the champion. In Domestic mode players choose which National League they would like to be in, and then play through the League's season. Competition mode allows anywhere from 1-4 players to compete in numerous competitions for trophies. Training mode allows players to practice numerous situations found in the game like passing, defending, shooting, and more. Utility mode allows players to create an original team, view game results, and manage data. \n\nWhile the abundance of different modes is nice, the gameplay is pretty flawed. From the start, the speed of the game is too slow. The speed IS adjustable through the options screen, and players will likely find a speed that is to their liking, however making the speed faster will result in some funny look player animations. The passing in 90 Minutes is very annoying. While it's easy to pass the ball to the player of your choice, for some odd reason the player receiving the pass will automatically stop moving and wait for the ball to come to them. This can ruin the best scoring chances and breakaways, and it's a flaw that some will likely find unacceptable. Thankfully, taking shots in this game is a breeze. The power of the shot will depend on how long you hold down the shoot button, and aiming is doing with the control stick. It's been done before, but it works well. Everything else plays like a standard soccer simulation, and it's easily enjoyable. However, the truly weird flaws in the speed of the game and passing keep it from playing like a top-notch soccer game. \n\nGraphically, 90 Minutes isn't a bad looking game, but it fails to impress. The speed of the game, as I mentioned before, is inconsistent and jerky, resulting in some odd and unreleastic player and ball movements, no matter what speed setting is chosen. The player models are fairly detailed and look nice up-close, but they are nothing special, and often look too small and far away during gameplay. There are a fair amount of aliasing and clipping problems, which is also kind of odd, seeing how the game is relatively simple and plain looking. While the game does look better than any 32 or 64 bit soccer game, the Dreamcast is capable of doing alot better than what's found in 90 Minutes. \n\nThe play-by-play in the game is done by Alan Perry, and it's quite possibly one of the worst announcing I've ever heard in a Soccer game. Sometimes he sounds fine, saying your standard phrases like ''Gooooal'' or ''He passes it up-field''. But where it starts to get ugly is when he says things like ''In the first half, remaining in the first, 5 minutes remaining'', which makes absolutely no sense at all. He also refers to himself in the third person at the end of each game by saying ''Your play-by-play announcer was Alan Perry''. There are many other laughable phrases he says throughout the game, but I won't subject them to you any further. Thankfully there is an option to turn him off. \n\nIn the end, what I expected to be a first-class soccer game from the talented people over at Smilebit, turned out to be a game that could have been great, but isn't. 90 Minutes is still a fairly enjoyable soccer game, despite it's numerous flaws, and if Smilebit hadn't rushed through it (like I suspect they did) and fixed up the speed, passing, and announcing, this game would've been top-notch. On a positive note, the game can be picked up cheap on ebay these days, and it's worth the $10, especially if you have some friends to play 4 player mode with.\n\n\nGenre: Sports\nPublisher: SEGA\nDeveloper: SEGA\n\nGame Details\nMedia: 1 x CD-R\nRegion: PAL\nESBR Rating: Everyone\nLanguages: Multi 5\nPlayers: Multi\n\nFile Details\nFormat: CDI\nUnpacked size: 575 MB (603.492.704 bytes)\nTested and working with NullDC\n\nInstructions\n1. Unrar\n2. Burn with your choice of burning software or load with emulator included, suggest DiscJugller at x4 to CD-R\n3. Play\n\n\nScreens:\n\n &lt;a href=&quot;\nhttp://bayimg.com/iakKpAAfo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/iakKpAAfo&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/JAkKdAaFo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/JAkKdAaFo&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/JaKkEaafO&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/JaKkEaafO&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/jakkGaAFo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/jakkGaAFo&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b8efca564b819a450466d4922b5df5f08d92ea6a","amp;dn":"90+Minutes+Sega+Championship+Football+DC%2BNullDC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8efca564b819a450466d4922b5df5f08d92ea6a","infoHashBuffer":{"type":"Buffer","data":[184,239,202,86,75,129,154,69,4,102,212,146,43,93,245,240,141,146,234,106]},"announce":[],"urlList":[]}}