{"title":"The Pillars of the Earth Complete Season (2010) crow_uy","uid":5869110,"size":4924602516,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ba400e3c8213dfef6d50764198663ea6aa71d509&amp;dn=The+Pillars+of+the+Earth+Complete+Season+%282010%29+crow_uy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ccobas","files":8,"time":1286391852,"description":"The Pillars of the Earth is set against a backdrop of war, religious strife and power struggles which tears lives and families apart. In that time, there rises a magnificent Cathedral in Kingsbridge. Against the backdrop, love-stories entwine: Tom, the master builder, Aliena, the noblewoman, the sadistic Lord William, Philip, the prior of Kingsbridge, Jack, the artist in stone work and Ellen, the woman from the forest who casts a curse. At once, this is a sensuous and enduring love story and an epic that shines with the fierce spirit of a passionate age. Follett masterfully weaves these stories through political turmoil of 12th century England, creating a relevant and viable world for today's audience and for generations to come.\n\nEsta historia ÃƒÂ©pica de pasiÃƒÂ³n y codicia comienza cuando un misterioso secreto desestabiliza la sucesiÃƒÂ³n a la corona de Inglaterra y un inesperado miembro de la familia del Rey Henry se apodera del trono. Una lucha de poder entre la hija de Henry, Maud, y su sobrino, Stephen, provoca que Inglaterra sea desgarrada por la guerra, a medida que se desencadenan las batallas por el legÃƒÂ­timo heredero. Mientras tanto, el Obispo Waleran Bigod y la familia Hamleigh manipulan el conflicto para satisfacer sus propias y despiadadas ambiciones. \nDentro de este tumultuoso escenario, el Prior Philip pelea contra insufribles obstÃƒÂ¡culos para mantener a Kingsbridge y su sueÃƒÂ±o de construir una enorme catedral con vida. La tarea es descomunal, pero el maestro albaÃƒÂ±il Tom Builder, su talentoso hijastro, Jack, y la dama de la nobleza, Aliena, trabajarÃƒÂ¡n juntos para alcanzar sus sueÃƒÂ±os. Y en el proceso, el secreto por mucho tiempo guardado, serÃƒÂ¡ revelado.","torrent":{"xt":"urn:btih:ba400e3c8213dfef6d50764198663ea6aa71d509","amp;dn":"The+Pillars+of+the+Earth+Complete+Season+%282010%29+crow_uy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba400e3c8213dfef6d50764198663ea6aa71d509","infoHashBuffer":{"type":"Buffer","data":[186,64,14,60,130,19,223,239,109,80,118,65,152,102,62,166,170,113,213,9]},"announce":[],"urlList":[]}}