{"title":"Bobcat - Master of Survival","uid":4921652,"size":1450099,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba8a99e0349e0ba38b5f446f592455775e32a970&amp;dn=Bobcat+-+Master+of+Survival&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iornix","files":-1,"time":1243689109,"description":"Bobcat: Master of Survival \nBy Kevin Hansen\nEdition: illustrated\nPublished by Oxford University Press US, 2007\nISBN 0195183037, 9780195183030\n212 pages\n\nSynopsis\n\nBobcat: Master of Survival tells the story of the most adaptable and resilient wild feline in the world. While half the wild cat species worldwide are in danger, the bobcat is thriving, even expanding its range in North America. Why are bobcats flourishing when so many other wild felines are advancing towards extinction? The book explains how scientists apply the latest in wildlife research technology to probe this diminutive predator's habits and behavior. The reader is invited inside the bobcat's world to see how they hunt, kill prey, raise their young, coexist with humans, and deftly navigate the endless obstacles to survival.\nThe bobcat is both the most studied and the most exploited wild feline in the world. Millions have been killed for the fur trade. They were the focus of major controversy in the 1970s that transformed international conservation of wild felines. The book discusses how economics and politics play a far greater role in bobcat management and conservation than does science. Bobcat is the most comprehensive and up-to-date book on the natural history and management of bobcats to appear in 40 years.\n\nBiography\n\nKevin Hansen is Education Director at the Southwest Wildlife Rehabilitation and Educational Foundation. Hansen has worked as a wildlife biologist, park ranger and writer throughout the US. He studied birds of prey in Oregon, fearl burros in Death Valley, alligators in the Florida Everglades, mountain lions in Arizona, and bobcats in California.","torrent":{"xt":"urn:btih:ba8a99e0349e0ba38b5f446f592455775e32a970","amp;dn":"Bobcat+-+Master+of+Survival","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba8a99e0349e0ba38b5f446f592455775e32a970","infoHashBuffer":{"type":"Buffer","data":[186,138,153,224,52,158,11,163,139,95,68,111,89,36,85,119,94,50,169,112]},"announce":[],"urlList":[]}}