{"title":"The Guardian S01E08  [Buzzsaw Tv]","uid":6432821,"size":367046656,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bb9bf4492a331c84d97a76e2912acb7dcaec3aec&amp;dn=The+Guardian+S01E08++%5BBuzzsaw+Tv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"The.Buzzsaw","files":-1,"time":1306712373,"description":"                          Welcome to [Buzzsaw Tv]\n                          \n                          \n                          Series:  &quot;The Guardian&quot;\n\n                      \n                      Season One (1) Episode Eight (8)\n\n   \n     *Starring Simon Baker who also stars in The Mentalist as Patrick Jane*\n\n\n\nCBS DVD (distributed by Paramount) has released the all three seasons of The Guardian on DVD in Region 1.\n \n \n\n\nThe First Season brought us 22 episodes and was released October 27, 2009\n \n\n\nThe Second Season produced 23 episodes and was released September 7, 2010\n \n\n\nThe Final Season delivered 22 episodes and was released February 8, 2011\n\n\n     This series revolves around protagonist Nick Fallin (Simon Baker), a hotshot lawyer working at his father's ultrasuccessful Pittsburgh law firm. Unfortunately, the high life has gotten the best of Nick. Arrested for drug use, he's sentenced to do 1,500 hours of community service, somehow to be squeezed into his 24/7 cutthroat world a corporate attorney sentenced to 1500 hours community service with Legal Services of Pittsburgh as the result of a drug conviction. The plot focused on Nick's community service and recovery from drug addiction, as well as his strained relationship with his father who was president of the corporate law firm where Nick was employed full time. \n\n     Starring Simon Baker who is known also as Patrick Jane from the CBS American police procedural television series, The Mentalist. Baker made a fantastic decision to join the cast of &quot;The Guardian&quot; and star in David Hollander's award winning creation. Other actors that co-star in this ultra-popular multi-award winning television series include Alan Rosenberg, Dabney Coleman, Charles Malik Whitfield, and many others. &quot;The Guardian&quot; won 6 Golden Globe awards and was nominated for 10 more respectively!\n\n     Buzzsaw TV will be uploading a new episode of &quot;The Guardian&quot; almost daily, and in the order that was established to follow the plot. All uploads will be &quot;Avi&quot; format exclusively, and as always have great picture and audio quality. Sixty-seven(67) episodes total over the next two+ months, and don't forget to always explore The.Buzzsaw as we are committed to bringing the highest rated TV shows and movies that are not found easily on the web.\n\t\t","torrent":{"xt":"urn:btih:bb9bf4492a331c84d97a76e2912acb7dcaec3aec","amp;dn":"The+Guardian+S01E08++%5BBuzzsaw+Tv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb9bf4492a331c84d97a76e2912acb7dcaec3aec","infoHashBuffer":{"type":"Buffer","data":[187,155,244,73,42,51,28,132,217,122,118,226,145,42,203,125,202,236,58,236]},"announce":[],"urlList":[]}}