{"title":"Frank Zappa - Apostrophe &amp; Over-Nite Sensation DVD","uid":4789044,"size":1035661791,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bc53fa01f2ba4eca9b9d2de6d4e7c24e2ab08d36&amp;dn=Frank+Zappa+-+Apostrophe+%26+Over-Nite+Sensation+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombino","files":3,"time":1237650513,"description":"Frank Zappa: Apostrophe / Over-Nite Sensation (2007)\n\nHistory will show that Frank Zappa (1940-1993) was one of the greatest American composers of the 20th century in any musical form, and this superb episode of the Classic Albums series offers ample proof of Zappa's genius. As Zappa's reverent son and musical heir Dweezil Zappa rightly points out, Over-Nite Sensation (1973) and Apostrophe (') (1974) are the albums that epitomize Zappa's masterful jazz/rock fusion, virtually defining a unique musical genre that can only be called &quot;Zappa.&quot; The recording of both albums is chronicled here not simply because they best represent the dazzling complexity of Zappa's music, but also because they were recorded simultaneously in a burst of creativity, proving beyond any doubt that Zappa was more than simply a mischievous provocateur. While the world may know Zappa from his mainstream novelty hit &quot;Valley Girl&quot; (with daughter Moon on vocals), any devoted Zappaphile will tell you that this is the real Zappa, in full musical bloom, working miracles in the studio with The Mothers of Invention and a stellar variety of topnotch musicians who cite their time with Zappa as the most rewarding period of their careers.\n\nThe Classic Albums series strives to be definitive, and this must-have DVD is fully authorized in the scope of its coverage. With complete cooperation and participation from the remaining Zappa family (sons Dweezil and Ahmet, daughter Moon, and widow Gail are all extensively interviewed) and additional interviews with Billy Bob Thornton, Alice Cooper, guitarist Steve Vai, veteran Rolling Stone critic David Fricke, and many of Zappa's closest associates and collaborators, this 97-minute documentary is packed with highlights and fascinating revelations, like the pristine precision of Zappa's hand-written compositions, Zappa's childhood fascination with the compositions of Edgard Varese, and his diligent, prolific, and disciplined, drug-free approach to recording and touring. Zappa's studio process is amazingly revealed when Dweezil and Zappa &quot;Vaultmeister&quot; Joe Travers sit down at a mixing table to analyze the master tapes of classic Zappa tracks like the hilariously controversial &quot;Dyna-Moe Humm.&quot; In addition to vintage archival clips of Zappa discussing his music and career, and home movies of Zappa's band on tour during the mid-1970s, this DVD also includes the complete video of Zappa performing &quot;I'm the Slime&quot; on Saturday Night Live in 1976, live footage of a 1973 performance of &quot;Montana,&quot; and a new performance of &quot;Camarillo Brillo&quot; by Dweezil's tribute band, Zappa Plays Zappa (with Dweezil playing one of his father's favorite Gibson guitars). Bonus features also include a Travers-hosted trip into the massive Zappa archives, and further deconstruction of Zappa tracks &quot;Dirty Love&quot; and &quot;Nanook Rubs It.&quot; If you're a casual Zappa fan, this DVD will turn you into a passionate convert. For those who've loved Zappa all along, it's a little bit of heaven here on Earth. --Jeff Shannon\n\nProduct Description\n&quot;This is where you go to find every aspect of Frank's music squeezed into two perfectly formed records.&quot;Dweezil Zappa. This new addition to Eagle Vision's acclaimed Classic Albums series focuses on Frank Zappa's early seventies albums &quot;Overnite Sensation&quot; (1973) and &quot;Apostrophe(`)&quot; (1974). Together they encapsulate Zappa's extraordinary musical diversity and were also the two most commercially successful albums that he released in his prolific career. As ever the program uses interviews, musical demonstrations, rare archive and home movie footage plus live performances to tell the story behind the conception and recording of these groundbreaking albums. TRACKLISTING: Features excerpts from: -Dinah-Moe Humm -I'm The Slime -Montana -St Alfonzo's Pancake Breakfast -Dirty Love -Cosmic Debris -Stink-Foot &amp; more. \n\n# Format: XviD MPEG4 720 x 400\n# Framerate: 29.970 \n# Bitrate: 1200\n# Audio Bitrate: 192 (CBR)\n# Language: English\n# Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)\n# Aspect Ratio: 1.33:1\n# Studio: Eagle Rock Ent\n# DVD Release Date: May 1, 2007\n# Run Time: 97 minutes\n\nEnglish subs for this rip: http://www.opensubtitles.org/en/subtitles/3471886 &lt;a href=&quot;\nhttp://www.eaglerockent.com/eaglerockUSA/media_detail.php?media_id=816&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.eaglerockent.com/eaglerockUSA/media_detail.php?media_id=816&lt;/a&gt;","torrent":{"xt":"urn:btih:bc53fa01f2ba4eca9b9d2de6d4e7c24e2ab08d36","amp;dn":"Frank+Zappa+-+Apostrophe+%26+Over-Nite+Sensation+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc53fa01f2ba4eca9b9d2de6d4e7c24e2ab08d36","infoHashBuffer":{"type":"Buffer","data":[188,83,250,1,242,186,78,202,155,157,45,230,212,231,194,78,42,176,141,54]},"announce":[],"urlList":[]}}