{"title":"Aleksandr Sokurov - Russkiy kovcheg aka Russian Ark","uid":6684728,"size":2800440726,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bcbe187ad31480e93670d270bf0e731dd75c5d0d&amp;dn=Aleksandr+Sokurov+-+Russkiy+kovcheg+aka+Russian+Ark&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1316357164,"description":"Aleksandr Sokurov - Russkiy kovcheg aka Russian Ark [+Extras] (2002)\n\nLanguage\tRussian\nSubtitles\tEnglish &amp; French\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0318034&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0318034&lt;/a&gt;\n\nEvery review of &quot;Russian Ark&quot; begins by discussing its method. The movie consists of one unbroken shot lasting the entire length of the film, as a camera glides through the Hermitage, the repository of Russian art and history in St. Petersburg. The cinematographer Tillman Buttner, using a Steadicam and high-def digital technology, joined with some 2,000 actors in an tight-wire act in which every mark and cue had to be hit without fail; there were two broken takes before the third time was the charm.\n\nThe subject of the film, which is written, directed and (in a sense) hosted by Alexander Sokurov, is no less than three centuries of Russian history. The camera doesn't merely take us on a guided tour of the art on the walls and in the corridors, but witnesses many visitors who came to the Hermitage over the years. Apart from anything else, this is one of the best-sustained ideas I have ever seen on the screen. Sokurov reportedly rehearsed his all-important camera move again and again with the cinematographer, the actors and the invisible sound and lighting technicians, knowing that the Hermitage would be given to him for only one precious day.\n\nAfter a dark screen and the words &quot;I open my eyes and I see nothing,&quot; the camera's eye opens upon the Hermitage and we meet the Marquis (Sergey Dreiden), a French nobleman who will wander through the art and the history as we follow him. The voice we heard, which belongs to the never-seen Sokurov, becomes a foil for the Marquis, who keeps up a running commentary. What we see is the grand sweep of Russian history in the years before the Revolution, and a glimpse of the grim times afterwards.\n\nIt matters little, I think, if we recognize all of the people we meet on this journey; such figures as Catherine II and Peter the Great are identified (Catherine, like many another museum visitor, is searching for the loo), but some of the real people who play themselves, like Mikhail Piotrovsky, the current director of the Hermitage, work primarily as types. We overhear whispered conversations, see state functions, listen as representatives of the Shah apologize to Nicholas I for the killing of Russian diplomats, even see little flirtations.\n\nAnd then, in a breathtaking opening-up, the camera enters a grand hall and witnesses a formal state ball. Hundreds of dancers, elaborately costumed and bejeweled, dance to the music of a symphony orchestra, and then the camera somehow seems to float through the air to the orchestra's stage, and moves among the musicians. An invisible ramp must have been moved into place below the camera frame, for Buttner and his Steadicam to smoothly climb.\n\nThe film is a glorious experience to witness, not least because, knowing the technique and understanding how much depends on every moment, we almost hold our breath. How tragic if an actor had blown a cue or Buttner had stumbled five minutes from the end! In a sense, the long, long single shot reminds me of a scene in &quot;Nostalgia,&quot; the 1982 film by Russia's Andrei Tarkovsky, in which a man obsessively tries to cross and recross a littered and empty pool while holding a candle which he does not want to go out: The point is not the action itself, but its duration and continuity.\n\nIt will be enough for most viewers, as it was for me, to simply view &quot;Russian Ark&quot; as an original and beautiful idea. But Stanley Kauffmann raises an inarguable objection in his New Republic review, when he asks, &quot;What is there intrinsically in the film that would grip us if it had been made--even excellently made--in the usual edited manner?&quot; If it were not one unbroken take, if we were not continuously mindful of its 96 minutes--what then? &quot;We sample a lot of scenes,&quot; he writes, &quot;that in themselves have no cumulation, no self-contained point ... Everything we see or hear engages us only as part of a directorial tour de force.&quot; This observation is true, and deserves an answer, and I think my reply would be that &quot;Russian Ark,&quot; as it stands, is enough. I found myself in a reverie of thoughts and images, and sometimes, as my mind drifted to the barbarity of Stalin and the tragic destiny of Russia, the scenes of dancing became poignant and ironic. It is not simply what Sokurov shows about Russian history, but what he does not show--doesn't need to show, because it shadows all our thoughts of that country. Kauffmann is right that if the film had been composed in the ordinary way out of separate shots, we would question its purpose. But it is not, and the effect of the unbroken flow of images (experimented with in the past by directors like Hitchcock and Max Ophuls) is uncanny. If cinema is sometimes dreamlike, then every edit is an awakening. &quot;Russian Ark&quot; spins a daydream made of centuries.\n &lt;a href=&quot;\nhttp://img208.imageshack.us/img208/5016/vlcsnap2010051017h02m53.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img208.imageshack.us/img208/5016/vlcsnap2010051017h02m53.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img687.imageshack.us/img687/2267/vlcsnap2010051017h03m27.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img687.imageshack.us/img687/2267/vlcsnap2010051017h03m27.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img28.imageshack.us/img28/6448/vlcsnap2010051017h03m48.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img28.imageshack.us/img28/6448/vlcsnap2010051017h03m48.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img405.imageshack.us/img405/51/vlcsnap2010051017h32m07.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img405.imageshack.us/img405/51/vlcsnap2010051017h32m07.png&lt;/a&gt;\n\nThe making of RUSSIAN ARK is a story of records and firsts - the first entirely unedited, single screen, single take, full-length feature film; the longest-ever steadicam sequence, the first ever uncompressed HD Movie, recorded onto a portable hard disk system, rather than 35mm or tape.\n\nBut it is the making of a film with a director who is not at all interested in &quot;firsts&quot; and &quot;records&quot; and who has no special fascination for inventing anything &quot;new&quot;. Instead Alexander Sokurov is a director who is concerned with the simple principal elements of cinema: sound, image, time.\n\nWhen we set off on this journey that was to become RUSSIAN ARK, more than four years ago, it sounded novel but straightforward. &quot;I am sick of editing&quot;, Sokurov said, &quot;let's not be afraid of time&quot;. His idea for a one-shot digital film moving in real time through the rooms and halls of the Hermitage seemed wonderfully simple and even easy. Digital video, one shooting day, no editing! A producer's dream. Of course, we were wrong. RUSSIAN ARK was a tour de force - beyond what always turns out to be a tough process. Years of developing an idea that most people could not comprehend or believed impossible to carry out. Months of rehearsals and preparation culminating in a single take of an entire feature film on a single shooting day. A joint crew from Russia and from Germany had to function together symbiotically for a simple adrenaline-pumping moment of sheer filmmaking nerve.\n\nYet, when it was over, it was simple, after all. Sokurov had a vision, which poured out and came together in a single moment. It was all in his head and ninety minutes later, it was all on film. A film that really was cut in the camera. A film that mirrors the flowing of time accurately. Like life, it is impossible to divide time.\n\nRUSSIAN ARK combines state of the art digital technology, strong storytelling, lavish production values and a highly personal mise-en-scene. Sokurov's vision - featuring more than 2000 actors and extras - was realised entirely 'in camera'. After months of careful planning and choreographed rehearsals, the entire film was shot by Tilman BÃƒÂ¼ttner in a single day, in one recording, in a single uninterrupted steadicam sequence. The ultimate 'directors cut', there is no editing as the film unfolds in pure real time.\nPushing the boundaries of filmmaking, RUSSIAN ARK is the first ever uncompressed High Definition movie, recorded onto a portable hard-disk system, rather than 35mm or tape.\nThe Hermitage is the Russian Ark, affectionately guarding art and history until the world sees better days.\n\n---------not my rip--------\n\nFormat : AVI\nFormat/Info : Audio Video Interleave\nFile size : 1.40 GiB\nDuration : 1h 39mn\nOverall bit rate : 2 025 Kbps\n\nVideo\nID : 0\nFormat : MPEG-4 Visual\nFormat profile : Simple@L3\nFormat settings, BVOP : No\nFormat settings, QPel : No\nFormat settings, GMC : No warppoints\nFormat settings, Matrix : Default (H.263)\nCodec ID : XVID\nCodec ID/Hint : XviD\nDuration : 1h 39mn\nBit rate : 1 624 Kbps\nWidth : 704 pixels\nHeight : 384 pixels\nDisplay aspect ratio : 16:9\nFrame rate : 23.976 fps\nResolution : 8 bits\nColorimetry : 4:2:0\nScan type : Progressive\nBits/(Pixel*Frame) : 0.251\nStream size : 1.13 GiB (80%)\nWriting library : XviD 1.1.2 (UTC 2006-11-01)\n\nAudio #1\nID : 1\nFormat : AC-3\nFormat/Info : Audio Coding 3\nCodec ID : 2000\nDuration : 1h 39mn\nBit rate mode : Constant\nBit rate : 192 Kbps\nChannel(s) : 2 channels\nChannel positions : Front: L R\nSampling rate : 48.0 KHz\nStream size : 136 MiB (9%)\nAlignment : Aligned on interleaves\nInterleave, duration : 32 ms (0.77 video frame)\n\nAudio #2\nID : 2\nFormat : AC-3\nFormat/Info : Audio Coding 3\nCodec ID : 2000\nDuration : 1h 39mn\nBit rate mode : Constant\nBit rate : 192 Kbps\nChannel(s) : 2 channels\nChannel positions : Front: L R\nSampling rate : 48.0 KHz\nStream size : 136 MiB (9%)\nAlignment : Aligned on interleaves\nInterleave, duration : 32 ms (0.77 video frame) \n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n                          &lt;a href=&quot;\nhttps://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://board.freakyflicks.org/index.php&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&quot; \n      \n","torrent":{"xt":"urn:btih:bcbe187ad31480e93670d270bf0e731dd75c5d0d","amp;dn":"Aleksandr+Sokurov+-+Russkiy+kovcheg+aka+Russian+Ark","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcbe187ad31480e93670d270bf0e731dd75c5d0d","infoHashBuffer":{"type":"Buffer","data":[188,190,24,122,211,20,128,233,54,112,210,112,191,14,115,29,215,92,93,13]},"announce":[],"urlList":[]}}