{"title":"[FSX/P3D] Basler BT-67 V2 (Custom Release)","uid":10442042,"size":137348731,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bcca23bec49d1783da4f016ac592c9441fd9e753&amp;dn=%5BFSX%2FP3D%5D+Basler+BT-67+V2+%28Custom+Release%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"leopard87","files":-1,"time":1403901096,"description":"Basler BT-67 is a turboprop conversion of the famous Douglas DC-3 by Basler Turbo Conversions. The conversion process includes some changes to the fuselage, wings, systems, cockpit and of course the engines. The end result is a modern turboprop DC-3 with higher payload.\n\nThis is a package I created for fun. The package is based on the freeware Basler BT-67 V2 by Manfred Jahn and colleagues, but I made some modifications to it to make it even better. Here is a list of the changes:\n\n1) HD Gauges R3 (Phase 3) have been added to the aircraft.\n\n2) Sonic Solutions Twin Otter Sound Pack v2.0 has been added to the package. Some sounds have been added/changed.\n\n3) 'Polar 5' livery, which is included in the original BT-67 V2 package, has been replaced with a newer version of the same livery ('Polar 5' V2) by Daniel Fuernkaess (Cheese-Strike Repaints). I don't know what exactly the difference is, but the new version has a dedicated ski model, so it should be better even if there is no other change.\n\n4) Some other liveries have been added to the package.\n\n\nIn my opinion, this package has become the best turboprop DC-3 option for FSX/P3D by a long shot with all these changes. However, don't expect A2A or PMDG quality or you will -naturally- be disappointed.\n\n\nWARNING: If you are going to complain just because this package is mostly based on freeware, the solution is simple: Don't download it and keep your mouth shut! After all, no one is trying to hide anything from you.\n\n\nOTHER NOTES\n\n- While the installer I built lets you install the aircraft in P3D V2, this aircraft was officially released for FSX SP2/Acceleration and P3D v1.4. However, most users report that the aircraft works without any major problem in P3D V2, so I included an option to install it in P3D V2. Try the aircraft in P3D V2 at your own risk!\n\n- By default, the aircraft is overloaded, at least on my computer. This causes aircraft's response to be sluggish. Do NOT forget to adjust your fuel and payload before you fly. You can do this through your simulator's fuel &amp; payload menu, or through the aircraft's 2D pop-up fuel &amp; payload manager while the aircraft is on the ground with the parking brake set on. Refer to the aircraft manual for more information.\n\n- After the installation is complete, the aircraft will appear under the developer name &quot;Manfred Jahn&quot; with the aircraft name &quot;Basler BT-67 V2&quot;. For easy access, the shortcuts to aircraft documents and the uninstaller will be created under Start Menu &gt; Programs &gt; Manfred Jahn &gt; Basler BT-67 V2.\n\nHope you like this package.\n\nSeed and enjoy!","torrent":{"xt":"urn:btih:bcca23bec49d1783da4f016ac592c9441fd9e753","amp;dn":"%5BFSX%2FP3D%5D+Basler+BT-67+V2+%28Custom+Release%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcca23bec49d1783da4f016ac592c9441fd9e753","infoHashBuffer":{"type":"Buffer","data":[188,202,35,190,196,157,23,131,218,79,1,106,197,146,201,68,31,217,231,83]},"announce":[],"urlList":[]}}