{"title":"Diane Cluck - Boneset [2014][EAC/FLAC]","uid":10563895,"size":116847788,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:befd578e5bbd8b5cba88caa954d436000ee2b6d0&amp;dn=Diane+Cluck+-+Boneset+%5B2014%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1405493861,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Important Records #IMPREC 370CD\nCountry: USA\nYear: April 15, 2014\nGenre: Americana,anti-folk\nFormat: CD\n\n\n\n[b]\n\n\n\nMaybe A Bird\nContent To Reform\nDraw Me Out\nNot Afraid To Be Kind\nWhy Feel Alone?\nTrophies\nHeartloose\nSara\n\n\n\n\nComing up as part of the feverishly creative anti-folk scene that blossomed on New York's lower east side in the early 2000s, Diane Cluck represented the more inward looking of the often bratty, overly earnest, or ironic affectations of other players in that scene. The elegantly brief eight songs that make up Boneset represent Cluck's first proper album in eight years, and seventh full-length offering overall. While rushing by at a scant running time of about 22 minutes, Boneset still manages to encapsulate an immense amount of emotional expressions and gorgeous experiments in sound. Somewhere between Joanna Newsom's poetic wordplay, Josephine Foster's recapitulation of traditional U.K. folk and even hints of courtly neo-folk outliers like Current 93, Cluck finds a sound that's somehow hopeful even in its darkest moments. Beginning with the somber cello/acoustic duet &quot;Maybe a Bird,&quot; her crystalline voice soars over the spare instrumentation, mirroring all the explorations of Judee Sill while keeping its distance from the song's dire lyrics. Some tracks are completely a cappella or, as with &quot;Not Afraid to Be Kind,&quot; Cluck's lone voice rings out confidently before being joined by an unexpected trumpet locking in with the tune's slightly jazzy melody and recalling Joni Mitchell's jazz/folk hybrids. The album's climax point &quot;Sara&quot; distills everything great about Cluck's sound into a brilliant highlight, with a playful folk melody as eerie as it is engaging flitting across a minimal but perfectly executed arrangement of acoustic guitar and cello, joined at the last moments by a ghostly glockenspiel line. The song sums up Boneset's fearlessness as well as its hopeful melancholy, never getting so heavy as to obscure the inner joys each song holds.","torrent":{"xt":"urn:btih:befd578e5bbd8b5cba88caa954d436000ee2b6d0","amp;dn":"Diane+Cluck+-+Boneset+%5B2014%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"befd578e5bbd8b5cba88caa954d436000ee2b6d0","infoHashBuffer":{"type":"Buffer","data":[190,253,87,142,91,189,139,92,186,136,202,169,84,212,54,0,14,226,182,208]},"announce":[],"urlList":[]}}