{"title":"The Vampire Diaries S03E19 (2012) DivX (NL subs) CHU","uid":7212851,"size":271660407,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bf2f9a4331bf80fb0db9f4c623058e255045f8d5&amp;dn=The+Vampire+Diaries+S03E19+%282012%29+DivX+%28NL+subs%29+CHU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chamond42","files":-1,"time":1335295291,"description":"The Vampire Diaries S03E19 (2012) DivX (NL subs)Vegas[/b]\n\nFantasy\n\nUitgebracht door........ CW Network\nRegiseur................ Chris Grismer\nSchrijver(s)............ Brian Young &amp; Evan Bleiweiss\nBelangrijkste acteurs... Nina Dobrev, Paul Wesley, Ian Somerhalder\n\nSeizoen 03 Episode 19: Heart of Darkness (uitgezonden op 19 april 2012)\n\n\nIMDb rating: 8/10 http://www.imdb.com/title/tt1405406/\n\n\nSynopsis\nDe altijd jong blijvende vampieren broers Damon en Stefan Salvadore hebben een 'normaal' leven geleid door hun 'bloeddorstigheid' al voor eeuwen voor iedereen goed verborgen te houden en steeds weer verhuizend voordat het niet ouder worden van de broers wordt gemerkt.\nZij zijn terug in Virginia Town waar zij als middelbare scholieren vampieren werden.\nStefan heeft een edel karakter en onthoudt zichzelf van bloed om doden te voorkomen en probeert zijn duivelse broer Damon onder controle te houden.\nStefan wordt verliefd op het schoolmeisje Elena wier beste vriendin is een heks zoals ook haar grootmoeder er een was. \n\nepisode 19.\nElena en Damon gaan samen Jeremy terughalen uit Denver. Stefan wilde dat Damon met haar meeging omdat hij vreest dat Elena gevoelens heeft voor Damon en hij de moeite niet wil doen zijn bloedlust te beheersen voor niets. Stefan blijft ondertussen bij Alaric omdat zijn alter ego de laatste staak heeft verborgen en Klaus deze ten koste wil hebben. Ondertussen daagt Esther op in Klaus' huis en sterft in Rebekah's handen. Damon gaat op zoek naar de vroegste vampier die hij kent van zijn lijn, maar wanneer hij daar aankomt heeft Cole haar al vermoordt. Jeremy maakt zich zorgen over Elena maar de geest van Rose vertelt hem dat hij het moet laten omdat Elena Damon in een zeker opzicht nodig heeft. Wanneer Alaric de schuilplaats van de laatste staak bekend heeft gemaakt moet hij ze met Rebekah gaan halen. Maar toen Esther stierf is haar geest overgegaan in Rebekah's lichaam en ze wil doorgaan met het plan om alle originals te laten verdwijnen. \n\nCategorie.......... Fantasy/Horror\nSource............. DVDRip\nRuntime............ 41:51 minutes\nSize............... 259 MB\nForm............... DivX AVI\nResolution......... 624x352\nFrames/s........... 23\nTransmission speed. 125 Kbits/sec\nAudio Language..... English\nAudio code......... Stereo 48kHz\nSubtitles: Dutch - Nederlands\n  \n\nSynopsis\nThe vampire brothers Damon and Stefan Salvatore, eternal adolescents, having been leading 'normal' lives, hiding their bloodthirsty condition, for centuries, moving on before their non-aging is noticed. They are back in the Virginia town where they became vampires, as high school students. Stefan is noble, denying himself blood to avoid killing, and tries to control his evil brother Damon. Stefan falls in love with schoolgirl Elena, whose best friend is a witch, like her grandma.\n\nby chamond \n\n\n","torrent":{"xt":"urn:btih:bf2f9a4331bf80fb0db9f4c623058e255045f8d5","amp;dn":"The+Vampire+Diaries+S03E19+%282012%29+DivX+%28NL+subs%29+CHU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf2f9a4331bf80fb0db9f4c623058e255045f8d5","infoHashBuffer":{"type":"Buffer","data":[191,47,154,67,49,191,128,251,13,185,244,198,35,5,142,37,80,69,248,213]},"announce":[],"urlList":[]}}