{"title":"Toadies - Rubberneck (1994) 320kbps","uid":3401017,"size":74457653,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bfc3e073a1e2d3260b8c429ab683b89dd23ede6d&amp;dn=Toadies+-+Rubberneck+%281994%29+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Micky Ficky","files":1,"time":1130209090,"description":"Location:  \tFort Worth  TX\nUnited States of America \t\nMembers: \tTodd\nLisa\nMark\nClark\n\t\nWebsite: \thttp://www.thetoadies.com/ \t\nDescription: \t\n\nThe Toadies started playing gigs in a small coffee house in Fort Worth called Madhatters on Magnolia Street. I tis now closed and the owner is running a club called The Engine Room on East Vickery which The Toadies occasionally play at because they are such good friends with the owner. Lisa also used to work at the YMCA where a lot of fans know her from. They are not only a GREAT band but they are also kind people!!\n\nThe Toadies were formed in Ft. Worth, Texas in 1990. Their locally released tape &quot;Velvet&quot; attracted indie label attention upon its release in `92. The Toadies were the first band signed to Dutch East India's Grass Records and released the CD &quot;Pleather&quot; and the 7-inch &quot;Mister Love.&quot; &quot;Pleather&quot; attracted plenty of label interest in `93 and after a showcase at the Whiskey, the group was signed on the spot by Interscope Records. The band's debut Interscope release, Rubberneck, pulls in some heavyweights. The album was recorded and produced by Tom Rothrock and Rob Schnapt (Beck, Wool), and mixed by Andy Wallace, who worked on Nirvana's Nevermind and Helmet's Meantime. Songs from Rubberneck include: &quot;Mexican Hairless,&quot; &quot;Mister Love,&quot; &quot;Backslider,&quot; &quot;Possum Kingdom,&quot; &quot;Quitter,&quot; &quot;Away,&quot; &quot;I Come From The Water,&quot; &quot;Tyler,&quot; &quot;Happyface,&quot; &quot;Velvet&quot; and &quot;I Burn.&quot; The Toadies won The Dallas Observer Readers' Poll for Best Rock Act in `93 and `94 and Best Alternative Rock Act in `94! The Observer goes on to say &quot;the Toadies are the future of rock`n'roll.&quot; Meanwhile, The Dallas Morning News describes the band as recalling &quot;The Pixies, if they secretly wanted to be Metallica.&quot;\n\nThe band toured incessantly for almost two and a half years in support of Rubberneck. Touring with bands like The Red Hot Chili Peppers, The Butthole Surfers, The Reverend Horton Heat, Supersuckers, Bush (yech), and Dallas bands and good buds -- Baboon and Brutal Juice. All the bands hard work paid off when the record went gold and eventually platinum. The Toadies contributed several songs to soundtracks including Escape from L.A., The Cable Guy, The Crow -- City of Angels, . and more.\n\nBefore beginning work on their second full length album, the band parted ways with guitar player Darrell Herbert. Clark Vogeler from the defunct Dallas band, Funland, was brought on board to fill the spot. The band is currently working on material for the new record in their rehearsal studio in Dallas. They expect to have the album recorded and mixed by spring. that is all we know at this point.\n\nInteresting Things about the Band Members*\nTodd: was once married to a famous hippyish female vocalist from dallas. many toadies songs derive from this experience.\nLisa: as a kid was cast as an Ewok in the Return of the Jedi motion picture. she earned $813.00 for three days work. she used this money to buy her first bass.\nMark: spent most of his earlier life as a ranch hand. he raised animals. his favorite duty was, of course, milking the family cow.\nClark: his father was the actor whose construction hat was glued to a beam in the Super Glue ads during the early eighties.","torrent":{"xt":"urn:btih:bfc3e073a1e2d3260b8c429ab683b89dd23ede6d","amp;dn":"Toadies+-+Rubberneck+%281994%29+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfc3e073a1e2d3260b8c429ab683b89dd23ede6d","infoHashBuffer":{"type":"Buffer","data":[191,195,224,115,161,226,211,38,11,140,66,154,182,131,184,157,210,62,222,109]},"announce":[],"urlList":[]}}