{"title":"Perspective - The Science of Art","uid":7775026,"size":4089505852,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c0b0c15821931616c180d3dba45cc5efefeee1d9&amp;dn=Perspective+-+The+Science+of+Art&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mindscrap","files":-1,"time":1351631554,"description":"A trained artist must master perspective like a writer masters grammar. This series of perspective lectures is the definitive source for learning how to draw anything that exists in space. They are not slick productions; they are Marshall and a chalkboard. These videos are the best way we know to learn how to draw professionally. Master the content of these tapes and you master everything an artist needs to know on the subject of perspective.\n\n\nThe Professional Approach to Learn How to Draw\n\nA trained artist must master perspective like a writer masters grammar. This series of perspective lectures is the definitive source for learning how to draw anything that exists in space. They are not slick productions; they are Marshall and a chalkboard. These videos are the best way we know to learn how to draw professionally. Master the content of these tapes and you master everything an artist needs to know on the subject of perspective.\n\nLECTURE #1:\nINTRO TO PERSPECTIVE\n\nThis lecture is an overview of the course. It explains what perspective is, why it's difficult, and how to simplify to make it useful. Marshall defines the terms you will need for the course and gives the five ways artists create the illusion of depth on a flat surface.\n\nLECTURE #2:\nRIGHT ANGLES PART 1\n\nThis lecture demonstrates why parallel lines seem to meet in the distance. You will understand why the horizon and your eye level are always the same thing. You will also see that if you can draw a cube, you can draw practically anything.\n\nLECTURE #3:\nRIGHT ANGLES PART 2\n\nLearn why camera lenses have different focal lengths and how whenever you make a picture, you are giving your viewer a wide-angle, normal or telephoto view of the subject by placing your vanishing points. This is the secret of distorting and exaggerating an object.\n\nLECTURE #4:\nRIGHT ANGLES PART 3\n\nLearn the &quot;structural approach&quot; to drawing that lets you &quot;see through&quot; objects and draw the unseen lines. This same approach allows you to draw groups of people in open spaces and keep their apparent sizes consistent as they become distant. Also learn the two hazards of applying this and how to overcome them.\n\nLECTURE #5:\nCIRCLES &amp; ELLIPSES PART 1\n\nCircles are everywhere, and ellipses are circles in perspective. Poorly constructed ellipses are one of the quickest giveaways of the untrained artist. This demonstration shows you how you can construct a precise ellipse and how you can improve your freehand drawings of anything that has circular sections.\n\nLECTURE #6:\nCIRCLES &amp; ELLIPSES PART 2\n\nThis demonstration will show you how to overcome the two most baffling problems beginners have in trying to put wheels on cars or knobs on doors: finding the center of the circle in space and placing the angle properly. In less than an hour, these problems will be solved for the rest of your career.\n\nLECTURE #7:\nCIRCLES &amp; ELLIPSES PART 3\n\nDials, gears and designs on cans or vases are not solved by guesswork. They can be drawn accurately and confidently. This lecture shows how to master any round form, whether industrial or natural, by learning to wrap lines around a sphere.\n\nLECTURE #8:\nCIRCLES &amp; ANGLES COMBINED\n\nDoors, box flaps and even human limbs create new drawing problems because they swing on a hinge. They are solved by combining all the material covered in the course so far.\n\nLECTURE #9:\nINCLINED PLANES &amp; THE VANISHING TRACE\n\nAny surface that is not level needs its own horizon line and vanishing points. How do you find them? This lecture will show you that the &quot;vanishing trace&quot; is all you need to draw rooftops, stairways and any other surfaces that slant up or down.\n\nLECTURE #10:\nDEPTH MEASURING SYSTEMS PART 1\n\nThis lecture covers three of the five ways to &quot;measure back into space&quot; on the flat surface of your paper. The first two are simple and quick, but limited. The third system allows you to precisely draw picket fences, floor tiles, or anything that recedes with regular measurements.\n\nLECTURE #11:\nDEPTH MEASURING SYSTEMS PART 2\n\nThis is a demonstration of the more advanced systems that will allow you to place any complex and irregular set of measurements onto a wall or a floor or a stairway and know where to place every point. The final system is surprisingly easy when you know about the &quot;special vanishing point.&quot;\n\nLECTURE #12:\nPLAN PROJECTION\n\nHow does a 3D program let you see an imaginary object from any angle? It uses the same method artists have used for hundreds of years. Learn how a top, side and front view can be used to draw an object from any point of view.","torrent":{"xt":"urn:btih:c0b0c15821931616c180d3dba45cc5efefeee1d9","amp;dn":"Perspective+-+The+Science+of+Art","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0b0c15821931616c180d3dba45cc5efefeee1d9","infoHashBuffer":{"type":"Buffer","data":[192,176,193,88,33,147,22,22,193,128,211,219,164,92,197,239,239,238,225,217]},"announce":[],"urlList":[]}}