{"title":"pavlos sidiropoulos-discography+symmetoxes+radiofoniki synenteyk","uid":4192051,"size":1745255356,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c18cf643fb62c88c5187a3eada75e1c77c1c22bd&amp;dn=pavlos+sidiropoulos-discography%2Bsymmetoxes%2Bradiofoniki+synenteyk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lioblakaras","files":333,"time":1211019423,"description":" O Paylos Sidhropoylos o shmantikoteros ekproswpos ths Ellhnikhs rok, htan diseggonos toy Zormpa kai anhpsios ths Ellhs Aleksioy. Se aytes tis dyo diaforetikes toy rizes eblepe thn aitia ths synyparkshs se ayton toy rocker kai toy skeptikisth.\n\nO P.S. gennhthhke stis 20/7/1948 (h 28/7/1948, oi phges moy diafwnoyn) sthn Athhna kai ws ta epta toy xronia ezhse sthn Thessalonikh. O pateras toy eixe erthei apo ton Ponto kai katelhkse sthn Athhna opoy anoikse ergostasio paragwghs xartioy gia fwtografies.\n\nKsekinhse thn kariera toy to 1970 apo th Thessalonikh opoy eixe paei gia spoydes sto Mathhmatiko. Ekei gnwrizei ton Pantelh Dellhgiannidh (kitharista twn Olympians) kai ftiaxnoyn to ntoyeto &quot;Damwn kai Fintias&quot;. Kykloforoyn to 7&quot; &quot;To ksespasma/O kosmos toys&quot; kai symmetexoyn me dyo kommatia sto disko &quot;Zwntanoi sto Kyttaro&quot;.\n\nSto Kyttaro gnwrizontai kai me ta &quot;Mpoyrmpoylia&quot; poy epaizan me ton Sabbopoylo. To ntoyeto enswmatwnetai me ta &quot;Mpoyrmpoylia&quot; kai to neo sxhma (P.S., fwnh, Pantelhs Dellhgiannidhs,kithara, Nikos Tsilogiannhs, ntrams, Basilhs Ntalas, mpaso) bgazei ena 7&quot;, to &quot;O Ntamhs o lhsths&quot; logokrimeno se &quot;O Ntamhs o sklhros&quot;. Mazi einai apo to 1972 ews to 1974.\n\nMe ayto to sxhma o Paylos Sidhropoylos arxise ta prwta toy peiramata gia na pantrepsei to rok me thn Ellhnikh moysikh.O Panos Hliopoylos grafei xarakthristika sto shmeiwma toy diskoy &quot;Ta mployz toy prigkipa&quot;:\n\n&quot;omws an gyrisoyme arketa xronia pisw tha broyme ton Paylo mazi me ta &quot;Mpoyrmpoylia&quot; na doyleyoyn panw se ena ROCK me ethnika stoixeia. Tzamarismata - me thn plhrh ennoia toy oroy - poy epairnan thn morfh mias poly MEGALHS ELLHN?KHS MOYS?KHS. Htan tote poy o Nikos sta tympana kai o Basilhs sto mpaso kratagan ena tempo poy omoio toy den akoysthke pote ksana apo Ellhnikh mpanta... Htan tote poy sthn kithara htan o Pantelhs... Htan tote poy h fwnh toy Payloy rokarize panw stis moysikes mnhmes ths Thrakhs, ths Hpeiroy kai ths Smyrnhs... Htan tote poy o Paylos arxize na fanerwnei oxi mono thn agaph toy gia thn Ellhnikh moysikh alla kai thn APOPsH toy. Mia apopsh sobarh poy pote den katafere na paroysiasei - opws aytos oramatizotan - sto koino toy.&quot;\n\nKatw apo antiksoes synthhkes (oi arxes ths diktatorias toys xarakthrizoyn epikindynoys kai apoblhtoys) to sxhma dialyetai kai ta &quot;Mpoyrmpoylia&quot; akoloythoyn ton Dionysh Sabbopoylo. Katopin synergasthke me ton Giannh Markopoylo, ws tragoydisths, sta erga toy &quot;Oropedio&quot; kai &quot;Thessalikos kyklos&quot;.\n\nTo 1976 mazi me toys aderfoys Spyropoyloys eftiakse to gkroyp &quot;Spyridoyla&quot;. Me ayto to sxhma dhmioyrghse ton shmantikotero isws disko sthn periergh istoria toy Ellhnikoy rock to &quot;Floy&quot;. Aksizei pisteyw na shmeiwsoyme pws gia ton disko ayto o P.S. den ypegrapse symbolaio alla ena &quot;xarti&quot; poy egrafe oti apopoieitai pashs oikonomikhs apaithsews apo ton disko. H &quot;Spyridoyla&quot; ypegrapse symbolaio ektelestoy me pososto 4% . To sxhma dialyetai afhnontas pisw toy enan oloklhrwmeno rock hxo kai mia seira synayliwn.\n\nTo 1979 mazi me Papantina, Nestora, Tzimopoylo (palia melh Makedonomaxwn, IDOLS k.a.) ftiaxnei to sxhma &quot;Etairia Kallitexnwn&quot; me aggliko stixo. To sxhma ayto den kykloforei disko. Ena omws tragoydi apo aythn thn periodo perilambanetai ston katopino toy disko &quot;Zorba the freak&quot; prokeitai gia to tragoydi &quot;Clown&quot;.\n\nEkeinh thn periodo kanei kai thn prwth toy emfanish ston kinhmatografo, prwtagwnistwntas sthn tainia toy Antrea Thwmopoyloy &quot;O Asymbibastos&quot; opoy kai ermhneyei ta tragoydia toy soundtrack. Ton idio kairo prwtagwnistei kai se mia akomh tainia toy Antrea Thwmopoyloy me titlo &quot;Aldebaran&quot; kai me symprwtagwnisth ton Dhmhtrh Poylikako, h opoia problhthhke mono sto Festibal Thessalonikhs. Sthn mikrh kariera toy ws hthopoioy perilambanetai kai mia thleoptikh emfanish sto shrial toy Kwsta Ferrh &quot;Oikogeneia Zarnth&quot; poy problhthhke sthn ERT-1.\n\nH synexhs allagh synergatwn stamataei to 1980 opoy o P.S. katalhgei se ena sxhma poy me liges allages paizei mazi toy mexri to telos, toys &quot;APROSARMOSTOYS&quot;. Mazi hxografoyn mia seira shmantikwn diskwn kai me synexh paroysia mesw zwntanwn emfanisewn dhmioyrgoyn ton mytho enos pragmatikoy Ellhnikoy rock sygkrothmatos, makrya apo erasitexnismoys kai mimhtismoys. To 1982 kykloforoyn to &quot;En leykw&quot; me arketes anafores sthn empeiria toy me thn hrwinh (gia allh mia fora antimetwpizei problhmata logokrisias. Me ta tragoydia &quot;H&quot; kai &quot;Antargkraoynt me stras&quot; gia protroph sth xrhsh narkwtikwn kai &quot;Ystath stigmh&quot; gia prosbolh ths dhmosias aidoys).\n\nTo 1985 kykloforoyn to &quot;Zorba the freak&quot; ena disko mpoliasmeno me to xioymor toy Dhmhtrh Poylikakoy poy exei kanei thn paragwgh.\n\nTo 1989 kykloforei to &quot;Xwris makigiaz&quot; poy einai enas diskos hxografhmenos zwntana sto Metro. Ta tragoydia aytoy toy diskoy to sygkrothma ta epaize ta prohgoymena xronia stis zwntanes toy emfaniseis ( kyriws sto club &quot;An&quot; sta Eksarxeia monimo steki twn teleytaiwn xronwn ). Ton disko ayto xarakthrizoyn ta blues kommatia poy panw stis stenes toy formes o P.S. ekfrazetai me ton diko toy tropo.\n\nTo kalokairi toy 1990 ksafnika arxise na paralyei to deksi toy xeri. Oi giatroi ypethetan problhma sta aggeia, alla kaneis den hksere ti akribws eixe. Ayth h istoria ton ekane psyxologiko rakos. To fthinopwro to sygkrothma arxise tis synhthismenes toy emfaniseis sto An. O Paylos arxise na emfanizetai me to xeri demeno.\n\nExontas arketa nea tragoydia (ta opoia stadiaka paroysiazan sto koino twn synayliwn) kai merika palia akykloforhta se nees enorxhstrwseis (to sygkrothma peiramatizotan me funk stoixeia ston hxo toy) arxisan na hxografoyn to yliko ayto, enw sygxronws eixan programmatisei seira zwntanwn emfanisewn gia to Dekembrio.\n\nOmws to apogeyma ths 6hs Dekembrioy o Paylos Sidhropoylos pethainei apo xrhsh hrwinhs sto patriko toy spiti. Khdeyetai ston Kokkino Mylo.\n\n","torrent":{"xt":"urn:btih:c18cf643fb62c88c5187a3eada75e1c77c1c22bd","amp;dn":"pavlos+sidiropoulos-discography%2Bsymmetoxes%2Bradiofoniki+synenteyk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c18cf643fb62c88c5187a3eada75e1c77c1c22bd","infoHashBuffer":{"type":"Buffer","data":[193,140,246,67,251,98,200,140,81,135,163,234,218,117,225,199,124,28,34,189]},"announce":[],"urlList":[]}}