{"title":"History Undercover - Nazi POWs In America (2002) x264-mkv","uid":8897850,"size":876916631,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c1d9b6c94aa90511ca4cf9b6acf76cd390adddb0&amp;dn=History+Undercover+-+Nazi+POWs+In+America+%282002%29+x264-mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SebReSpawN","files":1,"time":1378744433,"description":"Found it laying around and ripped it from original DVD for anyone who is interested! History Channel description below:\n\nHere is the untold story of the nearly 380,000 German prisoners held on US soil during World War II.\n\n\nEvery war creates prisoners, and the question of how to manage POWs is one of the most vexing faced by the nation taking them. In World War II, with its presence in Europe limited to strategically important military bases and their allies already overtaxed, the United States made the decision to send German POWs to secure, remote locations in the homeland.\nNAZI POWS IN AMERICA travels the country to tell the little-known story of these formerly top-secret facilities. Find out how US planners prepared for a few thousand detainees and ended up being flooded with as many as 7,200 a week. Hear from former Nazi prisoners and their American guards about life in the camps, where kangaroo courts, secret murders and violent factions thrived in the absence of adequate (or often any) supervision. The program also shows the other side of the prisoners' existence, featuring the extraordinary paintings and carvings they created during their incarceration.\nFrom the initial decision to ship prisoners to the US directly from the battlefield to the mixed reactions they engendered once here, NAZI POWS IN AMERICA explores every aspect of one of the most unusual tales from the Second World War.","torrent":{"xt":"urn:btih:c1d9b6c94aa90511ca4cf9b6acf76cd390adddb0","amp;dn":"History+Undercover+-+Nazi+POWs+In+America+%282002%29+x264-mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1d9b6c94aa90511ca4cf9b6acf76cd390adddb0","infoHashBuffer":{"type":"Buffer","data":[193,217,182,201,74,169,5,17,202,76,249,182,172,247,108,211,144,173,221,176]},"announce":[],"urlList":[]}}