{"title":"Ladytron - Ace Of Hz Remixes Proper (2011) vtwin88cube","uid":6121521,"size":74970512,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c2902f57d5d316e68b5bcd72b5108dae44a3f966&amp;dn=Ladytron+-+Ace+Of+Hz+Remixes+Proper+%282011%29+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1295771583,"description":"Ladytron\nAce Of Hz Remixes (2011)\n\nBuzzy glam rock fashion plates Ladytron came together in a jet-set miracle in mid-1998. Daniel Hunt and Reuben Wu, who lurk in the background playing rhythm boxes and keyboards in the band, settled in Liverpool after a spate of DJ work in Japan and world travel, including a train trip in Bulgaria where they met vocalist Mira Aroyo. Helena Marnie, who also sings and plays keyboards for the group, also joined them and they began work on their first single, &quot;He Took Her to a Movie,&quot; which was recorded for 50 pounds. The release brought a wave of critical attention with writers extending into jubilant metaphor to describe the band's unique sound, including one who wrote that they were &quot;...a teasing glimpse of how Britney Spears might have sounded, had she been born in the GDR and a heroin addict.&quot; \n\nLadytron toured throughout the continent before beginning work on their debut EP, Commodore Rock, which was released in the summer of 2000, providing their fans another foray into the noisy world of early-'80s sound. The studio full-length 604 followed a year later, and gained many positive reviews. 2002 saw the release of Light &amp; Magic and the mix album Softcore Jukebox. The group returned in the summer of 2005 with the Sugar single, which heralded the rock edge of Ladytron's third album, Witching Hour. Extended Play, which featured remixes of Witching Hour's singles, arrived the following spring. Ladytron moved to Nettwerk for their fourth album, Velocifero, which they produced themselves. \n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tDance\t\nM3U Playlist:\t\tYes\n\n01.Ace Of Hz (Album Version)\n02.Ace Of Hz (Punks Jump Up Remix)\n03.Ace Of Hz (TiÃƒÂ«sto Remix)\n04.Ace Of Hz (TiÃƒÂ«sto Remix Radio Edit)\n05.Ace Of Hz (NYC Party Info Remix)\n06.Ace Of Hz (Punks Jump Up Dub Remix)\n\n\nEnjoy!","torrent":{"xt":"urn:btih:c2902f57d5d316e68b5bcd72b5108dae44a3f966","amp;dn":"Ladytron+-+Ace+Of+Hz+Remixes+Proper+%282011%29+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2902f57d5d316e68b5bcd72b5108dae44a3f966","infoHashBuffer":{"type":"Buffer","data":[194,144,47,87,213,211,22,230,139,91,205,114,181,16,141,174,68,163,249,102]},"announce":[],"urlList":[]}}