{"title":"Sniper Elite V2-SKIDROW","uid":7240501,"size":5506117200,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c29209b68c2a07f51abdbc7395036db131e6a00d&amp;dn=Sniper+Elite+V2-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"beljac","files":-1,"time":1336120264,"description":"Screens:\n  &lt;a href=&quot;\nhttp://www.postimg.com/image/69000/photo-68761.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.postimg.com/image/69000/photo-68761.jpg&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.postimg.com/image/69000/photo-68762.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.postimg.com/image/69000/photo-68762.jpg&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.postimg.com/image/69000/photo-68763.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.postimg.com/image/69000/photo-68763.jpg&lt;/a&gt;\n\nSniper Elite V2-SKIDROW\nSniper Elite V2 (c) Rebellion\n\n02-05-2012....Release Date  Protection...............Steam+CEG\nFPS..............Game Type  Disk(s)......................1 DVD\n\nRELEASE NOTES\n\nSniper Elite V2 is the eagerly-awaited sequel to the highly-acclaimed\nSniper Elite, giving gamers the most authentic World War II sniping\nexperience available. You are elite US sniper Karl Fairburne\nParachuted into Berlin amidst the Germans final stand, your mission is\nto prevent Nazi V2 rocket program technology from falling into the\nhands of the besieging Red Army. You must aid key scientists keen to\ndefect to the US, and terminate those who would help the Russians\n\nTake advantage of authentic weaponry, learn how to stalk your targets\nfortify your position, set up the shot, use your skill, patience and\ncunning to achieve your mission. Stealth gameplay is the key as you\nfind yourself trapped between two desperate armies in a race against\ntime. Watch as the celebrated &quot;bullet cam&quot; from Sniper Elite returns\nbloodier and more gruesome than ever - skilful shots are rewarded with\na slow-motion flight of the bullet, then targets are graphically\nrendered in X-Ray as the bullet enters and destroys your victim. Organs\nshred, bones splinter, teeth shatter, as the true impact of the\nsniper's bullet is brought to life\n\nAs World War Two ends and the Cold War begins, every shot counts. Use\nit wisely\n\nFeatures:\n\nSniping Simulation - Sniper Elite V2 features detailed sniping\nsimulation with advanced ballistics, taking into account gravity, wind\nvelocity, bullet penetration, aim stability and more. Guaranteed to\nprovide players with the most realistic simulation of military\nsharpshooting yet available\n\nX-Ray Kill Cam - Amazing &quot;kill cam&quot; technology showcases what really\nhappens when a bullet enters an enemy s body, allowing players to see\nhearts and lungs tear, livers burst, and bones shatter\n\nAuthenticity - The game features authentic World War II Berlin\nlocations as well as vehicles, weapons such as the Springfield M1903\nthe Gewehr 43 and the Mosin-Nagant 1891/30, and uniforms modeled after\nthe original versions\n\nUse the Environment - The slightest changes in the environment need to\nbe taken into account to move into the perfect position, observe the\nquarry, take the shot and slip away unnoticed\n\nSniper's Choice - Players will often find themselves facing a choice of\nthe perfect shot that leaves them catastrophically exposed or a more\ndifficult route that means they can continue their mission\n\nINSTALL NOTES\n\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy!\t\t","torrent":{"xt":"urn:btih:c29209b68c2a07f51abdbc7395036db131e6a00d","amp;dn":"Sniper+Elite+V2-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c29209b68c2a07f51abdbc7395036db131e6a00d","infoHashBuffer":{"type":"Buffer","data":[194,146,9,182,140,42,7,245,26,189,188,115,149,3,109,177,49,230,160,13]},"announce":[],"urlList":[]}}