{"title":"Asterix e i Goti [Cbr - ITA] [TntVillage]","uid":5306932,"size":239114949,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c3c3ae2f27bc9736df5108344346a6544984ee72&amp;dn=Asterix+e+i+Goti+%5BCbr+-+ITA%5D+%5BTntVillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":14,"time":1264429295,"description":" Asterix e i Goti\n\n by trappone\n\n - Cover of Manga/Albo - \n\n Visit this link: http://img386.imageshack.us/my.php?image=0001cd5.jpg Visit this link: http://g.imageshack.us/thpix.php\n\n - Exsample screen - \n\n Visit this link: http://img220.imageshack.us/my.php?image=scan001ul3.jpg Visit this link: http://g.imageshack.us/thpix.php Visit this link: http://img181.imageshack.us/my.php?image=scan007ei4.jpg Visit this link: http://g.imageshack.us/thpix.php Visit this link: http://img181.imageshack.us/my.php?image=scan017jm5.jpg Visit this link: http://g.imageshack.us/thpix.php\n\n - Other informations - \n\nAuthor: Goscinny e Uderzo \nFormat: (se archivio formato dell'archivio e de/i file contenuti): .cbr\n\n - Plot - \n\nAsterix \nIl protagonista, ÃƒÂ¨ il guerriero piÃƒÂ¹ valoroso del villaggio. Piccolo, ma astuto e molto coraggioso, Asterix, insieme all'inseparabile amico Obelix ÃƒÂ¨ sempre pronto a mille avventure per difendere il loro piccolo villaggio o per sbeffeggiare il conquistatore romano. Grazie alla pozione magica del druido Panoramix puÃƒÂ² acquisire una forza sovrumana per circa dieci minuti. \nScapolo incallito (non mostra praticamente mai interesse per una donna), nei vari numeri in cui si sviluppa la serie Asterix si ritrova ad affrontare le situazioni piÃƒÂ¹ diverse. Sempre contro il conquistatore romano, Asterix ama beffarsi degli accampamenti che circondano il villaggio degli &quot;irriducibili&quot; e si intromette anche nella vita romana al di fuori della Gallia. Viaggia per tutto il mondo arrivando anche in America. Se non beve la pozione, Asterix deve affidarsi alla sua abilitÃƒÂ  con la spada (al contrario di Obelix, che gira sempre disarmato). \nObelix \nGrande amico di Asterix, di cui ÃƒÂ¨ l'inseparabile compagno d'avventura, Obelix ÃƒÂ¨ dotato di una forza sovrumana, perchÃƒÂ© da piccolo ÃƒÂ¨ caduto nel paiolo in cui il druido Panoramix stava preparando la sua pozione magica. Costruisce e commercia menhir, e passa il suo tempo libero a chiacchierare e passeggiare con Asterix, a cacciare cinghiali e a fare a botte con i legionari romani. ÃƒË† un bonaccione di buon carattere e dall'insaziabile appetito e non c'ÃƒÂ¨ niente che ami di piÃƒÂ¹ di un buon banchetto intorno al fuoco con tutti i suoi amici e tanti cinghiali arrosto. E naturalmente picchiare i Romani. La sua celebre frase, che pronuncia ogni qualvolta ha a che fare con i Romani ÃƒÂ¨: Sono Pazzi Questi Romani, acronimo dovuto al traduttore Marcello Marchesi. Il suo appetito ÃƒÂ¨ venuto meno solo una volta perchÃƒÂ© si era preso una cotta per FalbalÃƒÂ . \nIdefix \nÃƒË† il cane di Obelix, un piccolo cagnolino di razza indefinibile (vagamente assomigliante a un fox terrier). ÃƒË† bianco, munito di piccoli &quot;baffi&quot; come il suo padrone (Obelix) e con le punte delle orecchie e della coda nere. Coraggioso, deciso, intelligente e audace, nonostante la piccola taglia Idefix non si fa mettere i piedi in testa da nessuno ed ÃƒÂ¨ capace di difendere sÃƒÂ© stesso, il villaggio e i suoi amici. Come il suo padrone, ama combattere i Romani, cosa che generalmente fa morsicandoli sul sedere. Idefix ÃƒÂ¨ un cane ecologista e non puÃƒÂ² sopportare quando viene abbattuto un albero. Se succede piange e si lascia andare a una serie di allucinanti ululati di disperazione. \nIl debutto di Idefix risale all'episodio Asterix e il Giro di Gallia, nel quale il cagnolino inizia a seguire i due protagonisti nel loro tour senza essere notato, e solo al ritorno nel villaggio emetterÃƒÂ  i primi latrati attirando l'attenzione di Obelix. \nIl nome Idefix fu scelto per mezzo di un sondaggio tra i lettori di Pilote, il periodico francese che pubblicava le avventure di Asterix \nIn alcune storie il suo nome viene tradotto in italiano come Ercolino. ÃƒË† interessante notare che il nome in francese si pronuncia esattamente come idÃƒÂ©e fixe (idea fissa), un gioco di parole comune a tutti i personaggi della saga. \nPanoramix \nÃƒË† il druido del villaggio. La sua specialitÃƒÂ  ÃƒÂ¨ la pozione magica, che dona una temporanea forza sovrumana a colui che la beve. ÃƒË† anche in grado di preparare altre pozioni, contravveleni e scherzi, come una pozione estremamente potente per far crescere rapidamente e senza posa barba e capelli. \nGiulio Cesare \nIspirato al personaggio storico di Gaio Giulio Cesare, il dittatore viene rappresentato ironicamente e, come tutti i romani del fumetto, si esprime in romanesco nella versione italiana. ÃƒË† ossessionato dalla presenza del villaggio di Asterix, unica sacca di resistenza al dominio romano sulla Gallia, ma nelle ultime storie si mostra piÃƒÂ¹ aperto e finisce per sviluppare prima rispetto e quindi addirittura amicizia nei confronti dei galli. \n - Acknowledgment(s) - \n\nringrazio aquila della notte-hdraka dcp-italia senza di loro non potreste leggere questi albi :ok0:  :smokeing: \n\n \n - Note - \n\nOrario di seed e banda disponibile\nrimango in sed dalle 18 alle 06  \nbanda disponibile 10/20kbs\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:c3c3ae2f27bc9736df5108344346a6544984ee72","amp;dn":"Asterix+e+i+Goti+%5BCbr+-+ITA%5D+%5BTntVillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3c3ae2f27bc9736df5108344346a6544984ee72","infoHashBuffer":{"type":"Buffer","data":[195,195,174,47,39,188,151,54,223,81,8,52,67,70,166,84,73,132,238,114]},"announce":[],"urlList":[]}}