{"title":"The Sims 4 update ver 1.10.57.1020 + SPA DAY DLC Mr DJ ","uid":12302392,"size":4209087451,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c433c03261705091fd1719daccd8bfe888a052ab&amp;dn=The+Sims+4+update+ver+1.10.57.1020+%2B+SPA+DAY+DLC+Mr+DJ+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rock840","files":4,"time":1440722137,"description":"The Sims 4 RELOADED update version 1.10.57.1020 + SPA DAY DLC Mr DJ \n\n\nThis is meant for those who have my &quot;The Sims 4 repack Mr DJ&quot; :\nThe Sims 4 Deluxe Edition [v1.5.139.1020]+DLCs repack Mr DJ &lt;a href=&quot;\nhttps://thepiratebay.mn/torrent/11802663/The_Sims_4_Deluxe_Edition_[v1.5.139.1020]_DLCs_repack_Mr_DJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.mn/torrent/11802663/The_Sims_4_Deluxe_Edition_[v1.5.139.1020]_DLCs_repack_Mr_DJ&lt;/a&gt;\n\nOR\n\nIf u have The.Sims.4-RELOADED\n\nOR\n\nIf u have any other release apart from RELOADED, just make sure it's atleast or above update version 1.0.732.20 (1.0.797.20 OR 1.2.16.10 OR 1.3.32.1010 OR 1.5.139.1020 OR 1.7.65.1020 ......\n\n NOTE: This addon release is all-inclusive and includes all previous updates\n and DLCs. The previously unreleased DLCs 'Perfect Patio Stuff' and\n 'Cool Kitchen Stuff' have been included as a bonus.\n\n The Sims 4 Spa Day provides an all new type of venue, the Spa, where Sims \n can get a relaxing massage or hang out in the sauna. This pack features \n several interactive objects, including a new massage chair and the mud bath! \n Sims can also wind down from their daily stress by building their Wellness \n skill; taking yoga classes and learning how to meditate can build this skill. \n The higher their Wellness skill, the more Yoga poses they will be able to do, \n and the better massages they will be able to give.\n\n**INSTALL INSTRUCTIONS:\n\n1. DISABLE YOUR ANTIVIRUS BEFORE RUNNING 'Setup' ....\n2. INSTALL IT TO THE SAME LOCATION WHERE YOU HAVE INSTALLED THE SIMS 4 (REMOVE THE DEFAULT DIRECTORY THAT IS SPECIFIED IN THE INSTALLER , CLICK ON CONFIGURE, THEN CLICK ON BROWSE AND SPECIFY THE DIRECTORY WHERE U HAVE INSTALLED YOUR SIMS 4, IT'LL BE SHOWING THE DEFAULT DIRECTORY FOR MY REPACK SO JUST CHANGE IT TO YOUR SIMS 4 LOCATION) ...\n3. ADD THE SIMS 4 GAME FOLDER TO THE EXCLUSION/EXCEPTION LIST OF YOUR ANTIVIRUS OTHERWISE YOUR ANTIVIRUS WILL CHANGE THE 'TS4.exe' FILE INTO A TEMPORARY FILE OR JUST DELETE IT WHICH WON'T LET THE GAME TO RUN, AFTER THIS STEP, U CAN ENABLE YOUR ANTIVIRUS....\n\n\nIF U HAVE ALREADY CREATED AN EXCEPTION FOR IT THEN IGNORE STEP 3...\n\nTIPS: \n\n -IF AFTER UPDATE , U DON'T FIND 'TS4.exe' OR 'RldOrigin.dll' , THEN IT MEANS YOUR ANTIVIRUS HAS BLOCKED IT, RESTORE IT FROM ANTIVIRUS QUARANTINE ZONE OR REINSTALL UPDATE WITH ANTIVIRUS DISABLED. (WINDOWS DEFENDER IS THE DEFAULT ANTIVIRUS APART FROM MAIN ANTIVIRUS)....\n\n -If the game asks for Origin to be running , then it means your antivirus has blocked the crack, it's advised to create an exception for The Sims 4 folder to avoid this, make sure u have taken care of Windows Defender apart from your primary antivirus , with antivirus disabled now install the game .... \n\n -Go to windows defender, then go to the history tab. View details on quarantined items, and restore VirTool. Then go to the settings and scroll down to exclusions. Add RldOrigin.dll to the list. \n\n -IF U GET AN ERROR MESSAGE STATING THAT THE GAME DATA IS MISSING, THEN IT MEANS U HAVE INSTALLED THE UPDATE IN THE WRONG LOCATION ...\n\n -IF U GET AN INITIALISATION FAILED ERROR, THEN IT MEANS U MAY BE MISSING A PREVIOUS UPDATE .....\n\n -IF SOME DLC'S ARE MISSING , COMPLETELY EXIT ORIGIN AND THEN PLAY THE GAME (BETTER UNINSTALL ORIGIN) ....\n\nJUST DO EVERYTHING LIKE U DID FOR THE PREVIOUS UPDATE :) , OPEN THE GAME FROM 'TS4.exe' FROM GAME DIRECTORY OR THE DESKTOP SHORTCUT ...\n\nALWAYS OPEN THE GAME USING 'Run as administrator' TO AVOID ANY CRASH....\n\nIF U R STILL UNABLE TO GET IT WORKING, INBOX ME ON MYPAGE ....\n\nCheck out my Official FB page for any help :\nMr DJ repacks \nLike it guys to support and get updates on upcoming repacks, gaming tips and requests","torrent":{"xt":"urn:btih:c433c03261705091fd1719daccd8bfe888a052ab","amp;dn":"The+Sims+4+update+ver+1.10.57.1020+%2B+SPA+DAY+DLC+Mr+DJ+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c433c03261705091fd1719daccd8bfe888a052ab","infoHashBuffer":{"type":"Buffer","data":[196,51,192,50,97,112,80,145,253,23,25,218,204,216,191,232,136,160,82,171]},"announce":[],"urlList":[]}}