{"title":"Lagenda Budak Setan 2 - Katerina (2012) PpvRip","uid":8019513,"size":366650466,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c46d7175b68c4d32342c4c6d657c2e549b3bbf84&amp;dn=Lagenda+Budak+Setan+2+-+Katerina+%282012%29+PpvRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dhiyafaris","files":1,"time":1358172736,"description":"Di Pawagam Malaysia: 29 November 2012\nPenerbit: Sharad Sharan (Lagenda Budak Setan, Ombak Rindu)\nPengarah: Sharad Sharan\n\nLAGENDA BUDAK SETAN 2- KATERINA Sinopsis Sebuah sekuel dari Lagenda Budak Setan 6 bulan telah berlalu, selepas kematian Ayu. Kasyah masih bermurung atas kehilangan isteri tersayang, Ayu. Melalui Athirah, bayinya, segala kasih saying dicurahkan. Katerina juga semakin pulih kekuatannya untuk berdepan semula dengan Kasyah. Ketabahan dan ketenangan Kasyah masih menyerlahkan senyuman dibibirnya meskipun kehilangan orang tersayang, benar-benar buatkan Katerina mengaguminya Kemesraan mulai terjalin semula antara keduanya. Mereka sering keluar bersama dimana Kate sentiasa berada disampingnya hingga membibitkan rasa cinta. Katerina memperkenalkan kasyah kepada kedua orang tuanya. Mereka merancang untuk bertunang namun ditentang oleh ibu Kate, Sofea. Sofea tidak puas hati kerana Kasyah adalah punca menyebabkan Kate kecewa hingga hampir membunuh diri selepas Kasyah menikahi Ayu. Tak mungkin dia menerima kasyah sebagai menantu setelah dia kematian isteri. Kate tetap berkeras mahukan pertunangan tersebut hinggakan kedua orang tuanya terpaksa menurut. Namun, ayahnya, Sofean, punyai muslihatnya sendiri meskipun dia menyatakan persetujuannya. Ketika yang sama, Hisyam, bekas kekasih Kate yang masih menggilainya muncul kembali, mencetuskan kekecohan. Hisyam mengupah sekumpulan lelaki memukulnya hingga patah kaki. Kate naik angin lalu memarahi Hisyam dan mengugut untuk melaporkan kepada polis. Kasyah bekerja dengan rakan niaga Sofean, setelah berhenti kerja. Kate pula ke Afrika Selatan untuk urusan perniagaan. Ketika inilah Sofean memasang perangkapnya. Zahirah dibayar untuk menggoda Kasyah hinggakan dilihat oleh Firdaus, pengurus tempatnya bekerja. Sofean dihubungi dan diceritakan segala apa yang berlaku. Sofean menyarankan Kasyah dibuang kerja dengan serta merta. Inilah rancangan terbaik Sofean memerangkap Kasyah. Kate amat terkejut sepulangnya dia dari Afrika Selatan, mendengarkan perkara tersebut. Kasyah cuba menjelaskan keadaan sebenar namun Kate berkeras untuk memutuskan pertunangan. Kasyah yang tidak bersalah, benar-benar kecewa dan pasrah. Kasyah menyerahkan takdir untuk menjelaskan kebenaran. Masa berlalu, Athirah pun sudah menjangkau usia 2 tahun. Kasyah masih murung, begiru juga Kate. Kedua mereka terluka hati. Antara mereka masih ada rasa saying yang menebal. Kate mengambil keputusan mengahwini Hisyam dengan hasrat menyakiti hati Kasyah. Kate tahu yang Kasyah amat menyintainya dan dalam masa yang sama ingin membalas dendam ke atas Hisyam. Meskipun kate mengahwini Hisyam, beliau enggan membiarkan tubuhnya disentuh Hisyam. Mereka tidur berasingan. Kate ingin mendera Hisyam zahir dan batin. Kate takkan biarkan suami gaynya menyentuh tubuhnya.. Sementara Kasyah, membesarkan anaknya dengan bantuan abangnya, Iskandar. Beliaulah satu-satunya abang yang dia ada. Iskandar yang telah bercerai terpaksa kembali semula ke rumah peninggalan keluarga yang diduduki Kasyah. Malangnya, selain bercerai, Iskandar juga tidak punyai pekerjaan tetap. Kasyah berusaha membantu abangnya itu sedaya mungkin, setidak-tidaknya berada disisnya. Suatu hari, abangnya itu meninggal dunia kerana kemalangan. Anak kesayangannya, Athirah juga turut meninggal dunia tidak lama selepas itu kerana jangkitan kuku dan mulut. Kasyah kini tinggal sendirian, kesepian. Dia kehilangan segala yang disayanginya. Semua orang telah meninggalkannya. Kate pula nekad untuk meninggalkan Hisyam. Dia ingin bercerai. Inilah sebenarnya yang dimahukan. Dia ingin menyeksa Hisyam. Harapannya semoga Hisyam menderita sampai mati. Ketika Kate minta Hisyam pergi setelah memfailkan tuntutan cerai, Hisyam merasakan dirinya bagai ditusuk sembilu tajam. Bagaikan terhiris jantungnya. Hisyam sangat kecewa dan serasa ingin membunuh diri. Hidup bagaikan tak bererti lagi baginya. Sofean terkejut mendengar keputusan Kate. Kate menyatakan kejadian sebenar tentang Hisyam dan sebab-sebab dia mengahwini Hisyam. Kini, barulah dia mengerti bahawa Kate selama ini tak bahagia. Beliau menyalahkan dirinya kerana menjadi punca memisahkan Kate dengan Kasyah. Sofean benar-benar menyesal. Kasyah perlu dicari dan menyatakan kebenaran. Kate terserempak dengan Zahirah lalu bertanyakan perkara sebenar terjadi antara keduanya. Kate yang mendapat tahu muslihat sebenar, mengadap ayahnya Sofean. Sofean terpaku, tidak menyangka muslihatnya terbongkar. Masa berlalu, Kasyah masih tetap menyayangi kate. Dia juga mengerti yang mereka berdua hanyalah mangsa keadaan. Suatu pagi... tanpa diduga Kasyah menghubungi Kate semula..... Inilah permulaan indah untuk kisah cinta mereka yang tak akan menemui titik noktahnya...\n &lt;a href=&quot;\nhttp://youtu.be/XRk_IZqWoi8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://youtu.be/XRk_IZqWoi8&lt;/a&gt;","torrent":{"xt":"urn:btih:c46d7175b68c4d32342c4c6d657c2e549b3bbf84","amp;dn":"Lagenda+Budak+Setan+2+-+Katerina+%282012%29+PpvRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c46d7175b68c4d32342c4c6d657c2e549b3bbf84","infoHashBuffer":{"type":"Buffer","data":[196,109,113,117,182,140,77,50,52,44,76,109,101,124,46,84,155,59,191,132]},"announce":[],"urlList":[]}}