{"title":"Whitney Houston - Whitney - (1987)[EAC-MP3@320KBPS]","uid":4207155,"size":129377994,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c5731bf5cfad79d4f17b193923e53a8319ac0688&amp;dn=Whitney+Houston+-+Whitney+-+%281987%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seanprince","files":21,"time":1211859827,"description":"Whitney Houston - Whitney - (1987)[EAC-MP3@320KBPS]\n\nTrack list\n\nWhitney Houston - Whitney\n\n01.\tI Wanna Dance With Somebody ( Who Loves Me )\t04:53\n02.\tJust The Lonely Talking Again\t\t\t05:34\n03.\tLove Will Save The Day\t\t\t\t05:25\n04.\tDidn&amp;#039;t We Almost Have It All\t\t\t05:07\n05.\tSo Emotional\t\t\t\t\t04:35\n06.\tWhere You Are\t\t\t\t\t04:11\n07.\tLove Is A Contact Sport\t\t\t\t04:18\n08.\tYou&amp;#039;re Still My Man\t\t\t\t04:19\n09.\tFor The Love Of You\t\t\t\t05:32\n10.\tWhere Do Broken Hearts Go\t\t\t04:39\n11.\tI Know Him So Well\t\t\t\t04:30\n\nBiography\tby Steve Huey\n\nWhitney Houston is inarguably one of the of the biggest female pop stars of all time. Her accomplishments as a hitmaker are extraordinary; just to scratch the surface, she became the first artist ever to have seven consecutive singles hit number one, and her 1993 Dolly Parton cover &quot;I Will Always Love You&quot; became nothing less than the biggest hit single in rock history. Houston was able to handle big adult contemporary ballads, effervescent, stylish dance-pop, and slick urban contemporary soul with equal dexterity; the result was an across-the-board appeal that was matched by scant few artists of her era, and helped her become one of the first black artists to find success on MTV in Michael Jackson&amp;#039;s wake. Like many of the original soul singers, Houston was trained in gospel before moving into secular music; over time, she developed a virtuosic singing style given over to swooping, flashy melodic embellishments. The shadow of Houston&amp;#039;s prodigious technique still looms large over nearly every pop diva and smooth urban soul singer -- male or female -- in her wake, and spawned a legion of imitators (despite some critics&amp;#039; complaints about over-singing). Always more of a singles artist, Houston largely shied away from albums during the &amp;#039;90s, releasing the bulk of her most popular material on the soundtracks of films in which she appeared. By the end of the decade, she&amp;#039;d gone several years without a true blockbuster, yet her status as an icon was hardly diminished.\nWhitney Elizabeth Houston was born in Newark, NJ, on August 9, 1963; her mother was gospel/R&amp;B singer Cissy Houston, and her cousin was Dionne Warwick. By age 11, Houston was performing as a soloist in the junior gospel choir at her Baptist church; as a teenager, she began accompanying her mother in concert (as well as on the 1978 album Think It Over), and went on to back artists like Lou Rawls and Chaka Khan. Houston also pursued modeling and acting, appearing on the sitcoms Gimme a Break and Silver Spoons. Somewhat bizarrely, Houston&amp;#039;s first recording as a featured vocalist was with Bill Laswell&amp;#039;s experimental jazz-funk ensemble Material; their 1982 album One Down placed Houston alongside such unlikely avant-gardists as Archie Shepp and Fred Frith. The following year, Arista president Clive Davis heard Houston singing at a nightclub and offered her a record contract. Her first single appearance was a duet with Teddy Pendergrass, &quot;Hold Me,&quot; which missed the Top 40 in 1984.\nHouston&amp;#039;s debut album, Whitney Houston, was released in March 1985. Its first single, &quot;Someone for Me,&quot; was a flop, but the second try, &quot;You Give Good Love,&quot; became Houston&amp;#039;s first hit, topping the R&amp;B charts and hitting number three pop. Houston&amp;#039;s next three singles -- the Grammy-winning romantic ballad &quot;Saving All My Love for You,&quot; the brightly danceable &quot;How Will I Know,&quot; and the inspirational &quot;The Greatest Love of All&quot; -- all topped the pop charts, and a year to the month after its release, Whitney Houston hit number one on the album charts. It eventually sold over 13 million copies, making it the best-selling debut ever by a female artist. Houston cemented her superstar status on her next album, Whitney; despite the unimaginative title, it became the first album by a female artist to debut at number one, and sold over nine million copies. Its first four singles -- &quot;I Wanna Dance with Somebody (Who Loves Me)&quot; (another Grammy winner), &quot;Didn&amp;#039;t We Almost Have It All,&quot; &quot;So Emotional,&quot; and &quot;Where Do Broken Herts Go&quot; -- all hit number one, an amazing, record-setting run of seven straight (broken by &quot;Love Will Save the Day&quot;). In late 1988, Houston scored a Top Five hit with the non-LP single &quot;One Moment in Time,&quot; recorded for an Olympics-themed compilation album.\nHouston returned with her third album, I&amp;#039;m Your Baby Tonight, in 1990; a more urban-sounding, R&amp;B-oriented record, it immediately spun off two number one hits in the title track and &quot;All the Man That I Need.&quot; But the quality of the material was generally viewed as, overall, much weaker than her previous efforts, and following those two hits, sales of the album tapered off quickly, halting around four million copies. Nevertheless, Houston remained so popular that she could even take a recording of &quot;The Star Spangled Banner&quot; (performed at the Super Bowl) into the pop Top 20 -- though, of course, the Gulf War had something to do with that. In retrospect, the erratic quality of I&amp;#039;m Your Baby Tonight seemed to signal Houston&amp;#039;s declining interest in making fully fleshed-out albums. Instead, she began to focus on an acting career, which she hadn&amp;#039;t pursued since her teenage years; she also married singer Bobby Brown in the summer of 1992. Her first feature film, a romance with Kevin Costner called The Bodyguard, was released in late 1992; it performed well at the box office, helped by an ad campaign which seemingly centered around the climactic key change in Houston&amp;#039;s soundtrack recording of the Dolly Parton-penned &quot;I Will Always Love You.&quot; In fact, the ad campaign undoubtedly helped &quot;I Will Always Love You&quot; become the biggest single in pop music history. It set new records for sales (nearly five million copies) and weeks at number one (14), although those were later broken by Elton John&amp;#039;s &quot;Candle in the Wind 1997&quot; and Mariah Carey and Boyz II Men&amp;#039;s &quot;One Sweet Day,&quot; respectively. Meanwhile, the soundtrack eventually sold an astounding 16 million copies, and also won a Grammy for Album of the Year.\nOnce Houston had stopped raking in awards and touring the world, she prepared her next theatrical release, the female ensemble drama Waiting to Exhale. A few months before its release at the end of 1995, it was announced that she and Brown had split up; however, they called off the split just a couple months later, and rumors about their tempestuous relationship filled the tabloids for years to come. Waiting to Exhale was released toward the end of the year, and the first single from the soundtrack, &quot;Exhale (Shoop Shoop),&quot; topped the charts; the album sold over seven million copies. For her next project, Houston decided to return to her gospel roots; the soundtrack to the 1996 film The Preacher&amp;#039;s Wife, which naturally featured Houston in the title role, was loaded with traditional and contemporary gospel songs, plus guest appearances by Houston&amp;#039;s mother, Shirley Caesar, and the Georgia Mass Choir. Houston also began making headlines for what appeared to be increasing unreliability, cancelling several TV and concert appearances due to illness.\nIn 1998, Houston finally issued a new full-length album, My Love Is Your Love, her first in eight years. Houston worked with pop/smooth soul mainstays like Babyface and David Foster, but also recruited hip-hop stars like Missy Elliott, Wyclef Jean, Lauryn Hill, and Q-Tip. The album sold even fewer copies than I&amp;#039;m Your Baby Tonight, but it received Houston&amp;#039;s most enthusiastic reviews in quite some time. Moreover, it produced one of her biggest R&amp;B chart hits (seven weeks at number one) in the trio number &quot;Heartbreak Hotel,&quot; done with Faith Evans and Kelly Price. She also duetted with Mariah Carey on &quot;When You Believe,&quot; a song from the animated film The Prince of Egypt. Unfortunately, Houston was also back in the tabloids in early 2000; she was arrested in Hawaii when airline authorities reportedly found marijuana in her luggage (the charges were later dismissed). Speculation about Houston&amp;#039;s personal life only grew when she was dropped from the Academy Awards telecast that March, officially because of a sore throat, but reputedly due to poor rehearsals and a generally out-of-it air. Later in the year, Arista released the two-disc compilation Greatest Hits, which actually featured one disc of hits and one of remixes; it also included new duets with Enrique Iglesias, George Michael, and Deborah Cox. It was also announced that Houston had signed a new deal with Arista worth $100 million, requiring six albums from the singer. Her personal issues became even more public through the reality television series Being Bobby Brown, and she eventually divorced her husband and went into intense rehabilitation. An album of new material was set for release by the end of 2007.\n\nReview\tby Ron Wynn\n\nWhitney Houston became an international star with this album. It sold more than ten million copies around the world, yielded a string of number one hit singles across the board like &quot;I Wanna Dance With Somebody (Who Loves Me),&quot; &quot;Didn&amp;#039;t We Almost Have It All,&quot; and &quot;Love Will Save the Day,&quot; and established Houston as the era&amp;#039;s top female star. She later went on to more than solidify that status, with other hit albums and a budding film career. While this is a far cry from soul, it&amp;#039;s the ultimate in polished, super-produced urban contemporary material. \n\nEnjoy.","torrent":{"xt":"urn:btih:c5731bf5cfad79d4f17b193923e53a8319ac0688","amp;dn":"Whitney+Houston+-+Whitney+-+%281987%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5731bf5cfad79d4f17b193923e53a8319ac0688","infoHashBuffer":{"type":"Buffer","data":[197,115,27,245,207,173,121,212,241,123,25,57,35,229,58,131,25,172,6,136]},"announce":[],"urlList":[]}}