{"title":"Until Tuesday by Luis Carlos Montalvan (ePUB/Mobi)","uid":7910961,"size":2337604,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5d7ad03bbf1cfc39cabd23ed67ba5b70793040a&amp;dn=Until+Tuesday+by+Luis+Carlos+Montalvan+%28ePUB%2FMobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"azizex666","files":-1,"time":1355217053,"description":"     Until Tuesday: A Wounded Warrior and the Golden Retriever Who Saved Him\n\n\n&quot;We aren't just service dog and master;\nTuesday and I are also best friends. Kindred souls. Brothers.\nWhatever you want to call it. We weren't made for each other,\nbut we turned out to be exactly what the other needed.&quot;\nA highly decorated captain in the U.S. Army, Luis Montalvan never backed down from a challenge during his two tours of duty in Iraq. After returning home from combat, however, the pressures of his physical wounds, traumatic brain injury, and crippling post-traumatic stress disorder began to take their toll. Haunted by the war and in constant physical pain, he soon found himself unable to climb a simple flight of stairs or face a bus ride to the VA hospital. He drank; he argued; ultimately, he cut himself off from those he loved. Alienated and alone, unable to sleep or bend over without pain, he began to wonder if he would ever recover.\nThen Luis met Tuesday, a beautiful and sensitive golden retriever trained to assist the disabled. Tuesday had lived amongst prisoners and at a home for troubled boys, blessing many lives; he could turn on lights, open doors, and sense the onset of anxiety and flashbacks. But because of a unique training situation and sensitive nature, he found it difficult to trust in or connect with a human being--until Luis.\n&quot;Until Tuesday&quot; is the story of how two wounded warriors, who had given so much and suffered the consequences, found salvation in each other. It is a story about war and peace, injury and recovery, psychological wounds and spiritual restoration. But more than that, it is a story about the love between a man and dog, and how together they healed each other's souls.\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n                          Published - May 3rd 2011\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;\t\n","torrent":{"xt":"urn:btih:c5d7ad03bbf1cfc39cabd23ed67ba5b70793040a","amp;dn":"Until+Tuesday+by+Luis+Carlos+Montalvan+%28ePUB%2FMobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5d7ad03bbf1cfc39cabd23ed67ba5b70793040a","infoHashBuffer":{"type":"Buffer","data":[197,215,173,3,187,241,207,195,156,171,210,62,214,123,165,183,7,147,4,10]},"announce":[],"urlList":[]}}