{"title":"The Kit Fielding Duology - Dick Francis  (Audiobook)","uid":11156020,"size":396315230,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c5dc4be7c7d0d110779b4ffe38c88f5be4020d43&amp;dn=The+Kit+Fielding+Duology+-+Dick+Francis++%28Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"davieboy1966","files":19,"time":1412383767,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\nBoth are unabridged and read by Tony Britton from CDs. (48 kbps / 44 kHz Mono, Fraunhofer CBR )\n\n\n\n#1. Break In [1985] 9 hours 34 mins\nChampion jockey Kit Fielding is almost telepathically close to his twin sister Holly. So he naturally agrees to help out when she asks for his assistance in determining who is out to disgrace her racehorse trainer husband Bobby Allardeck; it seems someone has been planting stories in gossip columns. However, it turns out that there's more than just a little rumor spreading afoot and Kit must be careful to keep his name out of the obituary column. You get the feeling that, of all the Dick Francis heroes, Kit Fielding is the one he'd most like to be. Certainly he (Kit) has it all going on: he's at the peak of his profession, able to gain the confidence and respect of all (all except for the bad guys, of course) and starts a relationship with a beautiful and intelligent woman. There's even the legacy of an age-old quarrel to spice things up: the Fieldings and Allardecks have been at each other's throats with a ferocity that puts the Montague-Capulet thing to shame. No wonder that Francis immediately penned a sequel. Break In is also strong in its racing scenes; if there had been a little bit more thought to the plot then this one would be among DF's very best. As is, it's pretty damn good.\n\n#2. Bolt [1986] 8 hours 45 mins\nWhen Kit Fielding, champion steeplechase jockey, finds out that his chief patron, Princess Casilia, is facing an increasingly serious threat, he goes unhesitatingly to her aid. Neither realises that his instinctive support is the first step towards a frightening battle involving violent risk, with the honour of the princess's family as the prize and Kit's own destruction as the forfeit. Beset by other problems, not least his troubled romance with Danielle, the princess's niece, Kit knows that while steering through a maze of deadly outside dangers and riding at breakneck speed in races, he must also contend with the long-term hatred of his own family's enemy. Many of the characters from Break In reappear in this story which, with its style, pace and ingenious plot, is hard to put down.\n\nYou get the feeling that, of all the Dick Francis' heroes, Kit Fielding is the one he'd most like to be!\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c5dc4be7c7d0d110779b4ffe38c88f5be4020d43","amp;dn":"The+Kit+Fielding+Duology+-+Dick+Francis++%28Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5dc4be7c7d0d110779b4ffe38c88f5be4020d43","infoHashBuffer":{"type":"Buffer","data":[197,220,75,231,199,208,209,16,119,155,79,254,56,200,143,91,228,2,13,67]},"announce":[],"urlList":[]}}