{"title":"New Order 24 Bit Vinyl Pack","uid":9290553,"size":10914996276,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c6f025365808fc4991fdeabe7b78003e00a41c63&amp;dn=New+Order+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":7,"uploader":"politux","files":-1,"time":1386083633,"description":"\n  New Order 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Dance-Rock, Alternative, Post-Punk, Synth Pop\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz, 192,000 Hz\n\n  1981 Movement (24.96)\n  1983 Confusion (Single)\n  1983 Power Corruption &amp; Lies (24.96)\n  1984 Thieves Like Us (Single)\n  1985 Low-life (24.96)\n  1985 Sub-Culture (12&quot; Single)\n  1986 Brotherhood (24.96)\n  1987 Substance (24.96)\n  1987 True Faith (UK Single)\n  1987 True Faith (Remixes)\n  1989 Technique (2009 UK Reissue 24.96)\n  1991 Electronic (Germany, 24.192)\n  2013 Lost Sirens (EU, 24.192)\n  \n  Rising from the ashes of the legendary British post-punk unit Joy Division, the enigmatic New Order triumphed over tragedy to emerge as one of the most influential and acclaimed bands of the 1980s; embracing the electronic textures and disco rhythms of the underground club culture many years in advance of its contemporaries, the group's pioneering fusion of new wave aesthetics and dance music successfully bridged the gap between the two worlds, creating a distinctively thoughtful and oblique brand of synth pop appealing equally to the mind, body, and soul. New Order's origins officially date back to mid-1976, when guitarist Bernard Sumner (formerly Albrecht) and bassist Peter Hook -- inspired by a recent Sex Pistols performance -- announced their intentions to form a band of their own. Recruiting singer Ian Curtis and drummer Stephen Morris, they eventually settled on the name Joy Division, and in 1979 issued their landmark debut LP, Unknown Pleasures.\n\n  After completing sessions for Joy Division's sophomore effort, Closer, Curtis hanged himself on May 18, 1980; devastated, the remaining trio immediately disbanded, only to re-form soon after as New Order with the addition of keyboardist Gillian Gilbert. With Sumner assuming vocal duties, the new group debuted in March 1981 with the single &quot;Ceremony,&quot; a darkly melodic effort originally composed for use by Joy Division. The LP Movement followed a few months later, and when it too mined territory similar to New Order's previous incarnation, many observers were quick to dismiss the band for reliving former glories. However, with its next single, &quot;Everything's Gone Green,&quot; the quartet first began adorning its sound with synthesizers and sequencers, inspired by the music of Kraftwerk as well as the electro beats coming up from the New York underground; 1982's &quot;Temptation&quot; continued the trend, and like its predecessor was a major favorite among club-goers.\n\n  After a yearlong hiatus, New Order resurfaced in 1983 with their breakthrough hit &quot;Blue Monday&quot;; packaged in a provocative sleeve designed to recall a computer disk, with virtually no information about the band itself -- a hallmark of their mysterious, distant image -- it perfectly married Sumner's plaintive yet cold vocals and abstract lyrics with cutting-edge drum-machine rhythms ideal for club consumption. &quot;Blue Monday&quot; went on to become the best-selling 12&quot; release of all time, moving over three million copies worldwide. After releasing their brilliant 1983 sophomore album, Power, Corruption and Lies, New Order teamed with the then-unknown producer Arthur Baker to record &quot;Confusion,&quot; another state-of-the-art dance classic, which even scraped into the American R&amp;B charts. The group's success soon won them a stateside contract with Quincy Jones' Qwest label; however, apart from a pair of singles, &quot;Thieves Like Us&quot; and &quot;Murder,&quot; they remained out of the spotlight throughout 1984.\n\n  Heralded by the superb single &quot;The Perfect Kiss,&quot; New Order resurfaced in 1985 with Low-life, their most fully realized effort to date; breaking with long-standing tradition, it actually included photos of the individual members, suggesting an increasing proximity with their growing audience. Brotherhood followed in 1986, with the single &quot;Bizarre Love Triangle&quot; making significant inroads among mainstream pop audiences. A year later the group issued Substance, a much-needed collection of singles and remixes; it was New Order's American breakthrough, cracking the Top 40 on the strength of the newly recorded single &quot;True Faith,&quot; which itself reached number 32 on the U.S. pop charts. The remixed &quot;Blue Monday 1988&quot; followed, and in 1989 -- inspired by the ecstasy-fueled house music that their work had clearly predated and influenced -- New Order issued Technique; their most club-focused outing to date, it launched the hits &quot;Fine Time&quot; and &quot;Round and Round.&quot;\n\n  After recording the 1990 English World Cup Soccer anthem &quot;World in Motion,&quot; New Order went on an extended hiatus to pursue solo projects; Hook formed the band Revenge, longtime companions Morris and Gilbert recorded as the Other Two, and, most notably, Sumner teamed with ex-Smiths guitarist Johnny Marr and Pet Shop Boys frontman Neil Tennant in Electronic, which scored a Top 40 hit with the single &quot;Getting Away with It.&quot; New Order reconvened in 1993 for their biggest hit to date, Republic, which earned the band its highest charting American single (&quot;Regret&quot;) and fell just shy of the U.S. Top Ten, despite charges from longtime fans that the band had lost its edge. A major tour followed, although rumors of escalating creative conflicts plagued the group; refusing to either confirm or deny word of a breakup, New Order simply spent the mid-'90s in a state of limbo, with Sumner eventually recording a long-awaited second Electronic LP and Hook mounting another new project, Monaco. &quot;Brutal,&quot; the first new effort from New Order in a number of years, was featured on the soundtrack of the 2000 film The Beach, and the full-length Get Ready followed one year later. By this time, Gillian Gilbert had left the band to care for her and Stephen Morris' children, and Marion guitarist Phil Cunningham had been added to bolster the lineup. Dedicated touring followed the release of Get Ready, and New Order recorded a follow-up for release in 2005, Waiting for the Sirens' Call.\n\n  In 2006, after a succession of one-off dates, New Order decided to call it quits for a second time after bassist Hook suggested that they should quit touring for good. With Sumner announcing that they wouldn't record as New Order anymore, he started Bad Lieutenant with Cunningham in 2009. After a two-year break, New Order announced they would play a handful of live dates, and with Gilbert now back in the band, after a ten-year time-out, Hook was replaced by Bad Lieutenant bassist Tom Chapman. The album Live at the London Troxy was released at the end of 2011, documented the band's successful return to the live arena. Continuing to tour throughout 2012, the band joined Blur and the Specials at London's Hyde Park to help close the London 2012 Summer Olympics, and at the end of the year announced the release of Lost Sirens. The album, which featured songs that were recorded at the time of 2005's Waiting for the Sirens' Call, was released in January 2013.","torrent":{"xt":"urn:btih:c6f025365808fc4991fdeabe7b78003e00a41c63","amp;dn":"New+Order+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6f025365808fc4991fdeabe7b78003e00a41c63","infoHashBuffer":{"type":"Buffer","data":[198,240,37,54,88,8,252,73,145,253,234,190,123,120,0,62,0,164,28,99]},"announce":[],"urlList":[]}}