{"title":"Hogtied--HT-32139 Darling MP4","uid":8799290,"size":3109762128,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c6fc695e2a5300cc52963a7a9dd7fed70db87a73&amp;dn=Hogtied--HT-32139+Darling+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":-1,"time":1376155108,"description":"Gorgeous Squirting Orgasmic Rope Slut Gets Bound and Defiled\n\nAug 8, 2013 - Performers: Darling\n \n\nMP4 + Pics.  \n \n\nWhen I see Darling walk onto the set, I can feel my dick twitch. She is dressed like a proper citizen, all wrapped up in a pretty polka dot dress and sensible shoes. But I know what is underneath it all. She can't wait for me to get at those big round slutty tits of hers. \n\nI make her wait. As I tie her tits and crane her elbows behind her back, I hear her moan low. I smell her cunt getting wet. I run a knotted rope tight across her damp panties, push her to the ground and get my whip. \n\nThe site is called HOGTIED, so I do a simple and strict tie that twists her back like a fucking pretzel and pushes her tightly tied tits out for me to torment. She sputters spittle around the gag as I casually apply zippers to her nicely presented tits. I laugh when she looks at me pleadingly, and reward her masochism with a hard, wet orgasm. I untie her and tell her to clean herself up - she smells like a used cunt. \n\nPinning her ankles behind her head is a position I am sure this tramp is used to, so I show no mercy and really crank the ropes down. What I did not expect was the ferocity of uncontrollable squirting orgasms I would get out of her in this position. This little slut cums so much she leaves a puddle on my floor. \n\nThe predicament is my favorite because I am a sadistic prick. Especially when my cock is as hard as it is right now. I tie her into something delightfully disturbing, weigh her fat fucking nipples and thick ripe cunt lips with viscous clamps and rocks, and sit back and rub my cock while she suffers. It is a good day.When I see Darling walk onto the set, I can feel my dick twitch. She is dressed like a proper citizen, all wrapped up in a pretty white dress and sensible shoes. I can't wait to get at those big round slutty tits of hers.\n\nScreens  &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=32139&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=32139&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:c6fc695e2a5300cc52963a7a9dd7fed70db87a73","amp;dn":"Hogtied--HT-32139+Darling+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6fc695e2a5300cc52963a7a9dd7fed70db87a73","infoHashBuffer":{"type":"Buffer","data":[198,252,105,94,42,83,0,204,82,150,58,122,157,215,254,215,13,184,122,115]},"announce":[],"urlList":[]}}