{"title":"GlovePIE 0.30","uid":3973427,"size":6382950,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c729695fc28e161f96aad0f7ff912ee8c4407145&amp;dn=GlovePIE+0.30&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"R3D_H4T","files":239,"time":1200127016,"description":"NEW VERSION 0.30 Released! Download it!\nControl Games with Gestures, Speech, and Other Input Devices!\nWith GlovePIE you can now play any game, or control any software or MIDI devices, using whatever controls you want. This includes joysticks, gamepads, mice, keyboards, MIDI input devices, HMDs, Wiimotes, trackers, and of course, Virtual Reality gloves! \n\nNEW! Wiimote Support!\nNow you can use your Nintendo Wii Remote (Wiimote) to control PC games (or emulated games)! Also new in this version is support for TrackIR, FakeSpace Pinch Gloves, and Concept 2 Rowing machines. And it still supports the full range of other input devices added in the last couple of versions.\n\nAbout GlovePIE\nGlovePIE stands for Glove Programmable Input Emulator. It doesn&amp;#039;t have to be used with VR Gloves, but it was originally started as a system for emulating Joystick and Keyboard Input using the Essential Reality P5 Glove. Now it supports emulating all kinds of input, using all kinds of devices, including Polhemus, Intersense, Ascension, WorldViz, 5DT, and eMagin products. It can also control MIDI or OSC output.\n\nIn the GlovePIE window you type or load a simple script. For example to control the WASD keys with a glove:\n\nW = glove.z &gt; -50 cm\nS = glove.z &lt; -70 cm\nA = glove.x &lt; -10 cm\nD = glove.x &gt; 10 cm\n\nYou can also use GlovePIE to play Joystick-only games without a joystick, or keyboard-only games with a joystick. Or you can use it to create macro buttons for complex keystrokes. \n\nYou can even use it to control multiple mouse pointers with multiple mice.\n\nSystem Requirements\nYou will need:\n\nWindows 98 or above (Windows 2000 or above to emulate keys in DirectInput games or use multiple fake cursors - Windows XP or above to get input from multiple mice or keyboards individually or to read some special keys). \nDirectX 8 or above. \nThere is other optional software you might need for certain features. See the download page for links to download them. Joystick emulation requires PPJoy. Speech requires SAPI 5.1 with microsoft recogniser.\nYou don&amp;#039;t need any special hardware.\n\nHardware Supported\nNintendo Wii Remote (Wiimote) \nNaturalPoint (Or eDimensional) TrackIR, OptiTrack, SmartNav \nFakeSpace Pinch Gloves (9600 baud by default, but can be changed) \nConcept 2 PM3 rowing machines (ergo or erg) \nAll joysticks or gamepads recognised by Windows \nParallel port gamepads (with PPJoy) \nAll keyboards \nMice with up to 5 buttons and 2 scroll wheels \nMost microphones (don&amp;#039;t have to be high quality) \nMost MIDI input or output devices \nEssential Reality P5 Glove \n5DT Data Glove (all versions) \neMagin Z800 3D Visor HMD \nPolhemus trackers (must be set to 115200 baud): IsoTrak II, FasTrak, Liberty, Patriot, Liberty Latus \nAscension trackers: Flock of Birds, MotionStar, etc. \nIntersense trackers: InterTrax, InertiaCube, IS-300, IS-600, IS-900, IS-1200, etc. \nWorldViz PPT trackers (all versions) \nGameTrak (only as a joystick, no direct support)\n","torrent":{"xt":"urn:btih:c729695fc28e161f96aad0f7ff912ee8c4407145","amp;dn":"GlovePIE+0.30","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c729695fc28e161f96aad0f7ff912ee8c4407145","infoHashBuffer":{"type":"Buffer","data":[199,41,105,95,194,142,22,31,150,170,208,247,255,145,46,232,196,64,113,69]},"announce":[],"urlList":[]}}