{"title":"Bad Ideas: An Arresting History of our Inventions","uid":8668730,"size":651419,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c836f6ee7fcda4825e6c43aa9c13ed4ef7bed5d0&amp;dn=Bad+Ideas%3A+An+Arresting+History+of+our+Inventions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1373416395,"description":"We are born with the instinct to create and invent. Indeed our ability to do so is what separates we humans from the rest of the animal world. The moment man first converted a stone to a useful tool set him on a relentless path toward greater control and power over his environment. But have our creative ideas always produced desirable results in line with their original good intention? How many ill-effects and dangers have they brought about along the way? And have they really served us well?\n\nBad Ideas? traces the fascinating history of our attempts at self-improvement but also questions their value. The dubious consequences of the development of weaponry, for example, is self-evident from the primitive but lethal sling to the devastating nuclear bomb. But what of apparently more innocuous inventions such as farming, writing or medicine? All were initiated for the greater good but have nonetheless produced unforeseen fallout that continues to this day. What are their undesirable side-effects, how did they emerge over the years and where will they take us in the future?\n \nWritten against a huge historical canvas, we join Robert Winston on a thrilling and inspiring journey from our earliest days to the present. We learn about the history of modern science, engineering, IT and much more, following the unexpected twists and turns of their progress. We meet the individuals who played a key role in their development, and share quirky anecdotes about their lives and brainwaves. Inspiring, unusual, and at times controversial, Bad Ideas? enables us by appreciating the past to look forward to the technological opportunities and ethical challenges of the future. In so doing it celebrates man's extraordinary capacity for achievement whilst warning us that his good intentions can sometimes end up as thoroughly bad ideas.\n &lt;a href=&quot;\nhttp://www.amazon.com/Bad-Ideas-Arresting-History-Inventions/dp/0593060288/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373452218&amp;sr=1-1&amp;keywords=bad+ideas%3F+Robert+Winston&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Bad-Ideas-Arresting-History-Inventions/dp/0593060288/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373452218&amp;sr=1-1&amp;keywords=bad+ideas%3F+Robert+Winston&lt;/a&gt;","torrent":{"xt":"urn:btih:c836f6ee7fcda4825e6c43aa9c13ed4ef7bed5d0","amp;dn":"Bad+Ideas%3A+An+Arresting+History+of+our+Inventions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c836f6ee7fcda4825e6c43aa9c13ed4ef7bed5d0","infoHashBuffer":{"type":"Buffer","data":[200,54,246,238,127,205,164,130,94,108,67,170,156,19,237,78,247,190,213,208]},"announce":[],"urlList":[]}}