{"title":"Rhys Ford - Cole McGinnis Mysteries 4 Dirty Deeds","uid":11454521,"size":233247001,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c937b01bcf154c6023e32d0ce17d3cd49f701d67&amp;dn=Rhys+Ford+-+Cole+McGinnis+Mysteries+4+Dirty+Deeds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"katelynor","files":1,"time":1415922761,"description":"Sheila Pinelli needed to be taken out.\n\nFormer cop turned private investigator Cole McGinnis never considered committing murder. But six months ago, when Jae-Min's blood filled his hands and death came knocking at his lover's door, killing Sheila Pinelli became a definite possibility.\n\nWhile Sheila lurks in some hidden corner of Los Angeles, Jae and Cole share a bed, a home, and most of all, happiness. They'd survived Jae's traditional Korean family disowning him and plan on building a new life - preferably one without the threat of Sheila's return hanging over them.\n\nThanks to the Santa Monica police mistakenly releasing Sheila following a loitering arrest, Cole finally gets a lead on Sheila's whereabouts. That is, until the trail goes crazy, and he's thrown into a tangle of drugs, exotic women, and more death. Regardless of the case going sideways, Cole is determined to find the woman he once loved as a sister and get her out of their lives once and for all","torrent":{"xt":"urn:btih:c937b01bcf154c6023e32d0ce17d3cd49f701d67","amp;dn":"Rhys+Ford+-+Cole+McGinnis+Mysteries+4+Dirty+Deeds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c937b01bcf154c6023e32d0ce17d3cd49f701d67","infoHashBuffer":{"type":"Buffer","data":[201,55,176,27,207,21,76,96,35,227,45,12,225,125,60,212,159,112,29,103]},"announce":[],"urlList":[]}}