{"title":"LOST Season 5 - DVD 1 (S5.D1)","uid":5340729,"size":4621893679,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c95182ac182bc920fa7678393a000a532d7e22eb&amp;dn=LOST+Season+5+-+DVD+1+%28S5.D1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darth-malachi","files":2,"time":1265478198,"description":"The Complete Fifth Season of LOST: DVD 1 of 5\nIncludes the episodes:\n#5.01 Because You Left\n#5.02 The Lie\n#5.03 Jughead\n\nThis is the first of five DVD disks in the complete Season 5 of LOST. This is a DVD5 image, which means you can download and burn it using almost any DVD drive.\n\nIt was compiled by me from the original Region 1 DVD9 version of the same disk. In order to fit on the DVD5 I had to remove some of its content. Full list of changes here:\n\nRemoved from the original DVD9:\n*ABC Logo and Warnings of every kind\n*Advertisements of various Blu-ray and DVD releases, most of which had nothing to do with LOST anyway\n*All non-English audio tracks\n*All non-English subtitles\n*The &quot;LOST starter kit&quot; short recap video - it really had nothing important, if you've seen the show at least once, you already know all of it, believe me\n*Italian and Dutch versions of the animated menu will not work. At all. When you first start the disk, just select English and it will all play nice and smooth\n\nUnchanged from the original DVD9:\n*English and Spanish versions of the animated menu\n*Audio commentary for &quot;5.01 Because You Left&quot; by Damon Lindelof and Carlton Cuse\n*English Audio tracks and English subtitles\n*ALL VIDEO IS LEFT UNCOMPRESSED\n\nIn other words, by removing some really unneeded and even unwanted content like Warnings and Adverts, I was able to left the video totally uncompressed and preserve the neat features of the DVD like the animated menu and the audio commentary. Enjoy and please let me know what you think.\n\nImportant notice: I will seed this torrent for as long as I can, but eventually I will be forced to burn it on a disk and remove it from my hard drive to make way for other great DVDs. Since then it will be totally up to people like you to continue to seed this torrent. Please, once you download it, seed it for at least several days before burning it down and removing from you hard drive - let other people download it. You are also encouraged to most links to it and posting this very torrent on the other websites: the more people will download it, the better the chances that it will be available for as long as possible.","torrent":{"xt":"urn:btih:c95182ac182bc920fa7678393a000a532d7e22eb","amp;dn":"LOST+Season+5+-+DVD+1+%28S5.D1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c95182ac182bc920fa7678393a000a532d7e22eb","infoHashBuffer":{"type":"Buffer","data":[201,81,130,172,24,43,201,32,250,118,120,57,58,0,10,83,45,126,34,235]},"announce":[],"urlList":[]}}