{"title":"Oblivion lost 2010 mod pack full","uid":10619954,"size":1715735644,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c993994536885ed40b71c8b80d133e224aebb0e1&amp;dn=Oblivion+lost+2010+mod+pack+full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moije38","files":9,"time":1406159347,"description":"The eight-and-a-ninth parts archive, that you can partly obtain from moddb until end 2014 (the ninth part file is broken and OP doesn't care..).\n\n*read this in the voice of the guy that does the honest trailers on youtube, and if you don't know him, then check it out, this guy's awesome\n\nSo, enjoy your many-in-one mod with hundreds of features and new textures and bug fixes and.. Well whatever can improve the already awesome GSC's work of art that is S.T.A.L.K.E.R. SoC, like new maps, better old maps, high definition energy drink can... I should stop enumerating these, right?\n\nAnyway, here is the full thing, in eight-and-a-ninth parts, uh.. for free, i guess that counts? I mean, the original downloads were free, but since i needed to go on a polonian website, pay 3 zloty (someting around $0.96), don't get my file, and finally catch the eyes of a good guy greg named ''shield'' on a hungarian forum (it's all true, i swear), well, i kinda expected some sort of a reward.. I don't know, a level-up maybe? At least a new staff, 'cuz my old one has cr- hey, you still there?\n\nDamn, i'm getting carried away. Let's make it quick: Here are the files. I will upload until at least ten of you got it full or until i don't want to ruin my internet connection anymore. Also i have a very poor internet connection. Something like 50KB/s in upload, soooo you gotta be patient, and please seed until-n'-after your download is finished. I think that's all.. Oh, and in your torrent client there should be an option to chose only this or this file to download, so if you're just missing the ninth part and don't want to lose part of your soul on a polonian website with hamsters (was that a dream? But where did i learn the meaning of &quot;E ogonek&quot;?), you can safely take this torrent. It's hamster-free, i promise.\n\nUh, i should probably conclude this description in an outstanding way, but, it's three A.M. here and i'm tired and i'm lazy and *yawwwn* goodbye everyone..","torrent":{"xt":"urn:btih:c993994536885ed40b71c8b80d133e224aebb0e1","amp;dn":"Oblivion+lost+2010+mod+pack+full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c993994536885ed40b71c8b80d133e224aebb0e1","infoHashBuffer":{"type":"Buffer","data":[201,147,153,69,54,136,94,212,11,113,200,184,13,19,62,34,74,235,176,225]},"announce":[],"urlList":[]}}