{"title":"Coast to Coast - 2013-08-01 - Dearly Departed Special","uid":8782394,"size":55750478,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c9fa0b9464ae7cb2696f0df319e98d71dd16daa8&amp;dn=Coast+to+Coast+-+2013-08-01+-+Dearly+Departed+Special&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":5,"time":1375745288,"description":"Coast to Coast - 2013-07-31 - Ancient Cycles, Chimeras and Secret Experimentation\n\n\nHost: George Noory\nGuests: Tim Ball, Glenn Kimball, Ray Manzarek, Lou Gentile, Laurence Gardner, Budd Hopkins, Zecharia Sitchin  \n\n\nFor over 20 years, Coast to Coast AM has been host to some of the most brave, innovative and informed experts. In separate half-hour segments, George played and commented on six different interviews from former guests in the C2C family that are no longer with us, yet whose legacies and ideas live on. First we heard frequent Coast guest, researcher Glenn Kimball from his 2/18/10 show appearance, in which he revealed the nature of his grave illness, and also put forth the idea that DNA was brought to Earth by an ultimate creator, a messiah, and this is why Earth is visited by ETs and other entities, because the planet is a special place that was chosen by this creator being. Kimball died later in 2010.\n\nNext, from the 1/24/08 show, keyboardist Ray Manzarek from the legendary band The Doors, shared how he and Jim Morrison decided to form the Doors after running into each other on the beach in Venice in 1965 (they had gone to school together at UCLA). Manzarek said he was blown away when he first heard Morrison sing his composition &quot;Moonlight Drive&quot; with Manzarek's earlier band. Manzarek passed away at the age of 74 in May of this year. From the 4/2/06 show, paranormal investigator and demonologist Lou Gentile spoke about his encounters with sinister ghostly phenomena, as well as how he entered James Randi's paranormal challenge. Lou lost his battle with cancer in 2009.\n\nFrom the 2/18/08 program, the intriguing historian Laurence Gardner traced the connections between King Solomon &amp; his Temple, the Knights Templar, the Ark of the Covenant, and White Powder Gold. The magical White Powder Gold or manna along with the Ark, suggest the ancient Hebrews had an advanced science, he said. Gardner died in 2010 after a prolonged illness. In a segment from the 7/13/09 show, abduction investigator Budd Hopkins discussed his just published memoir in which he explored his life as an artist, and as a pioneer in the field of UFO research. He passed away in New York City in 2011. Finally, we heard an interview with renowned scholar Zecharia Sitchin who recounted his theory of ancient ET visitors from the planet Nibiru during the 2/1/10 show. Sitchin died later in 2010 at the age of 90.\n\nClimate Change\n\nFirst hour guest, retired professor of climatology Dr. Tim Ball reacted to a new study about climate change, which suggested that the rate of climate change over the next century will be 10 times faster than the rate of any climate shift in the past 65 million years. The people that did this study are not climatologists and have bought into politicized &quot;climate alarmism&quot; statistics and extrapolated on them, he contended. The argument that climate change has been accelerated by human activity is completely wrong, Ball added.\n\nNews segment guest: Mitch Battros ","torrent":{"xt":"urn:btih:c9fa0b9464ae7cb2696f0df319e98d71dd16daa8","amp;dn":"Coast+to+Coast+-+2013-08-01+-+Dearly+Departed+Special","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9fa0b9464ae7cb2696f0df319e98d71dd16daa8","infoHashBuffer":{"type":"Buffer","data":[201,250,11,148,100,174,124,178,105,111,13,243,25,233,141,113,221,22,218,168]},"announce":[],"urlList":[]}}