{"title":"Solids - Blame Confusion (2014) [FLAC]","uid":9655604,"size":263163502,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ca1f9e33cbbff558e12a73bd98f85a2bcd9335b5&amp;dn=Solids+-+Blame+Confusion+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1393176782,"description":"\n  Solids - Blame Confusion (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Grunge, Noise Pop\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44.1 KHz\n\n  01 Over the Sirens \n  02 Off White \n  03 Traces \n  04 Haze Away \n  05 Blame Confusion \n  06 Laisser Faire  \n  07 Cold Hands \n  08 Through the Walls\n  09 Not Complaining \n  10 Terminal\n\n  Hackneyed as it may be to mention, the Montreal duo Solids did an excellent job choosing a name. While listening to Blame Confusion, it's hard to imagine that an album this densely packed with sound is the handiwork of just two people, but guitarist Xavier Germain-Poitras and drummer Louis Guillemette fill every possible nook and cranny on their debut album with heavy yet melodic music. Like plenty of other indie rock bands in the 2010s, Solids take inspiration from alt-rock's early-'90s heyday, and it's easy to hear bits of Sonic Youth, Superchunk, and Dinosaur Jr. in their revved-up songs. At times they also resemble a lo-fi ...And You Will Know Us by the Trail of Dead, especially on &quot;Off White,&quot; which shifts from raging to reflective in its epic sweep. However, Germain-Poitras and Guillemette's time in hardcore bands is just as important to Solids' approach; the duo sounds much more passionate than the like-minded bands that borrow too much from the slacker ethos of the '90s. They wear this anthemic spirit well: even on the poppiest songs, like the title track and &quot;Haze Away,&quot; Blame Confusion vibrates with barely contained energy. On furious tracks such as &quot;Traces&quot; and &quot;Cold Hands,&quot; the tension between Guillemette and Germain-Poitras' big sound and Adrian Popovich's stripped-down production generates sparks. The duo also pulls off an honest-to-goodness ballad with the brawny yet melancholy closing track &quot;Terminal,&quot; which, in its own way, shows how far Solids have come from 2010's debut EP Generic Dogs as much as the louder songs here. It's too easy to call Blame Confusion a solid first album; nevertheless, it's still a consistently entertaining and impressive debut.","torrent":{"xt":"urn:btih:ca1f9e33cbbff558e12a73bd98f85a2bcd9335b5","amp;dn":"Solids+-+Blame+Confusion+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca1f9e33cbbff558e12a73bd98f85a2bcd9335b5","infoHashBuffer":{"type":"Buffer","data":[202,31,158,51,203,191,245,88,225,42,115,189,152,248,90,43,205,147,53,181]},"announce":[],"urlList":[]}}