{"title":"Eight Metal Music Documentaries","uid":4588342,"size":8723502036,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ca41703498a0bd630ad94c2055ad589277544fdc&amp;dn=Eight+Metal+Music+Documentaries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"Ghost Radio","files":21,"time":1229724435,"description":"Eight metal music documentaries:\n\n\nArena Heavy Metal (1989)\n\nOriginally broadcasted on the BBC. Interviews with Black Sabbath, Iron Maiden, Slayer, Napalm Death, David Lee Roth, Guns 'N' Roses, Outrage (Jpn). Spoken language: English. Format: MPEG4. Medium quality VHS rip.\n\n\nDream Deceivers: The Story Behind James Vance vs. Judas Priest (1995)\n\nDocumentary about the courtcase against Judas Priest who were accused of inspiring the suicide attempts of two teenagers of whom one survived. Contains interviews with Judas Priest as well as courtroom footage. Spoken language: English. Format: MPEG4. Low quality VHS rip.\n\n\nHeavy Metal: Louder Than Life (2006)\n\nDocumentary about the history of heavy metal. Interviews with members of Twisted Sister, Kiss, Black Sabbath, Thin Lizzy, Judas Priest, Napalm Death, Whitesnake, Deep Purple, Ratt, God Forbid, The Scorpions, Korn, Overkill, Testament, Dio, Megadeth, The Donnas, Anthrax, Motorhead, Rainbow, Iron Maiden, Metallica, L.A. Guns, Kittie. Spoken language: English, Spanish subtitles. Format: AVI. Good quality DVD rip.\n\n\nHeavy Metal Parking Lot (1986) &amp; Heavy Metal Basement (2001)\n\nTwo short documentaries about heavy metal fans. The first one features interviews with fans who are gathering at a parking lot for a Judas Priest concert. The second one features interviews with a older heavy metal fan who keeps his record collection in his basement. Spoken language: English. Format: MPEG &amp; AVI. Good quality DVD rip &amp; medium quality DVD rip.\n\n\nVH1's Heavy: The Story Of Metal (2006)\n\nFour part documentary about the history of heavy metal. Interviews with Black Sabbath, Judas Priest, Twisted Sister, Skid Row, Dio, Anthrax, Pantera, Quiet Riot, Metallica, Megadeth, White Zombie, Velvet Revolver, Limp Bizkit, Great White, W.A.S.P., Alice Cooper, Slipknot, Iron Maiden, Kiss, Ratt, Motorhead, Queensryche, AC/DC, Def Leppard, Motley Crue, Poison, Warrant, Alice In Chains, Slayer, Marilyn Manson, Biohazard. Also contains old interview footage of Led Zeppelin, Van Halen and Guns 'N' Roses. Spoken language: English. Format AVI. Good quality DVD rip.\n\n\nMetal: A Headbanger's Journey (2005)\n\nSam Dunn's famous documentary about heavy metal music and culture. Interviews with Rush, Steppenwolf, Motorhead, Alice Cooper, Cannibal Corpse, Lamb Of God, Black Sabbath, Iron Maiden, Voivod, Slipknot, Korn, White Zombie, Rage Against The Machine, Mayhem, Dio, Twisted Sister, Motley Crue, Girlschool, Doro, Kittie, Arch Enemy, Slayer, Hades Almighty, Gorgoroth, Enslaved, Emperor. Also includes the short Norwegian Black Metal documentary which is extra material on the DVD. Interviews with Darkthrone, Enslaved, Mayhem, Emperor, Gorgoroth. Spoken language: English. Format: AVI. Good quality DVD rip.\n\n\nThe Decline Of Western Civilization part 2: The Metal Years (1988)\n\nDocumentary about metal in the eighties, focuses a lot on glam metal. Interviews with Kiss, Alice Cooper, Motorhead, Aerosmith, Ozzy Osbourne, Poison, London, Megadeth, Lizzy Borden, W.A.S.P., Faster Pussycat, Seduce, Odin. Spoken language: English. Format: MPEG. Low quality VHS rip.\n\n\nRat Skates - Born In The Basement (2007)\n\nFounding Overkill member Rat Skates tells the story behind the rise of thrash metal band Overkill and reflects back on the metal scene of the eighties. Includes all the bonuses of the DVD such as interviews with former Overkill members and old TV footage. Spoken language: English. Format: AVI. Good quality DVD rip.\n\n\nThis Is Spinal Tap (1984)\n\nLegendary mockumentary of fictional heavy metal band Spinal Tap. I included it in this torrent as a bonus. Spoken language: English. Format: AVI. Good quality DVD rip.\n\n\n\nGo here to download this torrent from ROCKBOX for additional trackers: &lt;a href=&quot;\nhttp://rockbox.psychocydd.co.uk/details.php?id=ca41703498a0bd630ad94c2055ad589277544fdc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://rockbox.psychocydd.co.uk/details.php?id=ca41703498a0bd630ad94c2055ad589277544fdc&lt;/a&gt;\n\n\n\nUploaded by: &lt;a href=&quot;\nhttp://www.ghostradio.co.nr&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ghostradio.co.nr&lt;/a&gt;\n\n\n\nSEED OR DIE!!","torrent":{"xt":"urn:btih:ca41703498a0bd630ad94c2055ad589277544fdc","amp;dn":"Eight+Metal+Music+Documentaries","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca41703498a0bd630ad94c2055ad589277544fdc","infoHashBuffer":{"type":"Buffer","data":[202,65,112,52,152,160,189,99,10,217,76,32,85,173,88,146,119,84,79,220]},"announce":[],"urlList":[]}}