{"title":"Salome's Last Dance (with commentary) [1988] Ken Russell","uid":6463796,"size":1153591504,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ca503ef010222387f7a9c9c5e4c6ce92ba825a27&amp;dn=Salome%5C%27s+Last+Dance+%28with+commentary%29+%5B1988%5D+Ken+Russell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1307886084,"description":" &lt;a href=&quot;http://bayimg.com/HaIfgAaDj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/HaIfgAaDj&lt;/a&gt;\n\nSalome's Last Dance (1988) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0096029/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0096029/&lt;/a&gt;\n\nFULLSCREEN CONTAINS TWO AUDIO TRACKS: 1. FILM SOUNDTARCK  2. COMMENTARY BY DIRECTOR KEN RUSSELL\n\nSalome's Last Dance is a 1988 film by British film director, Ken Russell. Although most of the action is a verbatim performance of Oscar Wilde's 1893 play Salome, which is itself based on a story from the New Testament, there is also a framing narrative written by Russell himself. Wilde (Nickolas Grace) and his lover Lord Alfred Douglas (Douglas Hodge) arrive late on Guy Fawkes Day at their friend's brothel, where they are treated to a surprise staging of Wilde's play, public performances of which have just been banned in England by the Lord Chamberlain's office.\n\nIn the play, all the roles are played by prostitutes or their clients, and each actor (except Grace) plays two roles, one in the brothel and the other in the play. King Herod (Stratford Johns) begs his young stepdaughter Salome (Imogen Millais-Scott) to dance for him, promising to give her anything she desires, much to the irritation of her mother, Herodias (Glenda Jackson). Salome ignores him, choosing instead to try and seduce John the Baptist, who is Herod's prisoner. John responds by loudly condemning both Herod and Salome in the name of God. A spurned and vengeful Salome then agrees to dance for Herod--on the condition that she be given anything she asks for. Herod agrees, but it is only after the dance is over that Salome asks for the head of John the Baptist on a platter. Herod is appalled, tries to dissuade her, but finally gives in to her request. The scenes from the play are interwoven with images of Wilde's exploits at the brothel.\n\nThis film met with modest critical acclaim. The review in the New York Times called it &quot;a perfumed, comic stunt,&quot; but noted that &quot;Mr. Russell forces one to attend to (and to discover the odd glory in) the Wilde language, which, on the printed page, works faster than Valium.&quot;\n\n Glenda Jackson ...  Herodias / Lady Alice \n Stratford Johns ...  Herod / Alfred Taylor \n Nickolas Grace ...  Oscar Wilde \n Douglas Hodge ...  John the Baptist / Lord Alfred 'Bosey' Douglas \n Imogen Millais-Scott ...  Salome / Rose \n Denis Lill ...  Tigellenus / Chilvers \n Russell Lee Nash ...  Pageboy \n Ken Russell ...  Cappadocian / Kenneth (as Alfred Russell) \n David Doyle ...  A. Nubin \n Warren Saire ...  Young Syrian \n Kenny Ireland ...  1st Soldier \n Michael Van Wijk ...  2nd Soldier \n Paul Clayton ...  1st Nazarean \n Imogen Claire ...  2nd Nazarean \n Tim Potter ...  Pharisee \n\nA. Nabda David Doyle Vestron Pictures Presents A Film Written And Directed By Ken Russell And Produced By Penny Corke. Based On The Play By Oscar Wilde And Translated From The French By Vivian Russell. Edited By Timothy Gee. Photographed By Harvie Harrison. Music Performed By The London Philharmonic Orchestra. Running Time: 90 Minutes. Classified R. ","torrent":{"xt":"urn:btih:ca503ef010222387f7a9c9c5e4c6ce92ba825a27","amp;dn":"Salome%5C%27s+Last+Dance+%28with+commentary%29+%5B1988%5D+Ken+Russell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca503ef010222387f7a9c9c5e4c6ce92ba825a27","infoHashBuffer":{"type":"Buffer","data":[202,80,62,240,16,34,35,135,247,169,201,197,228,198,206,146,186,130,90,39]},"announce":[],"urlList":[]}}