{"title":"U.S.-Chinese Relations: Perilous Past, Pragmatic Present","uid":6608186,"size":870353,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca9fd617072dac1f682ccfa1dd3465cfb5130c0c&amp;dn=U.S.-Chinese+Relations%3A+Perilous+Past%2C+Pragmatic+Present&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1313494797,"description":"This comprehensive and lucid assessment of the historical and contemporary determinants of Sino-American relations explains the conflicted engagement between the two governments. Offering a welcome richness of discussion and analysis, distinguished analyst Robert G. Sutter explores the twists and turns of the relationship over the past two hundred years. The mixed historical record convincingly shows that strong differences and mutual suspicions persist, only partly overridden by a mutual pragmatism that shifts with circumstances. Sutter judiciously considers the evolution and status of current areas of convergence and divergence in the relationship. He identifies key domestic and international factors that have led to the current positive but fragile equilibrium and what is at stake for the respective interests of the United State and China and for international stability. As the only book on the subject that combines a unified assessment of the historical evolution, contemporary status, and likely prospects of U.S.-Chinese relations, this balanced and pragmatic study will be an essential resource for all concerned with the globe's most crucial bilateral partnership.\n\nJune 2010\nPublisher: Rowman &amp; Littlefield \n","torrent":{"xt":"urn:btih:ca9fd617072dac1f682ccfa1dd3465cfb5130c0c","amp;dn":"U.S.-Chinese+Relations%3A+Perilous+Past%2C+Pragmatic+Present","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca9fd617072dac1f682ccfa1dd3465cfb5130c0c","infoHashBuffer":{"type":"Buffer","data":[202,159,214,23,7,45,172,31,104,44,207,161,221,52,101,207,181,19,12,12]},"announce":[],"urlList":[]}}