{"title":"Croc Legend of the Gobs and Croc 2 (PC Croc 1 and Croc 2)","uid":5839665,"size":513737141,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:caa6d5ddd802d43402b32fc4ac3739b3babe8a6e&amp;dn=Croc+Legend+of+the+Gobs+and+Croc+2+%28PC+Croc+1+and+Croc+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FuCtUpPuNk","files":11,"time":1284890900,"description":"*****CROC*****\nCroc is a free-roaming game title, with Croc's movement differing slightly depending on whether players use the directional pad or the analogue controller to control him. His main moves consist of a tail whip attack that can temporarily destroy enemies, and a butt stomp used for smashing open crates. Croc also possess the ability to swim in select levels. Throughout the game Croc collects crystals which serve as health in a similar fashion to golden rings in Sonic the Hedgehog, meaning the player will lose a life if hit without holding any crystals in their inventory. Crystals retained at the end of a level are stored, with Croc gaining an extra life for every 100 he collects.\n\nProgressing through the levels involves finding and hitting the Beany Gong at the end of the level to move onto the next, facing two bosses during each island. However, to fully complete the game, Croc has to rescue the captured Gobbos throughout each level. Each level contains six Gobbos, including one hidden behind a door at the end of the level. This Gobbo can only be released by collecting five coloured crystals throughout the level. Collecting all the Gobbos before a boss level unlocks an extra level in which a Jigsaw Piece can be earned. When the player collects all of these pieces, a new island is opened up, leading to the game's final boss, Baron Dante in crystal form\n\n\n*****CROC 2*****\nCroc 2 has advanced considerably compared to the previous game. Instead of simply finding six Gobbo in each level, the player must now complete various tasks.\n\nOne of the many changed elements is the health system; instead of the extra life system that Legend of the Gobbos had, Croc now has only one life and a heart count of up to 9; each hit Croc takes, or any time Croc falls into a bottomless pit, takes away one heart; the heart count can be restored by finding heart tokens in the levels, or by collecting 100 crystals; the starting maximum count for hearts is three, the player can buy Heart Pots from Swap Meet Pete to be able to collect more hearts.\n\nA new addition to the game is that Croc has an extra jump, that is triggered by stomping and repeatedly pressing the jump button before hitting the ground and he can also ride vehicles in some levels, which include mine carts, a race car, a speedboat, a hot-air balloon, a hang-glider and an aeroplane.\n\nAnother new aspect is Swap Meet Pete's General Store. The store is owned by a large, anthropomorphic cat, named Pete. Pete is capable of teleporting Croc to other Gobbo Villages with the use of his Crystal Ball.\n\nThere are four villages Croc must traverse through before reaching the end of the game, each with Gobbo of different personalities. The four villages are the Sailor Village, the Cossack Village, the Caveman Village and the Inca Village. Each village has five levels, two bosses (with the exception of the Inca Village, which has only two levels, and one boss) and one Golden Gobbo level. Once the fourth village is finished, Croc then travels to Baron Dante's Tower of Power, and once the Jigsaw Puzzle Pieces are assembled, a fifth village can be unlocked; the fifth village is a corrupted version of the Gobbo village, created by Dante.\n\nINSTALLATION:\nExtract\nMount or burn\nInstall\ncopy over any cracks to game directory replacing existing\nplay\n\nENJOY AND SEED PLEASE!!!!!\n\n\n\n\n-----------------------------------------------------------------------------------\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:caa6d5ddd802d43402b32fc4ac3739b3babe8a6e","amp;dn":"Croc+Legend+of+the+Gobs+and+Croc+2+%28PC+Croc+1+and+Croc+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caa6d5ddd802d43402b32fc4ac3739b3babe8a6e","infoHashBuffer":{"type":"Buffer","data":[202,166,213,221,216,2,212,52,2,179,47,196,172,55,57,179,186,190,138,110]},"announce":[],"urlList":[]}}