{"title":"Till the World Ends(Britney Spears) 320kbps+Lyrics-ANM","uid":6340918,"size":9849781,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cb067206c2a1f4e26e8e4959db01abf1eff7e8cf&amp;dn=Till+the+World+Ends%28Britney+Spears%29+320kbps%2BLyrics-ANM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AmpleNM","files":-1,"time":1303659494,"description":"    ****AmpleNM.blogspot.com****\n    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n     For More, Visit Our Blog\n   Get Torrents On Your Demand\n\n&quot;Till the World Ends&quot; is a song by American recording artist Britney Spears. It was released as the second single from her seventh studio album, Femme Fatale. &quot;Till the World Ends&quot; was written by Dr. Luke, Alexander Kronlund, Max Martin and Kesha, while being produced by Dr. Luke, Max Martin and Billboard. The main inspiration of the song for Kesha was imagining Spears and any other female musicians touring the world. &quot;Till the World Ends&quot; was leaked on March 3, 2011, and was released for digital download the following day. The song is composed as an uptempo dance-pop and electropop song with a chant-like chorus, where Spears sings about dancing until the end of the world.\n&quot;Till the World Ends&quot; received mostly positive reviews, with critics calling it a catchy dance track and complimenting its anthemic nature. The song has charted within the top twenty in many countries worldwide, while peaking inside the top ten in nations such as Canada, Finland, Ireland, New Zealand and the United States. Spears has performed &quot;Till the World Ends&quot; at Rain Nightclub, Good Morning America and Jimmy Kimmel Live!.\nAn accompanying music video for the song was released on April 6, 2011. Directed by Ray Kay, it portrays Spears in an underground dance party set on December 21, 2012. Critics noted the similarities with the music video for &quot;I'm a Slave 4 U&quot; (2001), and predominantly gave positive reviews for it. A choreography cut was released on April 15, 2011. A remixed version of the song, featuring Kesha and rapper Nicki Minaj was scheduled to be released on April 25, 2011, but was leaked on April 22, 2011.\n\n\nReleased\tMarch 4, 2011\nFormat\t        CD single, digital download\nRecorded\tConway Studios, Los Angeles\nGenre\t        Dance-pop, electropop\nLength\t        3:58\nLabel\t        Jive\nWriter(s)\tLukasz Gottwald, Alexander Kronlund, Max Martin, Kesha Sebert\nProducer\tDr. Luke, Max Martin, Billboard","torrent":{"xt":"urn:btih:cb067206c2a1f4e26e8e4959db01abf1eff7e8cf","amp;dn":"Till+the+World+Ends%28Britney+Spears%29+320kbps%2BLyrics-ANM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb067206c2a1f4e26e8e4959db01abf1eff7e8cf","infoHashBuffer":{"type":"Buffer","data":[203,6,114,6,194,161,244,226,110,142,73,89,219,1,171,241,239,247,232,207]},"announce":[],"urlList":[]}}