{"title":"Paseando a MIss Daisy 1989 [DVDRIp][spanish]","uid":6800435,"size":1469943808,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cb0abe96fad57f79d4a3a4b0157b2e9b4cd7f3a5&amp;dn=Paseando+a+MIss+Daisy+1989+%5BDVDRIp%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1320672454,"description":"Paseando a Miss Daisy (1989)\n \n\n\nEn 1948 la SeÃƒÂ±ora Daisy Werthan, es una viuda judÃƒÂ­a de 72 aÃƒÂ±os que vive en Atlanta, Georgia, en la compaÃƒÂ±ÃƒÂ­a de su trabajadora domÃƒÂ©stica de color, llamada Idella. DespuÃƒÂ©s de un accidente en su automÃƒÂ³vil Chrysler, el hijo de la SeÃƒÂ±ora Daisy, Boolie, le contrata un chÃƒÂ³fer porque ninguna compaÃƒÂ±ÃƒÂ­a de seguro la asegurarÃƒÂ¡. Ella se niega, pero Boolie estÃƒÂ¡ decidido a encontrar uno. Mientras tanto, ella estÃƒÂ¡ parada en casa incapaz de realizar sus compras, visitar a sus amigos y asistir a la sinagoga, por no poder conducir. Boolie encuentra a un hombre, Hoke Colburn. La seÃƒÂ±ora Daisy en un principio se niega a la ayuda de Hoke, ante el hecho de que las personas puedan llegar a creer que es demasiada vieja y tonta para conducir.\n\nLa seÃƒÂ±ora Daisy llega a aceptar la ayuda de Hoke y el hecho de que ella necesita ayuda para transportarse. La seÃƒÂ±ora Daisy descubre que Hoke no sabe leer, y por su antigua profesiÃƒÂ³n como maestra le enseÃƒÂ±a cÃƒÂ³mo leer. La seÃƒÂ±ora Daisy tiene que asistir a la fiesta de cumpleaÃƒÂ±os nÃƒÂºmero noventa de su hermano en Mobile, Alabama. Hoke le revela, durante el viaje, que es la primera vez que ÃƒÂ©l ha salido del Estado de Georgia. Durante su viaje de Atlanta a Mobile, la seÃƒÂ±ora Daisy se ve confrontada en varias circunstancias durante el viaje, con los prejuicios sociales y raciales. Al paso del tiempo la seÃƒÂ±ora Daisy toma aprecio por Hoke. En 1965, mientras veÃƒÂ­an la televisiÃƒÂ³n en la cocina, Idella muere. La seÃƒÂ±ora Daisy entristece por la cercanÃƒÂ­a y el tiempo que compartiÃƒÂ³ con Idella, y acompaÃƒÂ±ada por su familia son las ÃƒÂºnicas personas blancas en el funeral.\n\nREPARTO \tMorgan Freeman, Jessica Tandy, Dan Aykroyd, Patti Lupone,\nPREMIOS \t1989: 4 Oscars: Mejor pelÃƒÂ­cula, actriz (Tandy), guiÃƒÂ³n adaptado, maquillaje. 9 nominaciones\n1989: Globos de Oro: Mejor pelÃƒÂ­cula: Comedia o Musical ","torrent":{"xt":"urn:btih:cb0abe96fad57f79d4a3a4b0157b2e9b4cd7f3a5","amp;dn":"Paseando+a+MIss+Daisy+1989+%5BDVDRIp%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb0abe96fad57f79d4a3a4b0157b2e9b4cd7f3a5","infoHashBuffer":{"type":"Buffer","data":[203,10,190,150,250,213,127,121,212,163,164,176,21,123,46,155,76,215,243,165]},"announce":[],"urlList":[]}}