{"title":"Boogie Nights (1997) (Mark Wahlberg, Burt Reynolds)","uid":4215864,"size":840273985,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cb7d01328eae3b8b8195bb4a11f94f198a4c8558&amp;dn=Boogie+Nights+%281997%29+%28Mark+Wahlberg%2C+Burt+Reynolds%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JayRay","files":-1,"time":1212337252,"description":"BOOGIE NIGHTS - 1997\n\nIMDb Rating: 7.8\nhttp://www.imdb.com/title/tt0118749/\n\nNominated for 3 Academy Awards.\n\n This film is widely considered to be one of the finest depictions of the porn film industry. The film revived the career of Burt Reynolds and moved Mark Wahlberg and Julianne Moore into the A-list of serious actors.\n  Although loosely based on the life and times of real-life porn legend John Holmes, at heart it's a classic Hollywood rise-and-fall fable: a naive, good-looking young busboy is discovered in a San Fernando Valley disco by a famous motion picture producer, becomes a hotshot movie star, lives the high life, and then loses everything when he gets too big for his britches, succumbs to insobriety, and is left behind by new times and new technology. The ambitious upstart changes his name and achieves stardom in porno films as &quot;Dirk Diggler.&quot; Instead of drinking to excess, he snorts cocaine (the classic drug of '70s hedonism); and it's the coming of home video that helps to dash his big-screen dreams. As for the britches ... well, the controversial &quot;money shot&quot; explains everything. And the cast is one of the great ensembles of the '90s, including Oscar nominees Burt Reynolds and Julianne Moore, Mark Wahlberg (who proved with this movie that he really can act), Heather Graham (as Rollergirl), William H. Macy, John C. Reilly, and Ricky Jay.\n\n  Starring: Mark Wahlberg, Burt Reynolds, John C. Reilly, Julianne Moore, Heather Graham, Don Cheadle, Luis Guzman, Philip Seymour Hoffman. \n\n  Directed by: Paul Thomas Anderson.\n\n  Quality: Very Good Xvid from DVD.\n\n  Length: 2hr. 35min.\n\n  Language: English.\n\n  Size: 720 x 336","torrent":{"xt":"urn:btih:cb7d01328eae3b8b8195bb4a11f94f198a4c8558","amp;dn":"Boogie+Nights+%281997%29+%28Mark+Wahlberg%2C+Burt+Reynolds%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb7d01328eae3b8b8195bb4a11f94f198a4c8558","infoHashBuffer":{"type":"Buffer","data":[203,125,1,50,142,174,59,139,129,149,187,74,17,249,79,25,138,76,133,88]},"announce":[],"urlList":[]}}