{"title":"Refuting Compromise - Jonathan Sarfati","uid":11773233,"size":1920329,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc27faf75ff7fa93d9ac0c994bb035cfa46a8d9d&amp;dn=Refuting+Compromise+-+Jonathan+Sarfati&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427159506,"description":"\nWith brilliant clarity, Jonathan Sarfati, author of the best-selling Refuting Evolution (1 and 2) has produced a comprehensive and ringing refutation of the position of progressive creationist Hugh Ross, whose views are causing massive confusion about science and the Bible. This book is one of the most powerful biblical and scientific defenses of a straightforward view of Genesis creation ever written.\n\n\nAbout the author:\nJonathan D. Sarfati, Ph.D, F.M., was born in Ararat, Australia, in 1964. He moved to New Zealand as a child, where he later studied mathematics, geology, physics, and chemistry at Victoria University in Wellington. He obtained honors level in physical and inorganic chemistry, as well as in condensed matter physics and nuclear physics. He received his Ph.D. in physical chemistry from the same institution in 1995 on the topic of pectroscopy, especially vibrational. He has co-authored various technical papers on such things as high temperature superconductors and sulfur and seleniumcontaining ring and cage molecules.\nAs well as being very interested in formal logic and philosophy, Dr Sarfati is a keen chess player. He represented New Zealand in three Chess Olympiads and is a former New Zealand national chess champion. In 1988, F.I.D.E., the International Chess Federation, awarded him the title of F.I.D.E. Master (F.M.). A Christian since 1984, he was for some years on the editorial committee of Apologia, the journal of the Wellington Christian Apologetics Society, of which he was a co-founder.\nDr Sarfati currently works full-time for Answers in Genesis in Brisbane, Australia, a non-profit ministry, as a research scientist and editorial consultant for Creation Ex Nihilo family magazine and the associated Technical Journal, and has written many articles for both. He also contributes specialist information to the Answers in Genesis Internet website","torrent":{"xt":"urn:btih:cc27faf75ff7fa93d9ac0c994bb035cfa46a8d9d","amp;dn":"Refuting+Compromise+-+Jonathan+Sarfati","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc27faf75ff7fa93d9ac0c994bb035cfa46a8d9d","infoHashBuffer":{"type":"Buffer","data":[204,39,250,247,95,247,250,147,217,172,12,153,75,176,53,207,164,106,141,157]},"announce":[],"urlList":[]}}