{"title":"Supremacia.Bourne.2004.dvd-r.JabaMSJP","uid":11151666,"size":4649634247,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cc69124be276774f6a08bf0dc942c44c4fd8634e&amp;dn=Supremacia.Bourne.2004.dvd-r.JabaMSJP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MegaSeedersJp","files":80,"time":1412348492,"description":"The Bourne Supremacy is a 2004 American-German action and spy film loosely based on Robert Ludlum's novel of the same name. The film was directed by Paul Greengrass from a screenplay by Tony Gilroy. Universal Pictures released the film to theaters in the United States on July 23, 2004. It is the second in the Bourne film series. It is preceded by The Bourne Identity (2002) and followed by The Bourne Ultimatum (2007) and The Bourne Legacy (2012).\n\nThe Bourne Supremacy continues the story of Jason Bourne, a former CIA assassin suffering from psychogenic amnesia.[3] Bourne is portrayed by Matt Damon. The film focuses on his attempt to learn more of his past as he is once more enveloped in a conspiracy involving the CIA and Operation Treadstone. The film also stars Brian Cox as Ward Abbott, Joan Allen as Pamela Landy and Julia Stiles as Nicky Parsons.\nTwo years after the events of the first film, Jason Bourne and Marie Kreutz are now in Goa, India. Still experiencing flashbacks about his former life as a CIA assassin, he records them in a notebook.\n\nIn Berlin, CIA agents subordinate to Deputy Director Pamela Landy are paying US$3 million for the &quot;Neski files&quot;, documents on the theft of $20 million in allocation money seven years prior. Kirill, an agent for Russia's Federal Security Service, plants Bourne's fingerprint to frame him, kills the agents, and steals the files and money for delivery to Russian oil oligarch Yuri Gretkov. Kirill travels to Goa to kill Bourne, but Bourne spots him and flees with Marie. As the couple drive away, Kirill attempts to shoot Bourne, but kills Marie by mistake. Their vehicle goes off a bridge and into a river; Kirill assumes that Bourne is dead.","torrent":{"xt":"urn:btih:cc69124be276774f6a08bf0dc942c44c4fd8634e","amp;dn":"Supremacia.Bourne.2004.dvd-r.JabaMSJP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc69124be276774f6a08bf0dc942c44c4fd8634e","infoHashBuffer":{"type":"Buffer","data":[204,105,18,75,226,118,119,79,106,8,191,13,201,66,196,76,79,216,99,78]},"announce":[],"urlList":[]}}