{"title":"Manhood: The Rise and Fall of the Penis","uid":6658868,"size":2860435,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc7c8859461ba18973532e3d3d55a41b4463d949&amp;dn=Manhood%3A+The+Rise+and+Fall+of+the+Penis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1315431436,"description":"The ancient Greeks paraded enormous sculptural replicas in annual celebration of the penis; Freud theorized that women suffered penis envy. An undeniable, global symbol of power and virility since the beginning of humankind, the penis has been much discussed, gestured towards, and depicted, yet seldom understood outside folklore and popular culture's uneasy mix of self-deprecation and aggrandizement. Despite the penis's central role in human life or perhaps due to that role, many men seem to suffer in isolation or silence from some perceived inadequacy or affliction. That's where experienced urologist and sexologist Mels van Driel comes in. In Manhood he offers an unprecedented history of the penis - with answers to everything you ever wanted to know, and even some questions you'd never thought to ask.\n In Manhood, van Driel presents the history of the male sexual organ from medical, psychological and cultural perspectives. Investigating the penis and its functions, from the scrotum to the glans, van Driel's work ranges from inguinal hernia to infertility, and from impotence to the speed of ejaculation. Psychological factors that have an impact on sexual experience, as well as contemporary phenomena such as cyber sex, are given enlightening treatment along the way.\n\nReaktion Books\n2010 \n \n","torrent":{"xt":"urn:btih:cc7c8859461ba18973532e3d3d55a41b4463d949","amp;dn":"Manhood%3A+The+Rise+and+Fall+of+the+Penis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc7c8859461ba18973532e3d3d55a41b4463d949","infoHashBuffer":{"type":"Buffer","data":[204,124,136,89,70,27,161,137,115,83,46,61,61,85,164,27,68,99,217,73]},"announce":[],"urlList":[]}}