{"title":"Stumbleine - Spiderwebbed (2012) [FLAC]","uid":8255800,"size":260707060,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cd12259c81f4d537d57a025bdfb24d2e80b852b3&amp;dn=Stumbleine+-+Spiderwebbed+%282012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1363220847,"description":"\n  Stumbleine - Spiderwebbed (2012) [FLAC]\n\n  Released: 2012\n  Genre: Pop/Rock\n  Style: Alternative, Indie\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Cherry Blossom \n  02 If You \n  03 Capulet \n  04 The Beat My Heart Skips feat. CoMa \n  05 Honey Comb \n  06 Solar Flare \n  07 Fade Into You feat. Steffaloo \n  08 Kaleidoscope \n  09 The Corner Of Her Eye \n  10 Catherine Wheel ft Birds Of Passage \n  \n\n  Stumbleine has in many ways done exactly what a 21st century artist should - self-release a slew of music online, keep his hand in via collaborative efforts, both in bands and with other performers, and generally aim to capture an audience. What's especially nice about his full-length debut, Spiderwebbed, isn't that it's good, but that it's surprisingly great - if it slots into the psuedo-genre of sensitive dudes in bedrooms trying to record a combination of shoegaze and modern R&amp;B, that's only a flag of convenience, simply because the end results sparkle that nicely. Three collaborations appear on the release, including a cover of &quot;Fade Into You&quot; by Mazzy Star that, while it can't capture either the original of Richard X's inspired reworking with the help of Jarvis Cocker, still provides a lovely showcase for Steffaloo's singing. Meanwhile, Co Ma takes a turn on &quot;The Beat My Heart Skips,&quot; which practically defines 21st century electro-gaze by example - crisp, punchy beats, dream pop guitars, ethereal vocals, and more - while &quot;Catherine Wheel&quot; has Birds of Passage along for a big anthemic surge. Otherwise it's all up to Stumbleine himself and he does a fine job; his treated falsetto is a familiar touch, perhaps, but he handles it well as a squirrelly, sometimes distant thing, less like trying to croon in your ear than echo across a void. A song like &quot;Cherry Blossom&quot; wears its poppiness on its sleeve while not forgetting to add a slow, calmer coda, while &quot;Capulet&quot; stretches out more with the flow of the guitars and a steady cascade, beats to the fore, and a chorus that adds extra falsetto lift. The rave-tinged swells of &quot;Kaleidoscope&quot; and the great verses and breakdowns of &quot;Solar Flare&quot; also deserve notice.","torrent":{"xt":"urn:btih:cd12259c81f4d537d57a025bdfb24d2e80b852b3","amp;dn":"Stumbleine+-+Spiderwebbed+%282012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd12259c81f4d537d57a025bdfb24d2e80b852b3","infoHashBuffer":{"type":"Buffer","data":[205,18,37,156,129,244,213,55,213,122,2,91,223,178,77,46,128,184,82,179]},"announce":[],"urlList":[]}}