{"title":"The Art of Getting By (2011) [DVDRip][DUAL][Eng-Spa]","uid":6967859,"size":1568497664,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce834ad34287445d00e311143f99dc9aede6e2fc&amp;dn=The+Art+of+Getting+By+%282011%29+%5BDVDRip%5D%5BDUAL%5D%5BEng-Spa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1326986453,"description":"El arte de pasar de todo (2011) [DVDRip][DUAL][Eng-Spa]\n &lt;a href=&quot;\nhttp://www.rottentomatoes.com/m/the_art_of_getting_by/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rottentomatoes.com/m/the_art_of_getting_by/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1645080/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1645080/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.elartedepasardetodo.es/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elartedepasardetodo.es/&lt;/a&gt;\n\nEnglish:\n--------\nQuality: DVDRip\nAudio: InglÃƒÂ©s/AC35.1-Castilian \nCodec: Xvid\nResolution: 720x304\nFile Size: 1.45 GB\n\nTitle: The Art of Getting By\nCountry: USA\nUSA release: 17/06/2011\nReleased in Spain: 30/09/2011\nStudio: Fox Searchlight\nDirector: Gavin Wiesen\nWritten by: Gavin Wiesen\nStarring: Freddie Highmore, Emma Roberts, Sasha Spielberg, Marcus Carl Franklin, Ann Dowd, Maya Ri Sanchez, Blair Underwood, Ann Harada, Rita Wilson, Jarlath Conroy, Elizabeth Reaser, Andrew Levitas, Sam Robards, Alicia Silverstone, Michael Angarano, Dan Leonard, Sophie Curtis\n\nSynopsis:\n'The art of passing around' is the hilarious story of the beginning of adult life of George, a lonely teenager and fatalism that has reached the final year that could not seriously worked a single day. It has been a friend of Sally, a pretty girl and complicated that it recognizes a kindred spirit.\n\nAs the end of last year, George (Freddie Highmore) has managed to complete most of their academic curriculum through high school without having actually made the least effort. Even in art class, the only subject that interests you is dedicated to doodling instead of the task. A few months after graduating, he spends most of his time alone, carving glass instead of making plans for the school dance and engage in search for colleges. Then, seized by an impulse load with the guilt of one of the most beautiful and popular girls from high school, when it is caught smoking on the roof.\n\nCorrespondingly, Sally (Emma Roberts) as a hurricane drags him into his intense world. He invites the fashionable parties, accompanies him to galleries and museums, going to him pellets and ends up becoming her best friend. Almost inevitably, George, a boy from the pile, you find that you crave flirty pieces of Sally, but is unable to find a way to let him know your feelings. When you think you have found a role model in Dustin (Michael Angarano), a former student of the institute and great looking young painter who is known in the academic orientation day, George begins to imagine a life of artist whose muse would be Sally.\n\nSally George provides shelter from a shelter where the vulgarity of the institute and the uncertainty of the home, where the situation between his mother and stepfather is not what it seems. Then, with the end of last year throwing it up, George gets an ultimatum from the director (Blair Underwood), or complete the following three weeks all the tasks that have not made all year, or will not graduate. George did not take to see how quickly the world falls apart when one has perfected the art of getting by.\n\n\nEspaÃƒÂ±ol:\n--------\nCalidad: DVDRip\nAudio: InglÃƒÂ©s/AC3 5.1-Castellano\nCodec: Xvid\nResoluciÃƒÂ³n: 720x304\nTamaÃƒÂ±o de archivo: 1.45 GB\n\nTÃƒÂ­tulo: El arte de pasar de todo\nTÃƒÂ­tulo original: The Art of Getting By\nPaÃƒÂ­s: USA\nEstreno en USA: 17/06/2011\nEstreno en EspaÃƒÂ±a: 30/09/2011\nProductora: Fox Searchlight\nDirector: Gavin Wiesen\nGuiÃƒÂ³n: Gavin Wiesen\nReparto: Freddie Highmore, Emma Roberts, Sasha Spielberg, Marcus Carl Franklin, Ann Dowd, Maya Ri Sanchez, Blair Underwood, Ann Harada, Rita Wilson, Jarlath Conroy, Elizabeth Reaser, Andrew Levitas, Sam Robards, Alicia Silverstone, Michael Angarano, Dan Leonard, Sophie Curtis\n\nSinopsis:\n'El arte de pasar de todo' es el divertido relato del principio de la vida adulta de George, un adolescente solitario y fatalista que ha llegado hasta el ÃƒÂºltimo curso sin poder decir que haya trabajado en serio ni un solo dÃƒÂ­a. Se ha hecho amigo de Sally, una chica guapa y complicada que reconoce en ÃƒÂ©l a un alma gemela.\n\nAl aproximarse el final del ÃƒÂºltimo curso, George (Freddie Highmore) ha conseguido completar casi todo su itinerario acadÃƒÂ©mico hasta el instituto sin haber realmente hecho el mÃƒÂ­nimo esfuerzo. Incluso en la clase de arte, la ÃƒÂºnica asignatura que le interesa, se dedica a hacer garabatos en lugar de la tarea. A escasos meses de graduarse, pasa la mayor parte del tiempo solo, tallando vidrio en vez de hacer planes para el baile del instituto y dedicarse a buscar universidades. Entonces, presa de un impulso, carga con la culpa de una de las alumnas mÃƒÂ¡s guapas y populares del instituto, cuando ÃƒÂ©sta es sorprendida fumando en el tejado.\n\nEn correspondencia, Sally (Emma Roberts) le arrastra como un huracÃƒÂ¡n al interior de su intenso mundo. Le invita a las fiestas de moda, le acompaÃƒÂ±a a galerÃƒÂ­as y museos, se va con ÃƒÂ©l de pellas y acaba convirtiÃƒÂ©ndose en su mejor amiga. De forma casi inevitable, George, un chico del montÃƒÂ³n, descubre que se muere por los pedazos de la coqueta Sally, pero es incapaz de hallar el modo de hacerle saber sus sentimientos. Cuando cree haber encontrado un modelo de conducta en Dustin (Michael Angarano), antiguo alumno de su instituto y joven pintor de gran futuro al que conoce en el dÃƒÂ­a de orientaciÃƒÂ³n acadÃƒÂ©mica, George comienza a imaginar una vida de artista, cuya musa serÃƒÂ­a Sally.\n\nSally proporciona a George un refugio donde cobijarse de la vulgaridad del instituto y de la incertidumbre del hogar, donde la situaciÃƒÂ³n existente entre su madre y su padrastro no es lo que parece. Entonces, con el final del ÃƒÂºltimo curso echÃƒÂ¡ndosele encima, George recibe un ultimÃƒÂ¡tum del director (Blair Underwood): o completa en las siguientes tres semanas todas las tareas que no ha realizado en todo el aÃƒÂ±o, o no se graduarÃƒÂ¡. George no tarda en ver cuÃƒÂ¡n rÃƒÂ¡pidamente el mundo se viene abajo cuando uno ha perfeccionado el arte de ir tirando.","torrent":{"xt":"urn:btih:ce834ad34287445d00e311143f99dc9aede6e2fc","amp;dn":"The+Art+of+Getting+By+%282011%29+%5BDVDRip%5D%5BDUAL%5D%5BEng-Spa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce834ad34287445d00e311143f99dc9aede6e2fc","infoHashBuffer":{"type":"Buffer","data":[206,131,74,211,66,135,68,93,0,227,17,20,63,153,220,154,237,230,226,252]},"announce":[],"urlList":[]}}