{"title":"Edstrom&amp;Eller-Barbarians Led by Bill Gates(english version)(1999","uid":4738362,"size":1133009,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf2e6713315eb324680f231433c053e8adb19936&amp;dn=Edstrom%26Eller-Barbarians+Led+by+Bill+Gates%28english+version%29%281999&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"red_gonzo","files":1,"time":1235419499,"description":"This is Jennifer Edstrom's und Marlin Eller's amazing book Barbarians Led by Bill Gates - Microsoft from the Inside - How the World's Richest Corporation Wields Its Power (1999) which is a third-person account of the experiences of Eller at Microsoft as it goes into detail about the early years of Microsoft and its emergence as a massive corporation. How has Microsoft been able to crush its competition every step of the way? The company's own version of history ascribes it to something like &quot;really great technical innovation.&quot; But this shocking book presents a harsher and messier history, sharply questioning Microsoft's ethics and corporate wisdom while underscoring its fierce will to compete. The authors present a history of Microsoft from the early '80s to the present, covering the big projects, both successes and failures, that defined the company's direction. It's a difficult story to tell, filled with complex technology and a large cast of characters who are rarely in the public eye. Perhaps the most surprising thing to emerge is how many Microsoft ventures were mismanaged and how many opportunities were missed. The best-known of these is Microsoft's near-catastrophic failure to see the arrival and success of the Internet. The book also details the unplanned success of Windows 3.0, the demise of Pen Windows, and the compromised design and slow success of Windows 95. A final chapter tackles the Netscape-Microsoft Web-browser war and Microsoft's head-on collision with the Justice Department. Both authors are, in different ways, Microsoft insiders. Edstrom is the daughter of Pam Edstrom, Gates's long-time PR chief and spin doctor. Eller is a 13-year veteran Microsoft developer who has worked on DOS, early versions of Windows, and pen computing. Both stand open to the charge of having an ax to grind, and the reader senses a lot of personal animosity at work. If you ever doubted that Microsoft plays to win, or ever wondered how they do it, you'll learn a lot from this lively memoir that takes us inside the walls at Redmond. In the press we see what Microsoft wants the world to know. Here, the programmers in the trenches let us in on how they see it. 245 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:cf2e6713315eb324680f231433c053e8adb19936","amp;dn":"Edstrom%26Eller-Barbarians+Led+by+Bill+Gates%28english+version%29%281999","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf2e6713315eb324680f231433c053e8adb19936","infoHashBuffer":{"type":"Buffer","data":[207,46,103,19,49,94,179,36,104,15,35,20,51,192,83,232,173,177,153,54]},"announce":[],"urlList":[]}}