{"title":"Anna Russell - The Anna Russell Album","uid":8774714,"size":184796141,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d0206bcbb5853e961253a3352a097ae822ad38cc&amp;dn=Anna+Russell+-+The+Anna+Russell+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"txpohayleyh","files":9,"time":1375525364,"description":"The Great Anna Russell\n\nRipped from the CD at 320kbps.\nMp3 format.\n\nTrack list:\n1. Introduction to the Concert (By Women's Club President) (Live)\n2. How to Write Your Own Gilbert and Sullivan Opera (Live) \n3. Coloratura aria: Canto dolciamente pipo from the opera La Cantatrice Squelante (Live) \n4. British - pure but dull: I Love the Spring (Live)\n5. Russian folk song: Da, Nyet, Da, Nyet (Live)\n6. For loud singers with no brains: Ah Lover! from the operetta The Prince of Philadelphia (Live)\n7. For singers with tremendous artistry but no voice: Schlumph; Je n'ai pas la Plume de ma Tante (Live) \n8. For the dramatic soprano: Schreechenrauf (Live)\n9. The Ring of the Nibelungs (An analysis) (Live) \n\nComment from Amazon:\n&quot;This set of Anna Russell's inspired satirical monologues should be labeled with a warning notice. Why? Because after listening to her whirlwind explication of Wagner's Ring Cycle, even the most confirmed Wagnerite will be unable to listen to the Ring for weeks to come. Just listening to Russell declare in an incredulous voice: &quot;I'm not making this up, y'know&quot; is enough to induce you to shed bucketloads of laughter-induced tears. Gilbert and Sullivan fans will find their heroes savaged in her concoction of a typical G&amp;S product, complete with a soprano lead who &quot;loves below her station.&quot; Other targets include &quot;the nymphs and shepherds&quot; style of quavery English singing, complete with &quot;hey-nonny-nonny's,&quot; coloratura mad scenes, and much else, including Russian folk songs, like her &quot;Da, nyet, da, nyet.&quot; This disc is packed with laughs, chuckles, smiles, and everything. --Dan Davis \n\n&quot;Anna Russell combines her excellent knowledge of and training in opera with her brilliantly satirical wit to create hilarious send-ups of Wagner's The Ring cycle, Gilbert &amp; Sullivan, and more. Whether you love opera or couldn't care less, Russell will have you in stitches.&quot;\n","torrent":{"xt":"urn:btih:d0206bcbb5853e961253a3352a097ae822ad38cc","amp;dn":"Anna+Russell+-+The+Anna+Russell+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0206bcbb5853e961253a3352a097ae822ad38cc","infoHashBuffer":{"type":"Buffer","data":[208,32,107,203,181,133,62,150,18,83,163,53,42,9,122,232,34,173,56,204]},"announce":[],"urlList":[]}}