{"title":"Arthur Lee - Vindicator [1972] [FLAC]","uid":8046130,"size":372042803,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d0270970bdcc6cf055d87609fbc3070ff08a585e&amp;dn=Arthur+Lee+-+Vindicator+%5B1972%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":22,"time":1358749831,"description":"Artist: Arthur Lee\nRelease: Vindicator\nDiscogs: 2012749\nReleased: 1972 / 1997\nLabel: A&amp;M Records\nCatalog#: AMLS 64356 / 540 687-2\nFormat: FLAC / Lossless / Log (100%) / Cue / CD, Reissue, Remastered\nCountry: UK\nStyle: Rock, Rock &amp; Roll\n\nTracklisting:\n\n01. Sad Song (2:19)\n02. You Can Save Up To 50% But You're Still A Long Ways From Home (0:17)\n03. Love Jumped Through My Window (2:15)\n04. Find Somebody (3:44)\n05. He Said She Said (2:15)\n06. Every Time I Look Up I'm Down Or White Dog (I Don't Know What That Means !) (3:54)\n07. Everbody's Gotta Live (3:29)\n08. You Want Change For Your Re-Run (4:14)\n09. He Knows A Lot Of Good Women (Or Scotty's Song) (3:13)\n10. Hamburger Breath Stinkfinger (2:44)\n11. Ol' Morgue Mouth (0:56)\n12. Busted Feet (5:01)\nBonus Tracks\n13. Everbody's Gotta Live (Previously Unreleased Version) (3:30)\n14. He Knows A Lot Of Good Women (Previously Unreleased Version) (3:11)\n15. Pencil In Hand (Early Version Of &quot;He Said She Said&quot;) (2:10)\n16. E-Z Rider (Previously Unreleased, A Jimmy Hendrix Song) (2:58)\n17. Looking Glass Looking At Me (Early Version Of &quot;You Want Change For Your Re-Run&quot;) (4:06)\n\nLove's 1967 masterpiece Forever Changes was an album so beautiful and timeless that it tends to dwarf everything else in the group's repertoire, and its gentle balance of grace and dread has made a lot of people forget just how hard Love could rock when Arthur Lee and his bandmates were of a mind. While Love's debut album pushed folk-rock into an overdrive that resembled punk, Lee's first solo set, 1972's Vindicator, was a muscular set of guitar-fueled hard rock laced with blues, showing the clear influence of Lee's late friend Jimi Hendrix. With Charles Karp's powerful guitar leads dominating the arrangements and Lee's vocals strutting with maximum rock star swagger on tunes like &quot;Love Jumped Through My Window&quot; and &quot;Sad Song,&quot; Vindicator boogies with a cocky confidence that belies the fact Lee's career was in need of a clear direction at the time, and while there are no signs of the delicacy of Forever Changes, three decades on this sounds like mid-'70s guitar rock at its best. Lee was able to bring a soulful edge to songs like &quot;Everybody's Gotta Live&quot; and &quot;He Knows a Lot of Good Women,&quot; and he connects with a sly blues shuffle on &quot;He Said She Said,&quot; but it's when Lee and Karp crank up their guitars and the rhythm section of Don Poncher and David Hull turn up the heat that Vindicator really takes off, inviting the spirit with the kiss-the-sky spirit of &quot;You Want Change for Our Re-Run&quot; and laying out some thick Marshall-stack crunch on &quot;Every Time I Look Up I'm Down.&quot; And anyone wanting a dose of Lee's well-documented eccentricity won't be at all disappointed with the brief spoken word fragment &quot;You Can Save Up to 50% But You're Still a Long Ways from Home&quot; and the anti-fast food tirade &quot;Hamburger Breath Stinkfinger,&quot; both of which confirm Lee didn't turn away his muse when he cut these sessions. While Arthur Lee could create music of simple and fragile beauty, that doesn't change the fact he was a rocker at heart, and he rarely rocked harder or with more passion than he did on Vindicator. \n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:d0270970bdcc6cf055d87609fbc3070ff08a585e","amp;dn":"Arthur+Lee+-+Vindicator+%5B1972%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0270970bdcc6cf055d87609fbc3070ff08a585e","infoHashBuffer":{"type":"Buffer","data":[208,39,9,112,189,204,108,240,85,216,118,9,251,195,7,15,240,138,88,94]},"announce":[],"urlList":[]}}