{"title":"Cheryl Cole-Under the sun (2012) video 720p HD","uid":7747637,"size":11117220,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d0309ee3ca7a80707bcd25dcd0523462620855a1&amp;dn=Cheryl+Cole-Under+the+sun+%282012%29+video+720p+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1350813114,"description":"&quot;Under the Sun&quot; is a song recorded by English recording artist Cheryl Cole, from her third studio album A Million Lights (2012). The song was released as the second single from &quot;A Million Lights&quot; on September 2, 2012 through Polydor Records. It was written and produced by Alex da Kid, with additional writing from Mike Del Rio, Jayson DeZuzio, Steven Battey, Carlos Battey and Cole.\nLyrically, it speaks of a male telling a girl anything she wants to hear to get his way. &quot;Under the Sun&quot; is a mid-tempo song, piano riffs, sun-kissed breakbeats and a pop chorus. The song received a positive reaction from most music critics, with most of them, calling it a summery, carefree and enjoyable song. Some critics cited the Chemical Brothers, Natasha Bedingfield and Lily Allen as references.\nThe accompanying music video sees Cole travel back to the '50s to perform the track while strutting down the street. Further scenes see the singer draped on the bonnet of a classic car and performing a choreographed dance sequence with a handful of businessmen. &quot;Under the Sun&quot; was promoted with live performances in the United Kingdom, including a T4 special and The Jonathan Ross Show.\n\n\n\nHELLO FRIENDS THIS IS MY FIRST UPLOAD SO PLEASE SHOW SOME RESPECT TO ME..!!!!!!","torrent":{"xt":"urn:btih:d0309ee3ca7a80707bcd25dcd0523462620855a1","amp;dn":"Cheryl+Cole-Under+the+sun+%282012%29+video+720p+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0309ee3ca7a80707bcd25dcd0523462620855a1","infoHashBuffer":{"type":"Buffer","data":[208,48,158,227,202,122,128,112,123,205,37,220,208,82,52,98,98,8,85,161]},"announce":[],"urlList":[]}}