{"title":"Xbox - RLT - Def Jam Fight For New York","uid":3371058,"size":2358927695,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:d100cc4190da9503d3fd3c5909fc57fa3a214015&amp;dn=Xbox+-+RLT+-+Def+Jam+Fight+For+New+York&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shady78","files":1,"time":1124289967,"description":"NTSC\nENGLISH\n\n\nLINK:\nhttp://www.xbox.com/en-us/defjamfightforny/default.htm?level1=enusgames&amp;level2=catalog&amp;level3=defjamfightforny\n\n\nAre you ready to fight for control of hip hop?s underworld?\n \nCompete to survive in the gritty reality of the urban underworld in Def Jam&amp;reg; FIGHT For NY?, the only fighting game featuring five intense fighting styles, hardcore hip-hop music, more than 40 hip-hop artists and celebrities, and seedy urban venues. Develop your fighting skills, get down with your crew, and battle for control of the streets.\n\n\nFeatures  \n \n \n\nNew fighting engine: Challenges you to master multiple fighting disciplines, take advantage of interactive environments, and use dozens of weapons to make a name for yourself. \n\nThree times longer than the original Def Jam&amp;reg; Vendetta: It?s going to take more than 90 fights in 20 venues to win control of the ?hood. \n\nMore than 40 hip-hop superstars: Appearances by Busta Rymes, Carmen Electra, Fat Joe, Flava Flav, Freeway, Ghostface, Ice-T, Joe Budden, Kimora Lee Simmons, Lil? Kim, Ludacris, Method Man, Redman, Sean Paul, Slick Rick, Snoop Dogg, Xzibit, and many more. \n\nHit hard with a mix of fighting styles: Master each fighting style: street fighting, kickboxing, martial arts, wrestling, and submission. Combine up to three styles to create devastating hybrids, complete with new ?blazin? moves? for finishing off your opponents. \n\nTwenty interactive venues: Everything from destructible objects to rowdy spectators who hand you bats, bottles, pipes, and more. \n\nCreate your own street fighter: Build your own street-ready fighter and outfit him with thousands of pieces of unlockable licensed gear, tattoos, and even bling from the famous Jacob the Jeweler.\n \n \n \n Game Information  \n \n \nPublisher\nElectronic Arts \n\nDeveloper\nElectronic Arts Canada and AKI Corporation \n\nStreet Date\nSeptember 20, 2004 \n\nPrice\n$49.99 \n\n \nRating\nMature\n\n \n\n \n Players 1-4 \n In-game Dolby&amp;reg; Digital","torrent":{"xt":"urn:btih:d100cc4190da9503d3fd3c5909fc57fa3a214015","amp;dn":"Xbox+-+RLT+-+Def+Jam+Fight+For+New+York","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d100cc4190da9503d3fd3c5909fc57fa3a214015","infoHashBuffer":{"type":"Buffer","data":[209,0,204,65,144,218,149,3,211,253,60,89,9,252,87,250,58,33,64,21]},"announce":[],"urlList":[]}}