{"title":"Mary Shelley - Frankenstein or The Modern Prometheus (3 editions","uid":10220601,"size":23202117,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d13700a5894fd4e431584f37c0f095a4e8ace03d&amp;dn=Mary+Shelley+-+Frankenstein+or+The+Modern+Prometheus+%283+editions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1401038718,"description":"\nFRANKENSTEIN; OR, THE MODERN PROMETHEUS is a novel written by British author MARY SHELLEY (1797-1851) about eccentric scientist Victor Frankenstein, who creates a grotesque creature in an unorthodox scientific experiment.  It is infused with elements of the Gothic novel and the Romantic movement and is also considered to be one of the earliest examples of science fiction.  Frankenstein is now more widely read and more widely discussed by scholars than any other work of the Romantic period.\n\nThe novel's origins are well known: In the summer of 1816, Mary Wollstonecraft Godwin, then eighteen years old, began to write the novel after she and her lover, Percy Bysshe Shelley, took part in a ghost-story competition at Lord Byron's villa by Lake Geneva.  Over the next nine months -- a period which saw their return to England and subsequent marriage -- she (with Percy) drafted the entire novel.  The first edition was published anonymously in London in 1818; Shelley's name appears on the second edition, published in France in 1823.\n\nKaren Karbiener's edition of the novel follows Mary Shelley's revised text of 1831.  In contrast, Macdonald and Scherf's edition use the original 1818 version as their copy-text, and detail in an appendix all of Shelley's later revisions.  It also includes a range of contemporary documents that shed light on the historical context from which this unique masterpiece emerged.  In the second edition, the editors have revised and updated their introduction, notes and bibliography, and have added new documents (including a review of Frankenstein by Percy Shelley).\n\nCharles E. Robinson, working from the earliest surviving draft manuscript in the Bodleian Library, presents two versions of the novel -- as Mary Shelley originally wrote it and a subsequent version clearly indicating Percy Shelley's amendments and contributions.  This approach allows us to hear Mary's sole voice, which sounds to us more modern, more immediately colloquial and direct than her husband's learned, more polished style.  We can also see the extent of Percy Shelley's contribution -- some 5,000 words out of 72,000 -- and his stylistic and thematic changes.  Interesting, too, are Percy's suggestions, which humanize the monster, thus shaping many of the major themes of the novel as we read it today.\n\nThe latter two editions in particular add immeasurably to our appreciation of this classic Romantic novel, which everyone should read at least once.\n\n\n* FRANKENSTEIN (Barnes &amp; Noble, 2003).  With an Introduction and Notes by Karen Karbiener. -- ePUB + MOBI\n\n* FRANKENSTEIN; OR, THE MODERN PROMETHEUS: The 1818 Version (Broadview Press, 1999).  Second edition.  Edited by D. L. Macdonald and Kathleen Scherf. -- PDF\n\n* THE ORIGINAL FRANKENSTEIN: OR, THE MODERN PROMETHEUS: The Original Two-Volume Novel of 1816-1817 from the Bodleian Library Manuscripts (Vintage Classics, 2008).  Edited by Charles E. Robinson. -- ePUB + MOBI\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                         &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:d13700a5894fd4e431584f37c0f095a4e8ace03d","amp;dn":"Mary+Shelley+-+Frankenstein+or+The+Modern+Prometheus+%283+editions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d13700a5894fd4e431584f37c0f095a4e8ace03d","infoHashBuffer":{"type":"Buffer","data":[209,55,0,165,137,79,212,228,49,88,79,55,192,240,149,164,232,172,224,61]},"announce":[],"urlList":[]}}