{"title":"The Beatles - Something [original promo].VOB","uid":9423921,"size":178997248,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d15855f273de80d4c8d0c82514a306d1c7be747a&amp;dn=The+Beatles+-+Something+%5Boriginal+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1388647607,"description":"The Beatles - Something [original promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Something&quot; is a song by the Beatles, featured on their 1969 album Abbey Road. It was released that same year as a double A-sided single with another track from the album, &quot;Come Together&quot;. &quot;Something&quot; was the first Beatles song written by lead guitarist George Harrison to appear as an A-side, and the only song written by him to top the US charts while he was in the band. The single was also one of the first Beatles singles to contain tracks already available on an LP album.\n\nJohn Lennon and Paul McCartney, the band's principal songwriters, both praised &quot;Something&quot; as one of the best songs Harrison had written, or that the group had to offer. As well as critical acclaim, the single achieved commercial success, topping the Billboard charts in the United States and making the top five in the United Kingdom. The song has been covered by over 150 artists, making it the second-most covered Beatles song after &quot;Yesterday&quot;. Artists who have covered the song include Elvis Presley, Frank Sinatra, Ray Charles, James Brown, Shirley Bassey, Tony Bennett, Andy Williams, Ike &amp; Tina Turner, The Miracles, Eric Clapton, Joe Cocker, Isaac Hayes, Julio Iglesias, Mina, and Phish. Harrison is quoted as saying that his favourite version of the song was James Brown's, which he kept in his personal jukebox.\n\nPromotional video:\n\nThe promotional video for &quot;Something&quot; was shot shortly before the break-up of the band. By this time, the individual Beatles had drawn apart and so the film consisted of separate clips of each Beatle walking around his home, accompanied by his wife, edited together. The film was directed by Neil Aspinall.\n\nReception:\n\nThe Abbey Road album was the first Beatles release to feature &quot;Something&quot;; it was released on 26 September 1969 in the United Kingdom, with the United States' release following on 1 October, and performed well, topping the charts in both countries.\n\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Something&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Something&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/gAFKMaAfl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/gAFKMaAfl&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7500kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:01\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.1\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:d15855f273de80d4c8d0c82514a306d1c7be747a","amp;dn":"The+Beatles+-+Something+%5Boriginal+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d15855f273de80d4c8d0c82514a306d1c7be747a","infoHashBuffer":{"type":"Buffer","data":[209,88,85,242,115,222,128,212,200,208,200,37,20,163,6,209,199,190,116,122]},"announce":[],"urlList":[]}}