{"title":"52 VOL.1","uid":6957109,"size":103852934,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d1a53af0161366fc88ef5a252864d0b87dd00c2a&amp;dn=52+VOL.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mirrormaster82","files":-1,"time":1326585758,"description":"52 was a weekly American comic book limited series published by DC Comics that debuted on May 10, 2006, one week after the conclusion of the seven-issue Infinite Crisis. The series was written by Geoff Johns, Grant Morrison, Greg Rucka, and Mark Waid with layouts by Keith Giffen. 52 also led into a few limited series spin-offs.\n\n52 consists of 52 issues, published weekly for one year, each issue detailing an actual week chronicling the events that took place during the missing year after the end of Infinite Crisis. The series covers much of the DC Universe, and several characters, whose disparate stories interconnect. The story is directly followed by the limited series Countdown to Final Crisis.\n\nThe story was originally conceived of as being a chronicle of what happened in the &quot;missing year&quot; between the end of Infinite Crisis and the beginning of One Year Later. It would especially focus on how the world dealt with the disappearance of the &quot;big three&quot; heroes in the DCU, Superman, Batman, and Wonder Woman. As the series went on it became more of a way to set the stage for upcoming storylines in the DC Universe.Series that among many other things introduced Batwoman to DC universe.\n\nTHE YEAR WITHOUT SUPERMAN,BATMAN AND WONDER WOMAN.BUT NOT THE YEAR WITHOUT HEROES...\n\nWHEN THIS IS SEEDED I'LL UPLOAD THE REST OF THE VOLUMES\n\nCOMMENTS ARE WELCOME,CLICK +1 IF YOU LIKE IT\n\nENJOY AND SEED... ","torrent":{"xt":"urn:btih:d1a53af0161366fc88ef5a252864d0b87dd00c2a","amp;dn":"52+VOL.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1a53af0161366fc88ef5a252864d0b87dd00c2a","infoHashBuffer":{"type":"Buffer","data":[209,165,58,240,22,19,102,252,136,239,90,37,40,100,208,184,125,208,12,42]},"announce":[],"urlList":[]}}