{"title":"Five Equations that Changed the World by Michael Guillen","uid":12162101,"size":502059,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d277984514d76deb7258ef441a43e3d66a9d1272&amp;dn=Five+Equations+that+Changed+the+World+by+Michael+Guillen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cquark","files":1,"time":1437936007,"description":"Five Equations that Changed the World: The Power and Poetry of Mathematics\n\n\nThis Book is kinda old, but it's more precious than gold!\n\nBook Description :\nA Publishers Weekly best book of 1995!\nDr. Michael Guillen, known to millions as the science editor of ABC's Good Morning America, tells the fascinating stories behind five mathematical equations.\nAs a regular contributor to daytime's most popular morning news show and an instructor at Harvard University, Dr. Michael Guillen has earned the respect of millions as a clear and entertaining guide to the exhilarating world of science and mathematics.\nNow Dr. Guillen unravels the equations that have led to the inventions and events that characterize the modern world, one of which -- Albert Einstein's famous energy equation, E=m.(c^2) -- enabled the creation of the nuclear bomb. Also revealed are the mathematical foundations for the moon landing, airplane travel, the electric generator -- and even life itself.\nPraised by Publishers Weekly as &quot;a wholly accessible, beautifully written exploration of the potent mathematical imagination,&quot; and named a Best Nonfiction Book of 1995, the stories behind The Five Equations That Changed the World, as told by Dr. Guillen, are not only chronicles of science, but also gripping dramas of jealousy, fame, war, and discovery","torrent":{"xt":"urn:btih:d277984514d76deb7258ef441a43e3d66a9d1272","amp;dn":"Five+Equations+that+Changed+the+World+by+Michael+Guillen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d277984514d76deb7258ef441a43e3d66a9d1272","infoHashBuffer":{"type":"Buffer","data":[210,119,152,69,20,215,109,235,114,88,239,68,26,67,227,214,106,157,18,114]},"announce":[],"urlList":[]}}