{"title":"The Triumph of Liberty","uid":7857462,"size":771127111,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d2fdae675dc5d36367028eaf595b74a5b1ab1c5e&amp;dn=The+Triumph+of+Liberty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1353809657,"description":"The Triumph of Liberty is a dramatic and original narrative about a quest stretching from ancient times to the present day. It is the story of people struggling to abolish slavery, stop wars, overthrow tyrants and win freedom for all. Through the lives of 65 heroes and heroines, Jim Powell offers a panoramic sweep through epochal events, including the crisis of the Roman Republic, the Reformation, the English Civil Wars, the American Revolution, the abolitionist movement, and the struggle for women's right.These are the stories of men and women who have overcome great obstacles. Fifteen of the people profiled here were exiled; twelve imprisoned; two beheaded; and one shot to death. Many came from humble beginnings, yet they gave us a great deal, from natural rights and religious toleration to individualism and the liberation of women.\n\nBased on biographies, diaries, and interviews with leading scholars, The Triumph of Liberty uses beautifully written biographies as the building blocks of a grand narrative. Inspiring and instructive, it belongs in every family library","torrent":{"xt":"urn:btih:d2fdae675dc5d36367028eaf595b74a5b1ab1c5e","amp;dn":"The+Triumph+of+Liberty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2fdae675dc5d36367028eaf595b74a5b1ab1c5e","infoHashBuffer":{"type":"Buffer","data":[210,253,174,103,93,197,211,99,103,2,142,175,89,91,116,165,177,171,28,94]},"announce":[],"urlList":[]}}