{"title":"Alex Jones Show - 2013 Apr 15 MO [sebaygo1] - 1st 4 Hrs","uid":8377402,"size":86335216,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d35a8ad4ca62bcb433811cf61954702a0ba38e24&amp;dn=Alex+Jones+Show+-+2013+Apr+15+MO+%5Bsebaygo1%5D+-+1st+4+Hrs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":12,"time":1366087876,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nMonday, 15 Apr 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Monday, April 15 transmission of The Alex Jones Show, Alex takes on the lie that &quot;sensible gun laws,&quot; in the form of background checks, will not lead to a gun registry and confiscation, which is already underway in states like New York and California. \n\nAlex also examines leaked photos of former Secretary of State Colin Powell attending the private and secretive San Francisco-based retreat known as Bohemian Grove. \n\nWe'll also cover the Venezuelan elections, the price of gold being artificially manipulated, and new grisly images of US-backed Free Syrian Army Rebels up to no good. \n\nOn today's show, Alex welcomes comedian, actor and author of Dead Wrong Richard Belzer to talk about his new book Hit List, an in-depth investigation into the mysterious deaths of witnesses to the JFK Assassination.\n\nNOTE :: Approximately eight minutes into a 4th hour overdrive, news broke of the Boston Marathon bombing. Originally intending to end the broadcast at 3:20 p.m. CDT, Alex completed a full fourth hour and then announced his intention to stay live for at least two more hours to cover this story and its implications. I will be uploaded those hours of extended broadcast separately.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:d35a8ad4ca62bcb433811cf61954702a0ba38e24","amp;dn":"Alex+Jones+Show+-+2013+Apr+15+MO+%5Bsebaygo1%5D+-+1st+4+Hrs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d35a8ad4ca62bcb433811cf61954702a0ba38e24","infoHashBuffer":{"type":"Buffer","data":[211,90,138,212,202,98,188,180,51,129,28,246,25,84,112,42,11,163,142,36]},"announce":[],"urlList":[]}}