{"title":"Billy Graham: Technology, faith and human shortcomings","uid":4682297,"size":90026509,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d3652b23673ca5568e0575dfa13c51507f531a85&amp;dn=Billy+Graham%3A+Technology%2C+faith+and+human+shortcomings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"the_Phyrexian","files":-1,"time":1233115649,"description":"Speaking at TED in 1998, Rev. Billy Graham marvels at technology's power to improve lives and change the world -- but says the end of evil, suffering and death will come only after the world accepts Christ. A legendary talk from TED's archives.\n\nAccording to his official bio, evangelist Billy Graham took the Bible literally where it says in Mark 16:15, &quot;Go ye into all the world and preach the Gospel to every creature.&quot; Graham has preached the Gospel to more people in live audiences than anyone else in history -- nearly 215 million people in more than 185 countries and territories. Hundreds of millions more have been reached through television, video, film and webcasts.\n\nGraham has written some 25 books, and his counsel has been sought by multiple U.S. presidents. His appeal in both the secular and religious arenas is evidenced by the wide range of groups that have honored him. Graham was the first major evangelist to speak behind the Iron Curtain, calling for peace in countries throughout Eastern Europe and in the Soviet Union -- while during the Apartheid era he refused to visit South Africa until its government allowed for desegregated audiences. Through the praise and criticism of a public life that has nearly spanned a century, he has held fast to his conviction that faith in Jesus is the only path to salvation.\n\n    &quot;My one purpose in life is to help people find a personal relationship with God, which, I believe, comes through knowing Christ.&quot;\n\nBilly Graham\n\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:d3652b23673ca5568e0575dfa13c51507f531a85","amp;dn":"Billy+Graham%3A+Technology%2C+faith+and+human+shortcomings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3652b23673ca5568e0575dfa13c51507f531a85","infoHashBuffer":{"type":"Buffer","data":[211,101,43,35,103,60,165,86,142,5,117,223,161,60,81,80,127,83,26,133]},"announce":[],"urlList":[]}}