{"title":"Betty Goes Vegan-5cipes for the Modern Family.epub","uid":11516217,"size":12904900,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3c7d65404bcea6cfb6a501c3e62f2100fb45e4b&amp;dn=Betty+Goes+Vegan-5cipes+for+the+Modern+Family.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eternalpb","files":-1,"time":1416449192,"description":"2013 | \nEPUB | \n480 pages | \n12.31 Mb\n\nBETTY GOES VEGAN is a comprehensive guide to creating delicious meals for today's vegan family. This must-have cookbook features recipes inspired by The Betty Crocker Cookbook, as well as hundreds of original, never-before-seen recipes sure to please even meat-eaters. It also offers insight into why Betty Crocker has been an icon in American cooking for so long-and why she still represents a certain style of the modern super-woman nearly 100 years after we first met her. With new classics for breakfast, lunch, dinner, and dessert, including omelets, stews, casseroles, and brownies, BETTY GOES VEGAN is the essential handbook every vegan family needs.\n\nDan and Annie Shannon live in Brooklyn, NY. Annie has worked at the animal advocacy organization In Defense of Animals and as the Fashion Industry Liaison for the Humane Society of the United States. She does most of the cooking. \n\nDan was previously the Director of Youth Outreach &amp; Campaigns for PETA and is now a Senior Strategist for the social movement strategy consulting company Purpose. He does the dishes","torrent":{"xt":"urn:btih:d3c7d65404bcea6cfb6a501c3e62f2100fb45e4b","amp;dn":"Betty+Goes+Vegan-5cipes+for+the+Modern+Family.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3c7d65404bcea6cfb6a501c3e62f2100fb45e4b","infoHashBuffer":{"type":"Buffer","data":[211,199,214,84,4,188,234,108,251,106,80,28,62,98,242,16,15,180,94,75]},"announce":[],"urlList":[]}}