{"title":"Jungle Book: Last of the Species 3-5(2013)(140+2048px)(TaruTaria","uid":9106742,"size":260466901,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d40fe4174f53ceb444dd9039e667f864cd1dc0da&amp;dn=Jungle+Book%3A+Last+of+the+Species+3-5%282013%29%28140%2B2048px%29%28TaruTaria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1382896624,"description":"This torrent includes both 1440px and 2048px-HD versions\n*Note: You can download both or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software.  If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n========================================================\n\nEnglish | CBR | 3 Issues\n\nGrimm Fairy Tales presents The Jungle Book: Last of the Species #3-5\nPublisher:  Zenescope\nPublication Date:  April 24, 2013 - July 10, 2013\n\nThe Jungle Book: Last of the Species #3 (of 5)\nThe jungle adventure continues as Mowglii and Tobaqui find out that they are not alone in the caves under Kipling Island while Baloo and his group continue to search the jungle high and low for their missing friends. Meanwhile, the conflict between Dewan and Bomani escalates to a deadlier new level.\n\nThe Jungle Book: Last of the Species #4 (of 5)\nThe jungle action/adventure series that has critics and fans alike raving about continues! As Bomani and Dewan form an uneasy alliance to search for Kaa the Python, the Tigers of the Shere and the Payari Elephants move closer to their final confrontation. But deep in the caverns under the Isle of Kipling, Mowglii uncovers secrets and monsters that will turn the tide of the upcoming war and change the jungle itself forever more.\n\nThe Jungle Book: Last of the Species #5 (of 5)\nThis is it! The all out battle between the Payari elephant, Shere tiger and Bada Dar bear tribes with Mowglii caught right in the middle. Oh my! plus Bomani faces off alone against Kaa the Python! Not everyone will walk away from this battle in one piece as all warring parties collide on one battlefield in the conclusion to the critically acclaimed jungle action series from writer Mark L. Miller!\n\nThanks goes to Tarutaru, theProletariat, and SEGoat for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8956400&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8956400&lt;/a&gt;","torrent":{"xt":"urn:btih:d40fe4174f53ceb444dd9039e667f864cd1dc0da","amp;dn":"Jungle+Book%3A+Last+of+the+Species+3-5%282013%29%28140%2B2048px%29%28TaruTaria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d40fe4174f53ceb444dd9039e667f864cd1dc0da","infoHashBuffer":{"type":"Buffer","data":[212,15,228,23,79,83,206,180,68,221,144,57,230,103,248,100,205,29,192,218]},"announce":[],"urlList":[]}}