{"title":"Marvel - The Lost Generation","uid":5482293,"size":234447494,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d416e2e02b37e3417fd2a8444a29cd2c6efb587b&amp;dn=Marvel+-+The+Lost+Generation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1270503812,"description":"Marvel: The Lost Generation is a twelve-issue comic book limited series published by Marvel Comics in 2000 and 2001. The series was written by Roger Stern and drawn by John Byrne. \nThe series employed the unusual stylistic device of having the issues numbered in reverse (from #12 down to #1) and occurring in reverse chronological order. Thus the first issue to be published (#12) depicted the final mission of its superhero  team, and each issue thereafter showed progressively earlier events until the final issue (#1), which depicted the team's origin.\n\nMarvel: The Lost Generation tells the story of the First Line, a group of superheroes active after World War II but before the debut of the Fantastic Four, which is considered to be the start of the &quot;modern age&quot; of heroes within the Marvel universe. Although the Fantastic Four first appeared in comics in 1961, Marvel Comics utilizes a sliding timescale. The Lost Generation explored events in the gap between the retirement/disappearance of superheroes active during World War II and the emergence of the modern generation of heroes.\n\nThe First Line was a loose confederation of superheroes, which lasted from the years shortly after World War II up to the early 1980s. Members of the First Line included The Yankee Clipper (time traveller), Oxbow (super-strong archer), Pixie and Major Mercury (both Eternals), Captain Hip and Sunshine (hippie heroes mutated by a government experiment), Kid Justice (former sidekick of Yankee Clipper who later became Mr. Justice), and the Black Fox (non-superpowered vigilante), as well as other, less prominent heroes during their &quot;decades-long&quot; adventures. Members of the First Line encountered a number of established Marvel characters, including the Skrulls, Doctor Strange, Diablo, Namor, Thor, Havok, Polaris, the Monster Hunters of Ulysses Bloodstone, and Nick Fury.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:d416e2e02b37e3417fd2a8444a29cd2c6efb587b","amp;dn":"Marvel+-+The+Lost+Generation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d416e2e02b37e3417fd2a8444a29cd2c6efb587b","infoHashBuffer":{"type":"Buffer","data":[212,22,226,224,43,55,227,65,127,210,168,68,74,41,205,44,110,251,88,123]},"announce":[],"urlList":[]}}