{"title":"For You They Signed - Marilyn Boyer","uid":10339126,"size":14400130,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5ba5759f35fdfb1a03c3501575e9d38ce69a1ac&amp;dn=For+You+They+Signed+-+Marilyn+Boyer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1402519746,"description":"In 1776, 56 men signed their names on a document that they knew might well mean their certain deaths as traitors to England. Standing on principles of faith and liberty, these men forged a powerful call for freedom and human dignity still resonating today in America. Yet, historical revisionists have distorted or attempted to wipe away every trace of this nation's Christian heritage, including the heartfelt faith of these founding fathers.\n\nMore than simply facts and figures, For You They Signed provides an abundance of resources within one volume, including:\n\n-A full year of life-changing, challenging family or group devotional character studies\n-Over 90 illustrations, biographical summaries, and insightful quotes\n-Character quality definitions, Patrick Henry's speech delivered to the signers, the Christian nature of state constitutions, and the Christian nature of America's universities.\n\nThe Declaration of Independence remains one of history's most enduring achievements, and this text will help you value those freedoms these men fought for in an insightfully fresh way. It will also assist you in catching the God-given vision of these faithful new Americans, igniting a fire for your family, community, and the generations to come. Here is a volume that should be found in every private and public library in America... a meticulously documented look back to the true birth of our nation.\n\nThey pledged their lives, their fortunes, and their sacred honor so that we could be free!\n\n\nAbout the author:\nMarilyn Boyer is patriotic and passionate about America's Christian history. She and her husband, Rick, were among the pioneers of the home education movement in the early 1980s, having written over a dozen books, and founding the Learning Parent Ministry. She is the mother and home educator of fourteen sons and daughters, and grandmother of six. ","torrent":{"xt":"urn:btih:d5ba5759f35fdfb1a03c3501575e9d38ce69a1ac","amp;dn":"For+You+They+Signed+-+Marilyn+Boyer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5ba5759f35fdfb1a03c3501575e9d38ce69a1ac","infoHashBuffer":{"type":"Buffer","data":[213,186,87,89,243,95,223,177,160,60,53,1,87,94,157,56,206,105,161,172]},"announce":[],"urlList":[]}}