{"title":"The French Revolution A Very Short Into - William Doyle [Non-Fic","uid":8856123,"size":3696502,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5f5bba040fc8a5cddf67cb3a3a03dd2261358f4&amp;dn=The+French+Revolution+A+Very+Short+Into+-+William+Doyle+%5BNon-Fic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":5,"time":1377651574,"description":"Beginning with a discussion of familiar images of the French Revolution, garnered from Dickens, Baroness Orczy, and Tolstoy, as well as the legends of let them eat cake, and tricolours, Doyle leads the reader to the realization that we are still living with developments and consequences of the French Revolution such as decimalization, and the whole ideology of human rights. Continuing with a brief survey of the old regime and how it collapsed, Doyle continues to elucidate how the revolution happened: why did the revolutionaries quarrel with the king, the church and the rest of Europe, why this produced Terror, and finally how it accomplished rule by a general. The revolution destroyed the age-old cultural, institutional and social structures in France and beyond. This book looks at how the ancient regime became ancient as well as examining cases in which achievement failed to match ambition. Doyle explores the legacy of the revolution in the form of rationality in public affairs and responsible government, and finishes his examination of the revolution with a discussion of why it has been so controversial.\nAbout the Series: Combining authority with wit, accessibility, and style, Very Short Introductions offer an introduction to some of life's most interesting topics. Written by experts for the newcomer, they demonstrate the finest contemporary thinking about the central problems and issues in hundreds of key topics, from philosophy to Freud, quantum theory to Islam. ","torrent":{"xt":"urn:btih:d5f5bba040fc8a5cddf67cb3a3a03dd2261358f4","amp;dn":"The+French+Revolution+A+Very+Short+Into+-+William+Doyle+%5BNon-Fic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5f5bba040fc8a5cddf67cb3a3a03dd2261358f4","infoHashBuffer":{"type":"Buffer","data":[213,245,187,160,64,252,138,92,221,246,124,179,163,160,61,210,38,19,88,244]},"announce":[],"urlList":[]}}