{"title":"Ziggurat v1.0u1","uid":11348788,"size":374389054,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d62c8d33176570d666a130462188168b463f32c5&amp;dn=Ziggurat+v1.0u1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1414883126,"description":"&quot;Ziggurat is a dungeon crawling FPS, with procedurally generated scenarios and encounters. You'll face dozens of dangerous enemies while you find new and powerful spells, and learn helpful perks in your quest to overcome this deadly test.\nBecome a neophyte sorcerer, and get ready for your rite of passage: Enter the labyrinth and face dangerous challenges to prove your worth and become a powerful wizard.\nThe game focuses on fast-paced first person shooting, with an old-school vibe, and updated handling and game mechanics. Dungeon crawling and RPG/Roguelike elements are added into the mix, resulting in a fun, challenging and varied game, with lots of content to discover.\nFight almighty bosses, get through rooms filled with traps, and treasures that may help you in your journey... Each game is a whole new experience.\nUnlike most rogue-thingies, on Ziggurat your combat skills will be the most important asset to keep advancing. Leveling up and randomly generated content is there to improve variety and make each game different, not to make the game a roll dice or an unbearable grind.\nMost perks are designed to change the way you have to play or the weapons you'll want to use. Do you want more speed in exchange for less health, or maybe is better to have mana regeneration? Increase drop rate, or refill ammo here and now? No number game here, simple and direct choices.\nWe've also ensured that, as a proper FPS game, the experience is quick and direct. There's no inventory to manage or the need to compare two almost equal item drops, just weapon selection, and mana/health are usually the bargaining chip.\nA whole arsenal of magic and alchemic weapons will be at your disposal. Wreak havoc among your enemies, but watch your mana reserves or you might regret it later.\nMagic staves, spellbooks, magic wands... dozens of weapons with different attack strategies that help keeping the game fresh.&quot;\n\nAll previous versions were Early Access updates. The game has been released on 23.10.2014. This is v1.0u1 (Update 1, post-release), not to confuse with Early Access updates.\n\nChangelog:\nRelease v1.0u1 (29.10.2014):\n- New enemy: Ulmar fish\n- Fixed perks not appearing in the upgrade screen when reaching a certain level\n- Now you can map mouse buttons over third.\n- Now you can map mouse buttons to movement\n- Changed the way input mapping is done, now you don't need to map all 4 directions for movement.\n- Shrines show the amount of health/mana you need to pay\n- Changed and improved room culling performance, the game should be a bit smoother (we're still looking into the stuttering issue some users are having)\n- HUD should be shown on the center screen on 3 monitor setups.\nEarly Access Update 17 hotfix (23.10.2014):\n- Added option to disable Sprint FOV Change\n- Fixed some issues with grenades\n- More english improvements\n- Fixed glitch with an achievement\n\nIf you like the game, support the developer, buy it!             &lt;a href=&quot;\nhttp://store.steampowered.com/app/308420/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/308420/&lt;/a&gt;","torrent":{"xt":"urn:btih:d62c8d33176570d666a130462188168b463f32c5","amp;dn":"Ziggurat+v1.0u1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d62c8d33176570d666a130462188168b463f32c5","infoHashBuffer":{"type":"Buffer","data":[214,44,141,51,23,101,112,214,102,161,48,70,33,136,22,139,70,63,50,197]},"announce":[],"urlList":[]}}