{"title":"15.60.75...Jimmy Bell's still in town(1976)[FLAC]","uid":7294521,"size":278098159,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d63dd87aecf169a77dcb103407462b7306fd4ccd&amp;dn=15.60.75...Jimmy+Bell%27s+still+in+town%281976%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":9,"time":1337844989,"description":"\n01 Animal Speaks\n02 About The Eye Game \n03 Narrow Road \n04 Thief\n05 Jimmy Bell \n06 About Leaving Day\n\nFrom the Rolling Stones to the White Stripes, plenty of rock bands have used the blues as a jumping off point and messed with the form to make something new, but hardly anyone pushed the music into a more interesting and innovative direction while staying true to its roots as 15-60-75, a Kent, OH combo known to locals as &quot;the Numbers Band.&quot; Led by Robert Kidney on lead vocals and guitar and Terry Hynde on saxophone (yes, he's Chrissie's brother), this band never lost touch with the deep hoodoo groove at the heart of the blues, but they pushed and pulled at the sound from all directions, with the rhythm section laying out a steady and propulsive groove, additional percussionists throwing polyrhythms over the bed, the sax players blowing as if possessed by King Curtis and Ornette Coleman at once, the guitarists exploring the cosmos, and Kidney declaiming like the last great undocumented beat poet. Jimmy Bell's Still in Town, the group's first (and arguably best) album, manages to capture the band in all their shapeshifting glory, and what's most remarkable is how incredibly tight and unified this band is -- while this music leaps through any number of hoops, nothing and no one ever gets lost in the shuffle and the musicians perform with an intense focus that's all the more remarkable when you realize this was a live recording, cut in front of an enthusiastic audience at the Agora in Cleveland one evening in 1975. Music this smart and adventurous is rarely as satisfying on a gut level as Jimmy Bell's Still in Town, and this is a razor-sharp fusion of jazz, blues, and rock that kicks like a mule and will let you shake your ass all night long. David Thomas of Pere Ubu, a major fan of the Numbers Band, once called Jimmy Bell's Still in Town &quot;the only good album ever recorded by anyone,&quot; and while he's clearly exaggerating to make a point, there's no doubt it's a better record than whatever you're listening to right now.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:d63dd87aecf169a77dcb103407462b7306fd4ccd","amp;dn":"15.60.75...Jimmy+Bell%27s+still+in+town%281976%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d63dd87aecf169a77dcb103407462b7306fd4ccd","infoHashBuffer":{"type":"Buffer","data":[214,61,216,122,236,241,105,167,125,203,16,52,7,70,43,115,6,253,76,205]},"announce":[],"urlList":[]}}