{"title":"Power Rangers: RPM (Legacy Collection and Beyond)","uid":11766325,"size":12799346593,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d68aa197dff260d4f02c03378391c2433a4d5e2d&amp;dn=Power+Rangers%3A+RPM+%28Legacy+Collection+and+Beyond%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CeraKesh","files":33,"time":1426864033,"description":"Rangers Forever! Earth's defenders never surrender!\n\nThese are HQ x264 rips from the Power Rangers Legacy Collection DVDs.\n\n[img]http://vignette2.wikia.nocookie.net/powerrangers/images/3/30/PRRPMpromo.jpg/revision/latest?cb=20130622171443[/img]\nPower Rangers RPM[1] was the title for the 2009 season of Power Rangers. It is based on Engine Sentai Go-Onger. It was the last season of Power Rangers to be produced by Disney, as they had intended to cancel the series after Power Rangers Jungle Fury however decided to go ahead on a final season (it is believed this was due to having a contract with Bandai). Despite this, Disney dropped the show from its new 'Disney XD' channel leaving it to be aired on ABC Kids.\n\nEddie Guzelian took over as Executive Producer from Bruce Kalish at the beginning of the season. By his and John Tellegen's admission, Eddie fought a number of people to get his vision through: inspired by films like The Road Warrior. Tellegen said that he enjoyed the &quot;freshness&quot; of Guzelian's new take, which was wildly different to what the show had done before. [2]In contrast, RPM marked the departure of long-term writer Jackie Marchand, who has said she was not involved in the initial writing but &quot;diplomatically&quot; said she thought Guzelian's scripts were very strong.[3] Guzelian was then fired halfway through the show, rumoured to have used up the RPM's entire budget already and been responsible for allowing an unacceptable slowdown of the writing and production process due to perfectionism. He was replaced with the previous producer, Judd Lynn, who brought the series to its conclusion. \n\nAfter the final episode aired, Disney announced that the following season would be a 'reversionised' Mighty Morphin Power Rangers however the long-term status of the franchise appeared to be in limbo until it was reacquired by Saban Brands who immediately announced the production of Power Rangers Samurai.\n\nIn the not-so-distant future, the mysterious and sinister Venjix Computer Network is attempting to conquer and lay ruin to the entire planet. It had succeeded and nearly conquered the entire Earth. Fortunately, mankind has retreated from the threat into environmentally-shielded domed cities to protect against the pollution and machines unleashed by Venjix. In the shining city of Corinth, an elite force of Rangers must learn to drive and operate an arsenal of radically advanced biotech vehicles in order to battle the attacking machine army bent on world domination.\n\nThe events of the show were intended to take place in an alternate universe, which was made canon two years later in &quot;Clash of the Red Rangers&quot;. As such, the Morphing Grid takes on a new name - the Bio Field. The only signs of previous characters are an Operation Overdrive helmet at Alphabet Soup and Jungle Karma Pizza","torrent":{"xt":"urn:btih:d68aa197dff260d4f02c03378391c2433a4d5e2d","amp;dn":"Power+Rangers%3A+RPM+%28Legacy+Collection+and+Beyond%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d68aa197dff260d4f02c03378391c2433a4d5e2d","infoHashBuffer":{"type":"Buffer","data":[214,138,161,151,223,242,96,212,240,44,3,55,131,145,194,67,58,77,94,45]},"announce":[],"urlList":[]}}