{"title":"High Logic FontCreator v5.5 and Crack","uid":4056887,"size":9084788,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d747bd9414bc770ae96a487e3e4c6d69be627d57&amp;dn=High+Logic+FontCreator+v5.5+and+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Orinnnn","files":5,"time":1204409163,"description":"A useful tool to edit existing OpenType and TrueType fonts and create new ones, and one that was quite a quest to find a crack for. Here&amp;#039;s a more complete description from the website (http://www.high-logic.com/fontcreator.html):\n\n\nIt has the powerful drawing tools that typographers and graphic designers require, and an intuitive interface that allows beginners to become productive immediately.\nWhen you create or open a font, FontCreator displays an overview of all available characters. You can simply add missing characters, or select an existing character, and modify its appearance. You can import (scanned) images of your signature or company logo, or make a font from your own handwriting. With FontCreator you can also fix character mappings, font names, kerning pairs, and at all times you can preview your fonts before installing.\n\nIn the Professional Edition, font validation features enable you to improve the quality of your fonts. Tools to join contours simplify and speed up the glyph design process. Powerful transformation scripts let you create hundreds of additional characters in seconds. FontCreator&amp;#039;s intelligent generation of composites, allows you to automatically generate outlines for more than 2,200 characters.\n\nWhether you&amp;#039;re a type designer or graphic artist who needs a font creation powerhouse, or a hobbyist who wants to have fun creating new fonts, FontCreator has the tools you need.","torrent":{"xt":"urn:btih:d747bd9414bc770ae96a487e3e4c6d69be627d57","amp;dn":"High+Logic+FontCreator+v5.5+and+Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d747bd9414bc770ae96a487e3e4c6d69be627d57","infoHashBuffer":{"type":"Buffer","data":[215,71,189,148,20,188,119,10,233,106,72,126,62,76,109,105,190,98,125,87]},"announce":[],"urlList":[]}}