{"title":"[SoM]Uccidete la colomba bianca[DvDRip-DivX5-Ita-Mp3]","uid":4392756,"size":726091560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d768092dbe7eff448173a1a259f970363ba4dc84&amp;dn=%5BSoM%5DUccidete+la+colomba+bianca%5BDvDRip-DivX5-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1221271603,"description":"Mentre nei dintorni di Berlino si svolge un incontro diplomatico russo-americanoad alto livello - preparatorio di un vertice indetto a Chicago fra il Presidente degli Stati Uniti ed il Segretario generale del Partito Comunista Sovietico - in un attentato terroristico muoiono due ufficiali americani. Il sergente Johnny Gallagher, che comandava una pattuglia di sorveglianza, tacciato di negligenza, viene rispedito in Patria per scortare Walter Henke, un militare deferito alla Corte marziale. A Chicago, perÃƒÂ², il sergente viene duramente pestato nella toilette dell&amp;#039;aeroporto ed un gruppetto di uomini fa sparire il suo sorvegliato. La ex-moglie di Gallagher (Eileen, che ÃƒÂ¨ un ufficiale di Stato Maggiore) aiuta lo sfortunato sergente, il quale ha avvertito negli avvenimenti qualcosa che non quadra affatto e la conferma di tale sensazione la danno alcuni dettagli acquisiti a mezzo computer. Gallagher, che ÃƒÂ¨ stato messo agli arresti nel proprio domicilio, riesce a dileguarsi poichÃƒÂ¨ vuole scoprire la veritÃƒÂ . Ma lui e la moglie sono tallonati, spiati e perseguitati da misteriosi ndividui, sempre onnipresenti anche sotto uniformi piÃƒÂ¹ che attendibili, i quali non esitano ad uccidere, facendone incolpare il sergente ormai in fuga. La coppia scopre, con l&amp;#039;aiuto di un amico poliziotto, Milan Delich, che il militare riportato in Patria non era affatto Walter Henke. A monte di tutto c&amp;#039;ÃƒÂ¨ un complotto fra alte sfere militari americane e sovietiche per far naufragare il prossimo summit di Chicago, con il quale le forze nucleari dovranno di comune accordo essere messe al bando. A capo di tutto vi ÃƒÂ¨ il coriaceo Colonnello Glen Whitacre, per il quale la presenza e le iniziative dell&amp;#039;intelligente Gallagher costituiscono un grave ostacolo, rischiando di vanificare un piano accuratamente studiato d&amp;#039;intesa con taluni alti ufficiali dello Stato Maggiore Sovietico. Intanto l&amp;#039;autentico Walter ÃƒÂ¨ stato fatto infiltrare nel cuore di un movimento neonazista americano, che ÃƒÂ¨ contro la distensione anch&amp;#039;esso. Il vero Walter, tuttavia, ÃƒÂ¨ solo artatamente destinato a fare il cecchino contro il Segretario generale sovietico e successivamente a fare da capro espiatorio ma in realtÃƒÂ  sarÃƒÂ  prima ucciso da Thomas Boyette, il militare condotto a Chicago da Gallagher sotto mentite spoglie nonchÃƒÂ¨ killer  autentico e prezzolato. I congiurati sperano con ciÃƒÂ² che la colpa della macchinazione ricada non solo su Henke, ormai impossibilitato a parlare, ma sui nazisti che lo hanno affiliato. Boyette, tuttavia, sia pure uccidendo Henke, fallirÃƒÂ : all&amp;#039;ultimo momento, proprio  mentre egli ha giÃƒÂ  nel mirino il premier sovietico, Gallagher riesce ad eliminarlo, vanificando un piano esecrando. Quanto al Colonnello Whithacre e al suo pari grado sovietico, subito dopo il fallimento dell&amp;#039;attentato un sottufficiale-autista spara ad ambedue nell&amp;#039;auto che li porta lontano da Chicago.","torrent":{"xt":"urn:btih:d768092dbe7eff448173a1a259f970363ba4dc84","amp;dn":"%5BSoM%5DUccidete+la+colomba+bianca%5BDvDRip-DivX5-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d768092dbe7eff448173a1a259f970363ba4dc84","infoHashBuffer":{"type":"Buffer","data":[215,104,9,45,190,126,255,68,129,115,161,162,89,249,112,54,59,164,220,132]},"announce":[],"urlList":[]}}