{"title":"Behemoth - Evangelion(2009) {Blasphemy}","uid":5641266,"size":64452060,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d7940658f94dfa12bd85a3e7dd0564b33851f4cb&amp;dn=Behemoth+-+Evangelion%282009%29+%7BBlasphemy%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mork_Blasphemy","files":10,"time":1277118526,"description":"01. Daimonos\n02. Shemhamforash\n03. Ov Fire And The Void\n04. Transmigrating Beyond Realms Ov Amenti\n05. He Who Breeds Pestilence\n06. The Seed Ov I\n07. Alas, Lord Is Upon Me\n08. Defiling Morality Ov Black God\n09. Lucifer\n\nDeath metal\nNuclear Blast\nPoland\nLength: 41:54\n\n\n\n\n\nBehemoth must now be Poland's biggest metal export as the band have rose to fame in the last decade. It was just five years ago when the band released Demigod when the band turned all ears towards them with a death metal album of such ferocity and intensity. Three years later comes The Apostasy, and right now we have the next demonic offering with Evangelion. Since the band grasped and shook the death metal scene with Demigod, not much has changed with the Behemoth's music. Each of these three albums almost a carbon copy of each other. The style and the performance of the music is just as vicious and violent while being executed with insane precision, and even the structure of the songs on the albums seems to be very similar as they always seem to build up to a final explosive surge, this time &quot;Defiling Morality Ov Black God&quot; being that track.\n\nEvangelion is the most polished album Behemoth have put out to date, the production in particular is squeaky clean as you can clearly hear each manic blast and beat from the madman known as Inferno. The whole sound comes across sometimes as perhaps too clean, although a cleaner production is preferred when considering the complex and intricate nature of Behemoth's highly accurate music. It may be easy to become spoilt when it comes to death metal these days, but you must appreciate the skill it takes to put an album of such chaos together like this, let alone actually perform it to this standard.\n\nAs always the songs vary from mid-tempo pulverising pieces to ultra fast pulverising slabs of death metal, always with the balance towards the latter. Evangelion does not let up until the last track &quot;Lucifer&quot; when it comes to giving the listener an ear-full of carnage, by which time you have bared witness to the epic ending of &quot;Alas, The Lord Is Upon Me&quot; which leads to the previously mentioned mental health patient of a track &quot;Defiling Morality Ov Black God&quot;. Behemoth would not be what it is without the assault and battery of the presumably human Inferno.\n\n\nPlease SEED after dowloading!!Enjoy!! \n","torrent":{"xt":"urn:btih:d7940658f94dfa12bd85a3e7dd0564b33851f4cb","amp;dn":"Behemoth+-+Evangelion%282009%29+%7BBlasphemy%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7940658f94dfa12bd85a3e7dd0564b33851f4cb","infoHashBuffer":{"type":"Buffer","data":[215,148,6,88,249,77,250,18,189,133,163,231,221,5,100,179,56,81,244,203]},"announce":[],"urlList":[]}}