{"title":"Mariah Carey MTV Unplugged 320cbr 1992 R&amp;B ","uid":9370163,"size":69988618,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d7f1fb74272b7806c030c76f0a9d250fb89907d0&amp;dn=Mariah+Carey+MTV+Unplugged+320cbr+1992+R%26amp%3BB+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1387508070,"description":"Source: 1992 CD\n-\nMariah Carey MTV Unplugged 320cbr (Big Papi) 1992 R&amp;B \n-\nBy Rudy \nWell, maybe not lo-fi, but this is definitely stripped down to the most basic sound that we have heard Ms. Carey in her career. Not that we can blame her, though; a singer/songwriter she may be, penning all her original tunes, but she is definitely more obvious a pop chanteuse with a sprawling vocal range that has always benefited from the well-produced, glossy sheen of her albums.\n\nHowever, due to the fact that her vocals are just as strong in this live setting and that the arrangments are bare bones, save for the soulful backup singers (who only make her sound better), and allow her all the proper space to be at the forefront, &quot;Unplugged&quot; serves as a fine document of Carey's raw talent. Many uneducated individuals who still dismiss her as all style and no substance still clearly need to give this disc a listen.\n\nShe first kicks off with the title track from her then most recent release, 1991's &quot;Emotions,&quot; which is very similar in arrangement to the C&amp;C Club Mix edit, known better as the &quot;Special Motion Edit&quot; of the song that appears as the final track on the impressive &quot;Make It Happen&quot; CD Remix Maxi Single. She then charges into &quot;If It's Over,&quot; also from &quot;Emotions&quot; which is extremely more impressive live. Her vocals are far more impassioned; and the live setting allows the song a lot more room to breathe.\n\n&quot;Someday&quot; comes next, which takes itself a lot less seriously than the #1 hit studio version from her eponymous 1990 debut LP. Still, Carey sounds wonderful, and the backup singers only add to this festive mix. Then comes her first single, &quot;Vision of Love,&quot; which Carey humorously introduces as &quot;my first single...ever&quot; and laughs. She blows the song away, and establishes the first recorded time of dragging out the final notes of her career-making song, which she now infamously does every time she sings it.\n\nThe semi-autobiographical &quot;Make It Happen&quot; is swashbuckling fun and Carey sings with the kind of passion indicative of a true sense of coming full circle. This version also outshines the impressive but overproduced LP version very easily.\n\nThen comes &quot;I'll Be There&quot; featuring her long-time friend and musical confidant Trey Lorenz. Soon to be one of the biggest hits of her career, when it was casually launched to radio around the time &quot;Unplugged&quot; aired, it originally was not at all intended to become a single. Not only did it soon become necessary to release the track as an official single, which would go on to hit #1 easily, but the success of the track is the only reason that cleared the way for the special to get pressed on CD. You can thank Carey and Lorenz for their spine-tinglingly spectacular performance of the song, which will surely still be heard on radio for generations to come.\n\nThe disc closes with &quot;Can't Let Go,&quot; which is presented by Carey as an encore she was completely unsure of as to whether it would be performed or not. An understated, low-key reading of the 1991 #2 hit, the performance is not quite on par with the extremely high standard set by the rest of the disc, but is nevertheless a fine closing number to the performance, which is still unfortunately only available on VHS, not DVD. Hopefully the only increasing success of her latest album, &quot;The Emancipation of Mimi&quot; will clear the way for all of Carey's old home videos to be re-released on DVD. *\n\nAll in all, &quot;Unplugged&quot; is a novelty item in Carey's catalogue that is truly remarkable. It completely and utterly justifies why she shot to such an incredible height of fame at so young an age in her still only-budding career. Nothing but sheer, pure talent is showcased, while the release also reminds the listener, all these years later, just how far Carey has come in revitalizing her music in the time since then. Indeed, this is what she evolved from, and what an interesting story it is that began.\n\n* This has occurred in the intervening years since this review was first written.","torrent":{"xt":"urn:btih:d7f1fb74272b7806c030c76f0a9d250fb89907d0","amp;dn":"Mariah+Carey+MTV+Unplugged+320cbr+1992+R%26amp%3BB+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7f1fb74272b7806c030c76f0a9d250fb89907d0","infoHashBuffer":{"type":"Buffer","data":[215,241,251,116,39,43,120,6,192,48,199,111,10,157,37,15,184,153,7,208]},"announce":[],"urlList":[]}}