{"title":"THE GUILTY, by David Baldacci","uid":12892722,"size":484593,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d7fabdf349da6315f5dfa98dd297128bad9dc890&amp;dn=THE+GUILTY%2C+by+David+Baldacci&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1449146573,"description":"THE GUILTY, by David Baldacci | EPUB\r\n\r\n\r\nWill Robie is the government's most professional, disciplined, and lethal assassin. He infiltrates the most hostile countries in the world, defeats our enemies' advanced security measures, and eliminates threats before they ever reach our shores. But now, his skills have left him. Sent overseas on a critical assignment, he fails, unable to pull the trigger. Absent his talents, Robie is a man without a mission, and without a purpose.\r\nTo recover what he has lost, Robie must confront what he has tried to forget for over twenty years: his own past.\r\nTHE GUILTY\r\nWill Robie escaped his small Gulf Coast hometown of Cantrell, Mississippi after high school, severing all personal ties, and never looked back. Not once. Not until the unimaginable occurs. His father, Dan Robie, has been arrested and charged with murder.\r\nFather and son haven't spoken or seen each other since the day Robie left town. In that time, Dan Robie-a local attorney and pillar of the community-has been elected town judge. Despite this, most of Cantrell is aligned against Dan. His guilt is assumed.\r\nTo make matters worse, Dan has refused to do anything to defend himself. When Robie tries to help, his father responds only with anger and defiance. Could Dan really be guilty?\r\nWith the equally formidable Jessica Reel at his side, Robie ignores his father's wishes and begins his own desperate investigation into the case. But Robie is now a stranger to his hometown, an outsider, a man who has forsaken his past and his family. His attempts to save his father are met with distrust and skepticism . . . and violence.\r\nUnlike the missions Robie undertook in the service of his country, where his target was clearly defined, digging into his father's case only reveals more questions. Robie is drawn into the hidden underside of Cantrell, where he must face the unexpected and possibly deadly consequences of the long-ago choices made by father and son. And this time, there may be no escape for either of them.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:d7fabdf349da6315f5dfa98dd297128bad9dc890","amp;dn":"THE+GUILTY%2C+by+David+Baldacci","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7fabdf349da6315f5dfa98dd297128bad9dc890","infoHashBuffer":{"type":"Buffer","data":[215,250,189,243,73,218,99,21,245,223,169,141,210,151,18,139,173,157,200,144]},"announce":[],"urlList":[]}}