{"title":"Oracle 11g Anti-hacker's Cookbook","uid":7870523,"size":4163547,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d927ee6c407b65a66a8220793f8cb8353f6c7518&amp;dn=Oracle+11g+Anti-hacker%27s+Cookbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"d347hBy73","files":-1,"time":1354150321,"description":"Oracle 11g Anti-hackers Cookbook\n\n\nRelease Date: October 25, 2012\nOver 50 recipes and scenarios to hack, defend, and secure your Oracle Database\n\nLearn to protect your sensitive data by using industry certified techniques\nImplement and use ultimate techniques in Oracle Security and new security \n\nfeatures introduced in Oracle 11g R2\nImplement strong network communication security using different encryption \n\nsolutions provided by Oracle Advanced Security\nIn Detail\n\nFor almost all organizations, data security is a matter of prestige and \n\ncredibility. The Oracle Database is one of the most rich in features and \n\nprobably the most used Database in a variety of industries where security is \n\nessential. To ensure security of data both in transit and on the disk, Oracle \n\nhas implemented the security technologies to achieve a reliable and solid \n\nsystem. In Oracle 11g Anti-Hacker's Cookbook, you will learn about the most \n\nimportant solutions that can be used for better database security\n\n&quot;Oracle 11g Anti-hacker's Cookbook&quot; covers all the important security measures \n\nand includes various tips and tricks to protect your Oracle Database.\n\n&quot;Oracle 11g Anti-hacker's Cookbook&quot; uses real-world scenarios to show you how \n\nto secure the Oracle Database server from different perspectives and against \n\ndifferent attack scenarios. Almost every chapter has a possible threads \n\nsection, which describes the major dangers that can be confronted. The initial \n\nchapters cover how to defend the operating system, the network, the data and \n\nthe users. The defense scenarios are linked and designed to prevent these \n\nattacks. The later chapters cover Oracle Vault, Oracle VPD, Oracle Labels, and \n\nOracle Audit. Finally, in the Appendices, the book demonstrates how to perform \n\na security assessment against the operating system and the database, and how \n\nto use a DAM tool for monitoring.\n\nWhat you will learn from this book\n\nGet to grips with configuring a secure server at operating system level for \n\nOracle Database\nMaster how to secure data by using Oracle Cryptographic API and Transparent \n\nData Encryption\nGet step-by-step instructions to implement a solid audit strategy by using the \n\nbuilt in solutions and fine grained auditing\nUnderstand how to segregate and protect data access by using Oracle Vault\nLearn about different types of attacks and how to implement a solid defence \n\nagainst them\nEmpathize the attacks and interceptions by using different techniques and \n\ntools such as sniffing, man-in-the-middle, brute force and password crackers.\nApproach\n\nThis cookbook has recipes written in simple, easy to understand format with \n\nlots of screenshots and insightful tips and hints.\n\nWho this book is written for\n\nIf you are an Oracle Database Administrator, Security Manager or Security \n\nAuditor looking to secure the Oracle Database or prevent it from being hacked, \n\nthen this book is for you\n\nThis book assumes you have a basic understanding of security concepts.","torrent":{"xt":"urn:btih:d927ee6c407b65a66a8220793f8cb8353f6c7518","amp;dn":"Oracle+11g+Anti-hacker%27s+Cookbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d927ee6c407b65a66a8220793f8cb8353f6c7518","infoHashBuffer":{"type":"Buffer","data":[217,39,238,108,64,123,101,166,106,130,32,121,63,140,184,53,63,108,117,24]},"announce":[],"urlList":[]}}