{"title":"Thomson-Reuters Innodata Isogen massive leak FSB Russia files an","uid":7418932,"size":1186836013,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d9429545746bb94543e4464409247c14a8723ff5&amp;dn=Thomson-Reuters+Innodata+Isogen+massive+leak+FSB+Russia+files+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ishatonTPB","files":-1,"time":1341604982,"description":"Innodata Corporation with unscrewd ass was examined for possible rectum leak.\nMuch of it was drained from Information Analyst Company - an intell arm of\nInnodata operated from PH. Having poked into Innodata branches worldwide we found\nvery funky business of Innodata Derwent messin round with da Russian FSB and Ukrainian\npolitician by name Yatsenuk and Iraqi minister Shafeeq. Thers also about 3Gb of Vietnam Atom raw files\nanalyzed and processed by Innodata.\nGood read though, Russian Software company Vocord Telecom entrusted Innodata with it's innovative patented technology\nand was focked by Derwent Patent bureau, who sold it to Ukrainians in exchange for Russian FSB\nmarine satalite interception. Seems that it's just the tip of the iceberg. We only started.\nDescripschon - This is only Philipinez Innodata branch delivered.\nTotal raw data archive of 10.2 GB\nTotal organized and checked stuff is over 40GB\nWe will deliver as soon as new archives uploaded, updates will follow.\nStuff provided RAW from Innodata incom servers.\nSo far will be 8 consequitive releases from every single Innodata brach we PAWNED.\nIncluding personal communication of Top Management of Thomson-Reuters who we want to talk to first before releasing some of the nasty shit.\nVocord telecom software source codes will also be released as collateral damage so sorry fellaz but\nyou have to keep ya shit with ya and not being an outsource junkie waiting for a fix =) haha\n \nRegardz to Team Viewer mentaly retarded coderz -  After we done with Innodate we will present your source codes\nto the community, until than we will exploit more idiots who use your software within the corporate world.\n \nHigh Five to Ukrainian organized crime politician Arseny Yatsenuk and his FSB friends!\nVocord Telecom source codes split into portions so be patient.\n \nOur respect to all Anonymous movement, Lulz, Antisec, The Pirate Bay and my ninjas in La Tuna TX, Pollock LA. Keep them strong!\n             \nPreview of what's inside:  &lt;a href=&quot; http://imgur.com/a/L9fEQ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgur.com/a/L9fEQ&lt;/a&gt; or http://staticninja.imgur.com\n\nAnd just to be safe dont forget to use sandboxie, just in case\n \nStay tuned, more's on its way... \n\n","torrent":{"xt":"urn:btih:d9429545746bb94543e4464409247c14a8723ff5","amp;dn":"Thomson-Reuters+Innodata+Isogen+massive+leak+FSB+Russia+files+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9429545746bb94543e4464409247c14a8723ff5","infoHashBuffer":{"type":"Buffer","data":[217,66,149,69,116,107,185,69,67,228,70,68,9,36,124,20,168,114,63,245]},"announce":[],"urlList":[]}}