{"title":"Hal Clement -2bks.Gravity 1&amp;2","uid":11138613,"size":339416274,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d99cc0229e5191ba3188e4eb57f98ad86e5c2960&amp;dn=Hal+Clement+-2bks.Gravity+1%26amp%3B2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twocows","files":6,"time":1412138980,"description":"Book 1-Mission of Gravity\nFor a profit &amp; adventure Barlennan would sail thousands of miles across uncharted waters, into regions where gravity played strange tricks. He'd dare the perils of strange tribes &amp; stranger creatures--even dicker with those aliens from beyond the skies, tho the concept of another world was unknown to the inhabitants of the planet of Mesklin. But in spite of the incredible technology of the strangers &amp; w/out regard for their enormous size, Barlennan had the notion of turning the deal to an unsuspected advantage for himself--a considerable enterprise for a being very much resembling a 15&quot; caterpillar\n\nBook 2 Star Light\nDhrawn was a giant rockball, more than 3,000 times the mass of Earth. Perhaps a planet, perhaps a nearly dead star, these 17 billion square miles of mystery cried out for investigation. But its corrosive atmosphere and crushing gravity assured that no human would ever set foot on its surface.\nThose hardy, caterpillarlike Mesklinites, on the other hand, were ideally suited to explore Dhrawn, and their leader certainly knew a good deal when he saw one. So Barlennan, a shrewd sea captain if ever there was one, struck a sharp bargain with the Earthmen for his services in leading the expedition.\nBut the humans might not have been so pleased with their side of the bargain, if they had known that Barlennan had plans of his own for Dhrawn.. ","torrent":{"xt":"urn:btih:d99cc0229e5191ba3188e4eb57f98ad86e5c2960","amp;dn":"Hal+Clement+-2bks.Gravity+1%26amp%3B2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d99cc0229e5191ba3188e4eb57f98ad86e5c2960","infoHashBuffer":{"type":"Buffer","data":[217,156,192,34,158,81,145,186,49,136,228,235,87,249,138,216,110,92,41,96]},"announce":[],"urlList":[]}}