{"title":"Mario Vargas Llosa - Essays on Literature, Art and Politics (201","uid":8463160,"size":576893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd2beb9736e1b6da56e06502bdab942ef10be480&amp;dn=Mario+Vargas+Llosa+-+Essays+on+Literature%2C+Art+and+Politics+%28201&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1368290971,"description":"Mario Vargas Llosa - Touchstones: Essays on Literature, Art, and Politics. Selected, edited, and translated by John King (Farrar, Strauss and Giroux, 2011).\n\nISBN: 9780374278373 | 400 pages | EPUB\n\n\nOne of Latin America's most garlanded novelists -- and the recipient of the 2010 Nobel Prize in Literature -- Mario Vargas Llosa is also an acute and wide-ranging cultural critic and an acerbic political commentator. Touchstones collects Vargas Llosa's brilliant readings of seminal twentieth-century novels, from &quot;Heart of Darkness&quot; to &quot;The Tin Drum&quot;; incisive essays on political and social thinkers; and contemporary pieces on 9/11 and the immediate aftermath of the war in Iraq.\n\nFantastically intelligent, inspired, and surprising, this is a landmark collection of essays from one of the world's leading writers and intellectuals.\n\n\nReviews\n\n&quot;In the star-studded world of the Latin American novel, Mario Vargas Llosa is a supernova.&quot; -- Raymond Sokolov, Wall Street Journal\n\n&quot;The bold, dynamic and endlessly productive imagination of the Peruvian novelist Mario Vargas Llosa, one of the writing giants of our time, is something truly to be admired . . . As with any great writer, [he] makes us see clearly what we have been looking at all the while but never noticed.&quot; -- Alan Cheuse, San Francisco Chronicle\n\n&quot;Generous in friendship, unfailingly curious about the world at large, tireless in his quest to probe the nature of the human animal, [Vargas Llosa] is a model writer for our times.&quot; -- Marie Arana, Washington Post\n\n&quot;[Vargas Llosa] is a worldly writer in the best sense of the word: intelligent, urbane, well-traveled, well-informed, cosmopolitan, free-thinking and free-speaking.&quot; -- Merle Rubin, Los Angeles Times\n\n&quot;Mario Vargas Llosa has long been a literary adventurer of the very first order . . . [He], I am convinced, can tell us stories about anything and make them dance to his inventive rhythms.&quot; -- Lisa Appignanesi, The Independent\n","torrent":{"xt":"urn:btih:dd2beb9736e1b6da56e06502bdab942ef10be480","amp;dn":"Mario+Vargas+Llosa+-+Essays+on+Literature%2C+Art+and+Politics+%28201","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd2beb9736e1b6da56e06502bdab942ef10be480","infoHashBuffer":{"type":"Buffer","data":[221,43,235,151,54,225,182,218,86,224,101,2,189,171,148,46,241,11,228,128]},"announce":[],"urlList":[]}}