{"title":"[Reality Kings] Hot Teen Next Door 27 (2016)","uid":14027315,"size":2396019473,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:dd76fffed1c08b9acf8d67516c06685c1da1ca6f&amp;dn=%5BReality+Kings%5D+Hot+Teen+Next+Door+27+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":14,"time":1458934715,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=4307565098\r\n \nhttp://imagedisco.net/?g=7760085463\r\n\r\n\r\n\r\nDescription:\r\n\r\n6 smokin' scenes of more young girls being stretched to their limits!\r\n\r\nBailey was a 19-year-old hottie from Texas with a nice big booty and perky tits who wanted to experience the Fiesta after her best friend gave her the address. When Bailey arrived, she showed her nips at the door and access was granted. Once inside, she revealed her affinity for sucking and riding big cocks during her interview. Tyler immediately jumped in to take advantage with his hard dick in hand and stuffed Bailey's pretty mouth. She slobbed on it and masterfully deep-throated his dick. Soon after, Tyler was pounding her tight pussy all over the living room and finally sent her home with a mouth full of cum.\r\n\r\nTiffany stopped by the Cum Fiesta house to get her jizz fix. She'd heard from some good friends that this was the place to go if you wanted to cum a lot, so Tiffany gave it a try. She rode Peter's dick non-stop until she orgasmed more times than she could count. Tiffany had a beautiful, natural set of tits. Those boobs were perfect. Watch her take Peter's dick over and over in that hot little pussy during her cum fiesta session. Then, after riding dick, she got Peter's wad busted all over her pretty little face!\r\n\r\nDeedee and Rose showed up to check out the Fiesta. We were officially an urban legend in every neighborhood and had to set up shop. They'd heard about the no strings attached fun we had in store for any girl brave enough to take a chance. Rose didn't have the courage to go at it alone, so she brought along her redhead gal pal, Deedee. The icebreaker came and went, and they warmed up to the prospect of having a good time rather quickly. They pleasured each other orally and then tag-teamed my buddy. Soon after, they took turns using him however they desired. There was a bit of a competition, and Rose had a little trouble sharing, but everything worked out amicably and everyone had a great time.\r\n\r\nScarlett heard about the Cum Fiesta party and instantly knew she had to go check it out. She got there dripping wet, and with a quick flash of her passwords, she was granted access. This sexy brunette came in her best cowgirl outfit to show she was ready to ride. Scarlett quickly stripped down showing off her plump juicy ass and nice perky tits. With only her boots still on, her state of excitement could easily be heard as she fingered her pussy. Scarlett showed her skills as she went to town on that cock. She got her cowgirl on, as she rode that cock until she got a healthy facial that filled her mouth.\r\n\r\nMiko stopped by the Cum Fiesta house to get her hungry Asian pussy fucked. She came looking for a big dick and a huge load to swallow. Lucky for her Tyler was more than capable of fulfilling her needs. Miko's tight pink pussy was incredible, and Tyler loved it. He pounded it like a wild man and made Miko speak Chinese, as she orgasmed over and over again. Watch this hot sexy Asian take a big dick and jizz load.\r\n\r\nSabrina had heard about the Cum Fiesta from some close friends of hers and wanted to try it out herself to see what it was all about. After all, when it came to big dicks and hard poundings, Sabrina was always looking for the next best thing. She was a slender cutie with gorgeous eyes, nice tits, a hot ass, and a ripe perfect pussy. At the door, Sabrina showed us her hot tits as the password to get into the fiesta. Soon after, she was undressing and playing with her juicy pussy. Sabrina sucked that cock like it was the last one she'd ever have again. She got her pussy drilled hard and loved it. Then Sabrina got that Cum Fiesta all over her pretty face","torrent":{"xt":"urn:btih:dd76fffed1c08b9acf8d67516c06685c1da1ca6f","amp;dn":"%5BReality+Kings%5D+Hot+Teen+Next+Door+27+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd76fffed1c08b9acf8d67516c06685c1da1ca6f","infoHashBuffer":{"type":"Buffer","data":[221,118,255,254,209,192,139,154,207,141,103,81,108,6,104,92,29,161,202,111]},"announce":[],"urlList":[]}}