{"title":"Inside Pirate Radio 1990, VHS rip","uid":10570803,"size":1457161235,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:de2cccdf8664d8a30ed13ce50cf3f3115e6fda9d&amp;dn=Inside+Pirate+Radio+1990%2C+VHS+rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1405571443,"description":"Inside Pirate Radio\n\nA first hand look into the underground world of the free radio movement\n\n1990, Franklin Video Group, documentary.\n\nA small press, independent documentary on pirate radio, which is also called free radio, underground radio, bootleg, alternative, unlicensed radio and other names.\n\nToday you might know of pirates on the FM bands, usually as minority broadcasters serving the needs of their local community, but there's an underground to that underground, shortwave stations that reach large areas with infrequent broadcasts, more hobbyist in nature. That's the side that this video mainly has a look at, interviewing four different radio personalities about their motivations, and looking in on how a broadcast is done.\n\nInterviewees include:\n\nAndrew Yoder, author and pirate radio expert, who has written and edited a number of books on pirate radio, and is most well known for 'Pirate Radio Stations, tuning in the underground broadcasts'. He currently has a sideline of restoring antique radios, including replacing the electronic parts and rebuilding/woodworking the cabinets.\n\nRadio Animal, electronics technician and radio mad scientist, is known for being Boomer The Dog, an eccentric television personality who prefers to be a sheepdog. He currently runs a 'carrier current' station on mediumwave, AM band.\n\nHarry A. Ness (Radio Flattus) and Sparky (WKZP, K-Zap), whereabouts and professions currently unknown, stations or bios not found on line.\n\nSource file is a commercial VHS tape, that was sold across the USA through radio and electronics hobbyist magazines in the early 1990s. The file size might seem a bit large for an hour film, but it was done to keep the quality high in the face of the original recording and its VHS quality.\n\n61 minutes\nColor\n640 x 480\nXvid-avi video\nmp3, 128 kb/s, CBR stereo audio\n","torrent":{"xt":"urn:btih:de2cccdf8664d8a30ed13ce50cf3f3115e6fda9d","amp;dn":"Inside+Pirate+Radio+1990%2C+VHS+rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de2cccdf8664d8a30ed13ce50cf3f3115e6fda9d","infoHashBuffer":{"type":"Buffer","data":[222,44,204,223,134,100,216,163,14,209,60,229,12,243,243,17,94,111,218,157]},"announce":[],"urlList":[]}}