{"title":"Scandal: The Rise and Fall of the Birchmier Brothers (Blackmail,","uid":9835320,"size":6780881,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:deba8388acd1b058e9b0f06e78bcfbfe0aa6dc46&amp;dn=Scandal%3A+The+Rise+and+Fall+of+the+Birchmier+Brothers+%28Blackmail%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddaudelin","files":-1,"time":1395897425,"description":"If you enjoy this story, don't forget to sign up for Dalia Daudelin's email list or check out her other stories at http://daliadaudelin.com. \n\nIf you want to learn how to write stories similar to this one and make money from it, check out her book on self-publishing erotica: http://daliadaudelin.com/how-to-self-publish-erotica/\n\n------------\n\nTwo young men and two young women weave themselves deeper and deeper into drama, heartbreak, betrayal and sex in this series of short erotic stories.  \n \nThe sons of Jordan Birchmier, Christian and Jordan, have been at war with one another for years. When older brother, Christian, caught younger brother, Jordan, behaving badly and had their father strike Jordan from the will, the younger Birchmier swore to get revenge. \n \nThat revenge caught innocent Willow, a woman from a poor family that basically won the lottery when she got a job at Birchmier and Sons. Photos of her having drunken sex emailed to Christian dash all of her hopes and dreams, though, when they are used to blackmail him into firing her. \n \nWhen Jordan and Willow meet, it seems that romance and a mutual desire for revenge cause them to bond. But the plan that they hatch ends with a shocking twist Willow never sees coming. \n \nThis 6000 word story includes a hot sex scene with a blow job and sex with the woman on top. There's blackmail, intrigue, and some romance too!","torrent":{"xt":"urn:btih:deba8388acd1b058e9b0f06e78bcfbfe0aa6dc46","amp;dn":"Scandal%3A+The+Rise+and+Fall+of+the+Birchmier+Brothers+%28Blackmail%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"deba8388acd1b058e9b0f06e78bcfbfe0aa6dc46","infoHashBuffer":{"type":"Buffer","data":[222,186,131,136,172,209,176,88,233,176,240,110,120,188,251,254,10,166,220,70]},"announce":[],"urlList":[]}}