{"title":"Library 2020 - Joseph Janes.epub","uid":9481268,"size":724917,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df7fbfc7417f9735bdedd0d1f8ae941352c0c622&amp;dn=Library+2020+-+Joseph+Janes.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1389801830,"description":"Thinking about the future of libraries, librarianship and the work librarians do is as old as libraries themselves. (No doubt seminars were organized by the Alexandria Librarians Association on the future of the scroll and what to do about the rising barbarian tide.) At no time in our memory, though, have these discussions and conversations been so profound and critical. Here one of today s leading thinkers and speakers about the future of libraries brings together 30 leaders from all types of libraries and from outside librarianship to describe their vision of what the library will be in 2020. Contributors including Stephen Abram, Susan Hildreth, Marie Radford, Clifford Lynch, and Library Journal s The Annoyed Librarian were asked to describe the library of 2020, in whatever terms they wanted, either a specific library or situation or libraries in general. They were told: be bold, be inspirational, be hopeful, be true, be provocative, be realistic, be depressing, be light-hearted, be thoughtful, be fun be yourself, and for heaven s sake, don t be boring. Not that they could be. Broadly representative of important perspectives and aspects within the profession as well as featuring important voices beyond the professional realm, Library 2020 presents thought-provoking and illuminating visions from many points of view. It is both required reading for library leaders and trustees as well as an ideal supplemental text for LIS classes looking at the future of the profession.","torrent":{"xt":"urn:btih:df7fbfc7417f9735bdedd0d1f8ae941352c0c622","amp;dn":"Library+2020+-+Joseph+Janes.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df7fbfc7417f9735bdedd0d1f8ae941352c0c622","infoHashBuffer":{"type":"Buffer","data":[223,127,191,199,65,127,151,53,189,237,208,209,248,174,148,19,82,192,198,34]},"announce":[],"urlList":[]}}