{"title":"Multilayer Flexible Packaging 2nd ed - John R. Wagner, Jr.","uid":15466802,"size":48923679,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfb11c4e91f72dab333177b6953f962b4230b0bb&amp;dn=Multilayer+Flexible+Packaging+2nd+ed+-+John+R.+Wagner%2C+Jr.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470104211,"description":"Multilayer Flexible Packaging 2nd ed - John R. Wagner, Jr. (WA, 2016).pdf\r\n\r\nMultilayer Flexible Packaging, Second Edition, provides a thorough introduction to the manufacturing and applications of flexible plastic films, covering materials, hardware and processes, and multilayer film designs and applications. The book gives engineers and technicians a better understanding of the capability and limitations of multilayer flexible films and how to use them to make effective packaging.\r\n\r\nIt includes contributions from world renowned experts and is fully updated to reflect the rapid advances made in the field since 2009, also including an entirely new chapter on the use of bio-based polymers in flexible packaging. The result is a practical, but detailed reference for polymeric flexible packaging professionals, including product developers, process engineers, and technical service representatives.\r\n\r\nThe materials coverage includes detailed sections on polyethylene, polypropylene, and additives. The dies used to produce multilayer films are explored in the hardware section, and the process engineering of film manufacture is explained, with a particular focus on meeting specifications and targets. In addition, a new chapter has been added on regulations for food packaging – including both FDA and EU regulations.\r\n\r\n\r\n\r\nProvides a complete introduction to multilayer flexible packaging, assisting plastics practitioners with the development, design, and manufacture of flexible packaging for food, cosmetics, pharmaceuticals, and more\r\nPresents thorough, well-written, and up-to-date reviews of the current technology by experts in the field, making this an essential reference for any engineer or manager\r\nIncludes discussion and analysis of the latest rules and regulations governing food packaging","torrent":{"xt":"urn:btih:dfb11c4e91f72dab333177b6953f962b4230b0bb","amp;dn":"Multilayer+Flexible+Packaging+2nd+ed+-+John+R.+Wagner%2C+Jr.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfb11c4e91f72dab333177b6953f962b4230b0bb","infoHashBuffer":{"type":"Buffer","data":[223,177,28,78,145,247,45,171,51,49,119,182,149,63,150,43,66,48,176,187]},"announce":[],"urlList":[]}}