{"title":"Neo's safekey V1.0.0.0","uid":4134967,"size":36864,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dfb3f6c79bf006fed60e57a04c421906917af93b&amp;dn=Neo%5C%27s+safekey+V1.0.0.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oncommingstorm","files":1,"time":1208216044,"description":"When you&amp;#039;re in a shady internet cafe in Bangkok and you&amp;#039;re worried about rogue software logging your passwords as you type them, you need a USB drive with Neo&amp;#039;s SafeKeys on it. Neo&amp;#039;s SafeKeys is a small, mouse-based keyboard that shows up on your screen in different places each time you run it from your drive. You click the SafeKeys keyboard to enter your password, then select it and drag and drop it to the password field to bypass keylogging AND clipboard logging software. A great addition to your portable apps collection, Neo&amp;#039;s SafeKeys is a free download for Windows only.\n\nYou type your password by clicking each button on the keyboard of this application (with your mouse). Your password will appear, letter by letter, in the text box at the bottom of the window (within a ****** password mask). Select the text with your mouse and then drag-drop it onto the password box on your online form. That&amp;#039;s it!\n\nADVANTAGES:\n\n* You don&amp;#039;t use your keyboard (keyloggers cannot record the password)\n* The utility changes width and height each time, as well as its placement on the   screen (to fool mouse-loggers, buttons will always be in different positions each time you use the program)\n* Nothing is stored in the clipboard (clipboard loggers cannot save the password).\n* You can use upper-case letters and symbols (such as !@#${}) by pressing the CAP button - no matter how complex your password is, the utility can type it.\n","torrent":{"xt":"urn:btih:dfb3f6c79bf006fed60e57a04c421906917af93b","amp;dn":"Neo%5C%27s+safekey+V1.0.0.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfb3f6c79bf006fed60e57a04c421906917af93b","infoHashBuffer":{"type":"Buffer","data":[223,179,246,199,155,240,6,254,214,14,87,160,76,66,25,6,145,122,249,59]},"announce":[],"urlList":[]}}