{"title":"Viaje al Oeste [Tuzito]","uid":15802934,"size":12285471,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfb6c9c18f53a05917cba1efc3c707cb726b1488&amp;dn=Viaje+al+Oeste+%5BTuzito%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tuzito","files":1,"time":1473532565,"description":"Esta nueva edición de Viaje al Oeste viene a llenar un vacío tan enorme como la novela en sí, pues estamos hablando de todo un clásico de la literatura universal que, hasta épocas muy recientes, ha permanecido desconocido para los lectores españoles. El asunto es todavía más grave si se tiene en cuenta que el Rey Mono, uno de los protagonistas de la narración, es en China un personaje tan popular como lo pueden ser entre nosotros Don Quijote y Sancho Panza: ni algo menos ni algo más. Y cuando los personajes literarios llegan a esa forma absoluta de la fama es porque son capaces, por sí mismos, de representar a toda una cultura y hasta de incluir en su mecánica lógica y mitológica claves fundamentales para interpretar esa misma cultura.  Por lo demás, Viaje al Oeste es la recreación, profusamente detallada, del mito de Xuanzang (Hsüan-Tsang): el monje que partió hacia la India en busca de los verdaderos textos budistas. Se trata de un viaje evidentemente inciático (para los personajes que lo protagonizan y para el lector que los sigue), jalonado por toda clase de catástrofes interiores y exteriores, y en el que le acompañan tres discípulos. \r\n\r\n El Rey Mono es uno de ellos. Posee poderes mágicos que le permiten llevar a cabo setenta y dos transformaciones de su apariencia y está capacitado para «identificar a los demonios en un abrir y cerrar de ojos», como suelen decir los chinos, que desde el primer emperador a los tiempos de Mao se han especializado en identificar demonios de toda suerte y en clasificarlos, siguiendo operaciones mentales no tan diferentes a las que empleaba el venturoso Emanuel Swedenborg para clasificar a las poblaciones angélicas. En China los demonios formaban una auténtica multitud. En términos específicos, se trata de una creencia muy alejada de nuestra cultura, pero no en términos generales, ya que en los evangelios el mismo Jesucristo hace varias referencias a la «multitud» de demonios que pueden asaltar a las almas descuidadas. Se trata, con toda evidencia, de demonios diferentes pero que tienen en común su naturaleza perturbadora y posesiva. \r\n\r\n Como otras grandes narraciones del Reino del Medio, Viaje al Oeste es una creación del período Ming, el más glorioso de la novela china, y es al mismo tiempo la obra de todo un pueblo, como la muralla china y como el mismo imperio, en la que intervienen muchos creadores, hasta cristalizar como narración plena de sentido y perfectamente estructurada en el siglo XVI, gracias a la probable intervención del escritor Wu Chengen, que la dotó de una poderosa estructura","torrent":{"xt":"urn:btih:dfb6c9c18f53a05917cba1efc3c707cb726b1488","amp;dn":"Viaje+al+Oeste+%5BTuzito%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfb6c9c18f53a05917cba1efc3c707cb726b1488","infoHashBuffer":{"type":"Buffer","data":[223,182,201,193,143,83,160,89,23,203,161,239,195,199,7,203,114,107,20,136]},"announce":[],"urlList":[]}}