{"title":"Gale Warner Michael Shuman - Citizen Diplomats Pathfinders","uid":15478833,"size":25652328,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dff52218ecf51ba148edf951aed11c5f72979e6e&amp;dn=Gale+Warner+Michael+Shuman+-+Citizen+Diplomats+Pathfinders&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"wildpig1234","files":1,"time":1470221212,"description":"Gale Warner Michael Shuman - Citizen Diplomats Pathfinders in Soviet-American Relations-And How You Can Join Them\r\n\r\n\r\nHardcover: 381 pages\r\nPublisher: Continuum Pub Group; First Edition edition (March 1987)\r\nLanguage: English\r\nISBN-10: 0826403824\r\nISBN-13: 978-0826403827\r\n Product Dimensions:  22.9 x 15.2 x 3.6 cm \r\nShipping Weight: 658 g\r\n\r\n\r\n\r\nFrom Publishers Weekly\r\n\r\nIt's one thing to tour the Soviet Union, and quite another to become a &quot;citizen diplomat,&quot; who deliberately tries to improve Soviet-American relations through people-to-people dialogues, explain the authors. They describe the efforts of nine diverse Americans to break stereotypic &quot;us and them&quot; thinking, spread information and influence leaders on both sides of the Cold War. These unofficial diplomats range from writer Norman Cousins and businessman Armand Hammer to lawyer-biker Christopher Senie (who organized &quot;Bike for Peace&quot;) and agrarian banker John Chrystal. The authors (Warner is a journalist, Shuman is president of the Center for Innovative Diplomacy in California) explore the rewards, difficulties and controversy associated with such work, and offer a rundown of resources and agencies. Photos not seen by PW. Major ad/promo; first serial to Parade; author tour. \r\nCopyright 1987 Reed Business Information, Inc. \r\n\r\nFrom Library Journal\r\n\r\nCentral to the mission of &quot;citizen diplomats&quot; is a belief that the &quot;best defense against nuclear war may well be a strong, complex, and durable web of relationships between peoples of the Soviet Union and the United States.&quot; This book offers a sympathetic account of nine such &quot;citizen diplomats,&quot; from Armand Hammar and Norman Cousins to the late Samantha Smith. The well-written but uncritical stories depict the obstacles confronting individual diplomacy. Rising interest in transnational activity extends the book's appeal. However, the work begs the question of whether &quot;citizen diplomats&quot; have had lasting impact on Soviet-American relations. The appendixes survey most channels of private Soviet-American exchange. Recommended for larger libraries.Zachary T. Irwin, Humanities &amp; Social Sciences Div., Behrend Coll., Pennsylvania State Univ., Erie\r\nCopyright 1987 Reed Business Information, Inc","torrent":{"xt":"urn:btih:dff52218ecf51ba148edf951aed11c5f72979e6e","amp;dn":"Gale+Warner+Michael+Shuman+-+Citizen+Diplomats+Pathfinders","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dff52218ecf51ba148edf951aed11c5f72979e6e","infoHashBuffer":{"type":"Buffer","data":[223,245,34,24,236,245,27,161,72,237,249,81,174,209,28,95,114,151,158,110]},"announce":[],"urlList":[]}}