{"title":"Innovations in Hospice Architecture","uid":5263158,"size":43063911,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e204e0812a74e9374510ab62819a7205792f2942&amp;dn=Innovations+in+Hospice+Architecture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BlubiBoy","files":-1,"time":1262801602,"description":"Innovations in Hospice Architecture\nAuthor: Stephen F. Verdeber, Ben J. Refuerzo\nPublisher: Taylor &amp; Francis\n\nNo. of pages: 199 pages\nFormat: PDF\nSize: 41 MB\n\nBook Description:\nSocieties around the globe are aging at an unprecedented rate. This trend is particularly pronounced in Japan, Russia, Western Europe, and in the United States. Palliative care consists of care provided to persons who are in the final stages of a terminal illness. Hospice care, however, is administered to persons of all ages.Innovations in Hospice Architecture responds to the need for a theoretically based reference book summarizing key historical as well as recent developments with respect to this rapidly evolving building type. The objective is to present an overview of the historical origins of the contemporary hospice, the diverse variations on the basic premise of hospice care, to review the scant architectural literature published on this subject to date, and to present a series of case studies of exemplary hospices around the world. The concluding chapter consists of a compendium of planning and design concepts for environments for palliative care. Case study projects are from Japan, Canada, Europe, Africa, Australia, the United States, Taiwan, and South America. These are individually presented and comparatively analyzed, and prognostications for the future of hospice architecture are discussed in the concluding section.\n\nThis book is of interest to architects, students of healthcare architecture, direct care providers including nurses, physicians and therapists, healthcare organizations, and public government agencies. ","torrent":{"xt":"urn:btih:e204e0812a74e9374510ab62819a7205792f2942","amp;dn":"Innovations+in+Hospice+Architecture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e204e0812a74e9374510ab62819a7205792f2942","infoHashBuffer":{"type":"Buffer","data":[226,4,224,129,42,116,233,55,69,16,171,98,129,154,114,5,121,47,41,66]},"announce":[],"urlList":[]}}