{"title":"Peter Gabriel - Still Growing Up Live     2CD and MKV (audio rem","uid":9082675,"size":2215991089,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e274733d46ba813b58aac665de6ecee2ba980f33&amp;dn=Peter+Gabriel+-+Still+Growing+Up+Live+++++2CD+and+MKV+%28audio+rem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"}{eywood","files":18,"time":1382405990,"description":"Peter Gabriel\nStill Growing Up Live\n\n\nI few years ago I came across this DVD and when I watched it I was not very happy with the audio mix. Peter's voice is not in such good shape that it can be left dry and up front in the mix, but on this concert it was. Very little reverb or effects were applied to his vocals in this mix, and it just made his limitations more noticeable. Plus his voice was mixed quite loud, which exacerbated the problem even further.\n\nI decided to investigate the surround mix and see how it was done, and to my surprise I found that the center channel was an isolated vocal track. No drums or bass or any other elements that you'd usually find panned to center, just the vocals. This allowed me the ability to produce the voice a bit better and remix it into the tracks. So I did. The only thing that isn't remixed in this version is In Your Eyes, which was offered as only a stereo mix on the DVD, not 5.1, curtailing any ideas I might have had toward remixing it.\n\nOn this mix Peter's vocals have a bit of echo and varying degrees of reverb on them that give it more of a live album feel to it than the official mix. \n\nIncluded is the stereo CD with my remix at 16/44.1 and a bonus video of the show for the dvd with my stereo remix at 16/48 as the default audio track and the original 5.1 mix as an optional track.\n\nI hope everyone likes this. I tried not to overdo it too much, but I like effects, and I tend to get a little happy with them. I did this twice because I though the first attempt was a little reverb heavy. This one is perfect to me. I hope it is to you too.\n\n","torrent":{"xt":"urn:btih:e274733d46ba813b58aac665de6ecee2ba980f33","amp;dn":"Peter+Gabriel+-+Still+Growing+Up+Live+++++2CD+and+MKV+%28audio+rem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e274733d46ba813b58aac665de6ecee2ba980f33","infoHashBuffer":{"type":"Buffer","data":[226,116,115,61,70,186,129,59,88,170,198,101,222,110,206,226,186,152,15,51]},"announce":[],"urlList":[]}}