{"title":"Video Shooter - Storytelling With HD Cameras 2nd Edition{BBS}","uid":6699065,"size":43334548,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e31b6456bb98115e224f6734d1d82f83a04b8a94&amp;dn=Video+Shooter+-+Storytelling+With+HD+Cameras+2nd+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316891483,"description":"Tired of the dry rudimentary guidebooks that ignore the art of telling compelling video stories? Video Shooter takes you to a new level of competence and expertise by presenting the camera as a potent storytelling tool. Sure, you will learn the basics of HD formats, the fundamentals of compression and color space, but only so much as these technical areas serve your craft, which includes more fundamentally camera placement and eyeline, choice of lens focal length and the power of the triangle in creating powerful compositions. Throughout the book you will come to understand the master shooter's guiding principle, that story is the conduit through which all creative and technical decisions flow.\n\nHumorous and opinionated, the author provides insightful anecdotes and tutorials that help you learn the video shooter's craft. While the book focuses primarily on how to get the most out of your entry- and mid-level P2, XDCAM, and AVCHD camcorder, the principles and lessons covered such as shooting for green screen and understanding point of view apply just as well to video shooters and storytellers of any level.\n\nAs apprenticeships in the industry have largely disappeared, aspiring shooters and film students have had to seek alternative sources for training and guidance. In Video Shooter, you will find a master teacher offering perceptive lessons with a healthy dose of inspiration; these pages are as close to a living and breathing mentor as one can get in a printed form.\n\nHundreds of full-color photos and illustrations present the many lessons throughout the book.\n\nPlease visit the Companion Web site: http://booksite.focalpress.com/Braverman/ (registration code is located inside the book)\n\n\n* Engaging and informative, veteran shooter Barry Braverman shares the ins and outs of crafting a story using DV cams.\n* Extensively illustrated in full color, readers will see examples of good video shooting that will help them learn what to do (and what to avoid) in their own videos.\n* Companion website offers tutorials, bonus illustrations, examples, demos, equipment reviews, craft tips, blogs, and an instructor's corner complete with students' work.\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 300 pages\n    * Publisher: Focal Press; 2 edition (October 19, 2009)\n    * Language: English\n    * ISBN-10: 0240810880\n    * ISBN-13: 978-0240810881","torrent":{"xt":"urn:btih:e31b6456bb98115e224f6734d1d82f83a04b8a94","amp;dn":"Video+Shooter+-+Storytelling+With+HD+Cameras+2nd+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e31b6456bb98115e224f6734d1d82f83a04b8a94","infoHashBuffer":{"type":"Buffer","data":[227,27,100,86,187,152,17,94,34,79,103,52,209,216,47,131,160,75,138,148]},"announce":[],"urlList":[]}}