{"title":"L.A.Noire:Expanded Edition [Lossless Repack] R.G.Origami","uid":6855220,"size":15453454336,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e32523cd34eb65d0a65ba8334906af8562645489&amp;dn=L.A.Noire%3AExpanded+Edition+%5BLossless+Repack%5D+R.G.Origami&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".Dude.","files":1,"time":1322673614,"description":"LA Noire: Expanded Edition v 1.0 (2011/MULTi2/Lossless RePack by RG Origami) Year:2011 | PC Game | Eng Rus | Developer: Team Bondi | Publisher: Rockstar Games | 14.83 GB Genre: Action / Adventure / Racing (Cars) / 3D / 3rd Person America late 40s, the time of flowering of crime and corruption, when the\nAmerican Mafia has moved from bootlegging to drug trafficking, and Los Angeles\n- one of the most brilliant and at the same time the most steeped in crime cities\nin the world. Human life is not worth a dime, where the interests of the major\nplayers involved - the brutal murder, robbery, extortion, bombings and arson\nattacks have become the norm City of Angels. You have to try on the role of Cole Phelps - a police detective, is extremely\nunfortunate for a distinguished true faith in fact, that his task and in fact is to\nserve the law, no matter what. Being surrounded by corrupt police and corrupt\nofficials working in the mafia, he alone must understand whose interests are\nbehind the brutal murders rocked even fairly well-worn Los Angeles. And since\naround too many people who do not want the truth came out out the task he has to very, very difficult ... Features &quot;will be taken into the post-war Los Angeles and to fully feel the atmosphere\nnuarnogo detective action / adventure with a fascinating story and great\ngameplay.\n&quot;In LA Noire, the first time in the history of games using the latest technology\nMotion Scan, which allows unprecedented accuracy to pass the most the\nsmallest movement of the body, and most spectacular - in detail to show facial expressions of characters.\n&quot;Take control Detective Cole Phelps and run it through all the vicissitudes of\npolice work: the search for evidence, interviewing suspects, fights, shootings\nand car chases.\n&quot;LA Noire boasts a huge open world with a total area of 120 square kilometers,\nand Los Angeles 40's recreated with painstaking precision - from the general plan to the architecture of houses and costume characters.\n&quot;The reality is not only in words - the basis for the game's plot laid documentary\nsources of the period in question occurred in the Los Angeles crimes.\n&quot;The line between games and movies has never been so thin - LA Noire takes\nthe best of both areas: entertainment and thoughtful scenes from the movie and\nthe opportunity to influence events on video games. The expanded edition includes access to all issued addenda to LA Noire &quot;5 more investigation first - from smuggling to arson &quot;The Badge Pursuit\nChallenge - Find and collect all the badges to get the Button Man Detective Suit\n&quot;The Broderick Detective Suit - better protection from damage and your skills in\nhand to hand combat &quot;The Sharpshooter Detective Suit - increases the accuracy\nof fire from rifles and pistols, &quot;The Chicago Piano - a powerful gun, hidden in the\ntrunk of your car Features RePack versions It is based on release of THETA\nDo not cut / no recoded\nretained all registry data\nversion of the game - 1.0 (1.0.2393.1)\nInstallation time ~ 30 minutes System Requirements Operating System: Microsoft Windows XP / Vista / Se7en\nProcessor: Intel Dual Core 02.02 GHz or AMD Dual Core 2.4 GHz\nRAM: 2GB\nVideo card: -class NVIDIA GeForce 8600 GT or Radeon HD 3000 with 512MB of\nmemory, compatible with DirectX 9.0c\nSound Card: Sound device compatible with DirectX 9.0c Free space on hard drive: 16Gb","torrent":{"xt":"urn:btih:e32523cd34eb65d0a65ba8334906af8562645489","amp;dn":"L.A.Noire%3AExpanded+Edition+%5BLossless+Repack%5D+R.G.Origami","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e32523cd34eb65d0a65ba8334906af8562645489","infoHashBuffer":{"type":"Buffer","data":[227,37,35,205,52,235,101,208,166,91,168,51,73,6,175,133,98,100,84,137]},"announce":[],"urlList":[]}}