{"title":"Coast to Coast AM February 27 2013","uid":8205624,"size":55781211,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e3960456b047039668aca88ab253d647e86bfe6f&amp;dn=Coast+to+Coast+AM+February+27+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1362116298,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-27-13\nHost: \tGeorge Noory\nGuests: \tNick Begich, Dr. Sam Parnia\n\nIn the first half, lecturer on new technologies, health and earth science related issues, Dr. Nick Begich, talked about HAARP and the various functions the program performs, including possible weather manipulation. He described HAARP's ultimate function as &quot;taking the energy of the Earth and manipulating the energy so it begins to flow in directions at your demand.&quot; This energy, he said, can then be used for &quot;a variety of weapons effects&quot; as well as positive applications such as restoring the environment, missile defense, and disrupting comets or asteroids if they pose a danger to the planet. Begich advocated for more open discussion on the risks and rewards associated with the program rather than keeping it shrouded in secrecy.\n\nRegarding suspicions that HAARP could be used to weaponize or modify weather, Begich acknowledged that it is well within the possible functions of the program. Chillingly, he noted that weather warfare is nearly impossible to prove and allows for plausible deniability. &quot;You could literally create the disaster and then get invited in to mop it up,&quot; he observed, &quot;and be the hero rather than the villain.&quot; Beyond the weaponization of weather, Begich warned about the overall dangers of manipulating the climate. He explained that although international treaties allow for domestic use of weather modification, such tinkering could have adverse effects on neighboring nations or the entire planet.\n\n--------------------------------------\n\nIn the latter half, expert on the scientific study of death, and near-death experiences, Dr. Sam Parnia, discussed how, contrary to popular belief, death is not a moment in time, but rather a process which can be interrupted well after it has begun. &quot;What we can do now, essentially through medicine, is take people who have died and bring them back even many hours after they have died,&quot; he revealed. Parnia explained that although the heart may stop beating, leading to a death pronouncement, it can take up to 8 hours for the cells in the body to undergo their own demise. By slowing down that process, he said, it gives doctors more time to possibly solve the underlying cause of death. As an example, he detailed a case in Japan where a woman had been dead for 10 hours, was revived using advanced life saving techniques, and walked out of the hospital 3 weeks later on her own accord.\n\nAccording to Parnia, these cases where patients return to life after being declared dead for hours give credence to the theory that consciousness continues onward after death. Based on his research on near-death experiencers, Parnia observed that their mindset, in its current state, appears to continue onward after the body has ceased to live. Rather than the popular concept that death leads to unlimited knowledge in the afterlife, he suggested that &quot;people take their own level of thought to the other dimension.&quot; Therefore, Parnia posited that perhaps the purpose of life on Earth is to prepare us to better understand this next level when we arrive there.\n\nNews segment guests: Dr. Sherri Tenpenny &amp; Richard C. Hoagland\nWebsite(s):\n\n    earthpulse.com\n    horizonresearch.org\n\nBook(s):\n\n    Controlling the Human Mind\n    Angels Don't Play This HAARP\n    Erasing Death\n    What Happens When We Die?\n\n","torrent":{"xt":"urn:btih:e3960456b047039668aca88ab253d647e86bfe6f","amp;dn":"Coast+to+Coast+AM+February+27+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3960456b047039668aca88ab253d647e86bfe6f","infoHashBuffer":{"type":"Buffer","data":[227,150,4,86,176,71,3,150,104,172,168,138,178,83,214,71,232,107,254,111]},"announce":[],"urlList":[]}}