{"title":"Osho_Bodidharma the Greatest Zen Master (20 video files)","uid":15778611,"size":4529605877,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e3e11019d3b1f9f3077824e0000ab95afcb7a079&amp;dn=Osho_Bodidharma+the+Greatest+Zen+Master+%2820+video+files%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":41,"time":1473264703,"description":"20 Osho video files,avi format and corresponding text files with sutras. Some of text files have complete questions and answer..\r\n Bodhidharma_The Greatest Zen Master\r\n\r\nTalks given from 05/07/87 am to 14/07/87 pm\r\nEnglish Discourse series\r\n20 Chapters\r\nYear published: 1987\r\n..............................\r\nOn the beginning of this series of talks Osho said: \r\nI have a very soft corner in my heart for Bodhidharma. That makes it a very special occasion to speak about him. Perhaps he is the only man whom I have loved so deeply that speaking on him I will be almost speaking on myself. That also creates a great complexity, because he never wrote anything in his life. No enlightened being has ever written. Bodhidharma is not an exception, but by tradition these three books that we are going to discuss are attributed to Bodhidharma.\r\nThe scholars reason that because there is no contrary evidence -- and for almost one thousand years, these books have been attributed to Bodhidharma -- there is no reason why we should not accept them. I am not a scholar, and there are certainly fragments which must have been spoken by Bodhidharma, but these are not books written by him. These are notes by his disciples. It was an ancient tradition that when a disciple takes notes from the master he does not put his own name on those notes, because nothing of it belongs to him; it has come from the master.\r\nand at the end of first discourse, Osho said:\r\n&quot;So it is going to be a continuous effort to draw lines, between what exactly are Bodhidharma's statements and what are statements by the writers of these books, these notes. But I can say it with authority, because this is my own understanding and experience too: I agree with Bodhidharma on each and every point. In other words, Bodhidharma agrees with me on each and every point.\r\nScholars have been talking about these books. I am not a scholar. I am a Bodhidharma. I will recognize what is my statement and what is not my statement.\r\nGet it?&quot;","torrent":{"xt":"urn:btih:e3e11019d3b1f9f3077824e0000ab95afcb7a079","amp;dn":"Osho_Bodidharma+the+Greatest+Zen+Master+%2820+video+files%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3e11019d3b1f9f3077824e0000ab95afcb7a079","infoHashBuffer":{"type":"Buffer","data":[227,225,16,25,211,177,249,243,7,120,36,224,0,10,185,90,252,183,160,121]},"announce":[],"urlList":[]}}