{"title":"Call of Duty 2 Romanian Language Edition","uid":11892537,"size":3761488980,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e43d810543d3893ff09e119a970d7248f45a27dd&amp;dn=Call+of+Duty+2+Romanian+Language+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"ojobadak","files":4,"time":1431030285,"description":"Call of Duty 2 lets players experience four individual soldier stories as they overcome insurmountable odds in multiple campaigns. Players have the freedom to follow each of the four storylines through for the ultimate character-driven experience, or they can engage in the historic battles chronologically for quick hitting action. Infinity Ward has also expanded the scope of combat to deliver a truly realistic battlefield experience.\n\nDa, deci revenim dupa Most Wanted Romanian Language Edition, cu cel de-al doilea joc din seria Call of Duty, tradus in limba romana de catre M3 Software - 3ogdy.\nCerintele de sistem sunt aceleasi - nu am schimbat MARE LUCRU in joc inafara de text.\nOficial sustinem si este cat se poate de clar ca nu va fii nici-un Call of Duty 3 RLE pur si simplu din cauza faptului ca nu este suportat pe platforma Windows.\n\nVoci-&gt; Originale (Engleza)\nSubtitrari-&gt; Romana\nMeniu-&gt;Romana\nOrice altceva legat de text-&gt;Romana (nu din punct de vedere grafic! - insemnele de pe pereti ramana in germana/engleza).\n\nDupa completarea lucrarii jocul a fost reluat de la bun inceput pentru verificare si corectare / eliminarea posibilelor erori. S-a executat in XP x64 si 7 x64 si functioneaza.\nMontati imaginea si jucati.\n\n\n\nDispuneti si de un shortcut, dar NU SE RECOMANDA FOLOSIREA DIRECTA DIN IMAGINE CI DOAR DUPA CE CONTINUTUL ACESTEIA A FOST COPIAT PE HARD DISK.\nSHORTCUT-UL include o sectiune care sare peste introducerea in joc (filmuletele de la inceput) si va arunca direct in Meniul Principal. Daca aveti vreo problema cu jocul cand il executati prin shortcut, folositi fisierul &quot;COD2SP_s.exe&quot; si nu ar trebui sa existe nici-o problema.\n\nBun, acestea fiind spuse, v-am fi recunoscatori daca ne lasati si un comentariu in legatura cu jocul. Parerile voastre ne intereseaza si conteaza foarte mult.\nApreciem comentariile voastre.\n\nProbabil ca acest an va vedea vreun alt release M3 Software, dar nu va putem spune nimic sigur, nici numele jocului (desi stim care ar fi acela).\n\nPentru orice dubii lasati comentarii si vom incerca sa rezolvam orice problema aveti(desi nu ar trebui sa existe probleme).\nJocul NU se instaleaza ci se executa direct","torrent":{"xt":"urn:btih:e43d810543d3893ff09e119a970d7248f45a27dd","amp;dn":"Call+of+Duty+2+Romanian+Language+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e43d810543d3893ff09e119a970d7248f45a27dd","infoHashBuffer":{"type":"Buffer","data":[228,61,129,5,67,211,137,63,240,158,17,154,151,13,114,72,244,90,39,221]},"announce":[],"urlList":[]}}