{"title":"Kriya United Nations -Sudarshan Kriya - Sri Sri Ravi Shankar.pdf","uid":4356922,"size":12288,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e47257bb7a56608895e4425a81fc2feca0e7aa64&amp;dn=Kriya+United+Nations+-Sudarshan+Kriya+-+Sri+Sri+Ravi+Shankar.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"welovesrisri","files":1,"time":1219452991,"description":"Ancient Breathing Technique Gets Modern Scrutiny and Grabs Attention at United Nations\n\n\n\nNew York, NY - \n\n\nThe Sudarshan Kriya, an ancient yogic breathing technique, is garnering the attention of top-level policy makers and social scientists this week at the U.N. for its documented effectiveness as a treatment for depression, a worldwide health concern. Depression affects millions of people around the world and contributes to the downward spiral of many illnesses and diseases.\n\nBased on an ancient science that originated in India more than 5,000 years ago, the Sudarshan Kriya enables the body to release pent-up stress and also reduces depression. The Sudarshan Kriya has been shown by several independent, scientific studies to have remarkable therapeutic effects on depression, and the latest study\nalso documents another important finding: a reduction in the blood plasma level of cortisol, known as the &quot;stress hormone.&quot;\n\nRonnie Newman, Director of Research for the Art of Living Foundation, explains why a breathing practice has such a beneficial effect on health. &quot;The breath is the fourth source of energy,&quot; states Newman. \n\n&quot;Along with proper nutrition, the right amount of sleep, and a meditative state of mind. By learning a special pattern of breathing, one can release stress and negative emotions from the system, which greatly enhances mental clarity and boosts your energy, besides having all these wonderful long-term health benefits.&quot; Newman, a Harvard-trained researcher, oversees ongoing medical studies on the effects of the Sudarshan Kriya technique.\n\nThe Art of Living Foundation, a nonprofit educational and charitable organization, offers the Sudarshan Kriya technique in several of their courses; to date over a million people in 102 countries have learned the technique, in venues as diverse as government organizations, corporations, hospitals, youth leadership programs,\nand universities.\n\nToday, Ms. Newman will present the findings of the latest studies on the Sudarshan Kriya to the NGO Mental Health Committee at the United Nations in New York. Also presenting will be Dr. Richard Brown of Columbia University, psychiatrist and expert on alternative and complementary treatments that use herbs and\nnutritional supplements to treat depression, and Tiffany Field, Ph.D., Director of the Touch Research Institutes at the University of Miami School of Medicine and NSU in Florida, who spoke on research involving touch therapies for wellness and the treatment of depression in women and children.\n\n&quot;People who are depressed don't always respond to conventional therapy, and there is also the issue of treatment cost in many nations,&quot; states John Osborne, a member of the United Nations NGO Mental Health Committee. &quot;One of the things the Committee looks at closely, in addition to a treatment's effectiveness, is\nhow easily and economically it could be implemented on a worldwide basis. Research is showing us just how remarkable some of these therapies are and itÃƒÂ¢??s encouraging.&quot;\n","torrent":{"xt":"urn:btih:e47257bb7a56608895e4425a81fc2feca0e7aa64","amp;dn":"Kriya+United+Nations+-Sudarshan+Kriya+-+Sri+Sri+Ravi+Shankar.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e47257bb7a56608895e4425a81fc2feca0e7aa64","infoHashBuffer":{"type":"Buffer","data":[228,114,87,187,122,86,96,136,149,228,66,90,129,252,47,236,160,231,170,100]},"announce":[],"urlList":[]}}