{"title":"Jane Fletcher - Wolfsbane Winter","uid":6926903,"size":2448374,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5186d0372958b88493a1839d19c27076e2a785f&amp;dn=Jane+Fletcher+-+Wolfsbane+Winter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Romanah","files":-1,"time":1325540085,"description":"&quot;Anything with two legs and a pulse.&quot; The Iron Wolf mercenaries who guard travelers on the Misery Trail are notorious for their quick and casual sex lives. Deryn may fit the stereotype better than most, but she has her reasons. Tragedy in her childhood has left her wary of forming attachments. If you don't care, then you can't get hurt, but you can still make a mess of things - such as the outstanding error of judgment that leaves her with no money, forced to spend the winter on a lousy job in a miserable little backwater.There she meets Alana, local healer, vet, and woman of mystery. It does not take Deryn long to find out that Alana is more than she seems, and has her own perilous secret to keep. Yet Deryn still finds herself falling for the woman, so much so that her come-and-go lifestyle is at risk.This would be bad enough, but serious trouble arrives for Deryn and Alana in the form of demon magic from the Time of Chaos - revealing that old legends are not merely material for ghost stories around the fire. As the danger increases, who do they need to fear more, the living or the dead?","torrent":{"xt":"urn:btih:e5186d0372958b88493a1839d19c27076e2a785f","amp;dn":"Jane+Fletcher+-+Wolfsbane+Winter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5186d0372958b88493a1839d19c27076e2a785f","infoHashBuffer":{"type":"Buffer","data":[229,24,109,3,114,149,139,136,73,58,24,57,209,156,39,7,110,42,120,95]},"announce":[],"urlList":[]}}