{"title":"Illuminism of the Illuminati Hockney, Faust and Weishaupt","uid":14213174,"size":227636503,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5d9f1b7a73799221c962da572152d991307111f&amp;dn=Illuminism+of+the+Illuminati+Hockney%2C+Faust+and+Weishaupt&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"holocen","files":37,"time":1459992556,"description":"&quot;In times of universal deceit, telling the truth becomes a revolutionary act.&quot; - George Orwell\r\n\r\nPythagorean Illuminism, the religion of the Illuminati, formally began with the ancient Greek mystic and mathematician Pythagoras and is the world's only &quot;Logos&quot; \r\n\r\nreligion i.e. a rational religion founded on reason, mathematics, science and philosophy. It has no connection with &quot;Mythos&quot; religions such as Judaism, Christianity \r\n\r\nand Islam which are based on faith, superstition, irrationality, stories, parables, myths, legends and &quot;divine revelation&quot;. These religions are wholly false.\r\n\r\nIllumination is the only true religion. It's the Grand Unified Theory of Everything, linking science, religion, psychology, philosophy and even the paranormal. It does \r\n\r\nso via the sole medium of truth and absolute knowledge: mathematics, which Pythagoras declared the arche, the fundamental substance of existence. Ontology and \r\n\r\nepistemology are finally united in the doctrine of &quot;living mathematics&quot;. Mathematics is not a reflection or model of reality. Mathematics IS reality.\r\n\r\nWhereas science is based on &quot;mathematical materialism&quot;, Illumination uses Leibnizian &quot;mathematical idealism&quot;. These are the only two possible accounts of reality. All \r\n\r\nother systems are bogus, worthless and pernicious.\r\n\r\nIn order to follow the one, true religion, you must be smart. Quite simply, the truth is not for everyone. The truth is a function of reason, not faith. All atheists, \r\n\r\nagnostics, skeptics and cynics will find a spiritual home within Illuminism. They are most welcome. &quot;Believers&quot; are not.\r\n\r\nThe Pythagorean Illuminati are the sworn enemies of Abrahamism (the deranged belief system that God would order fathers to kill their children), privileged elites and \r\n\r\nthe infantile legions of conspiracy theorists. Do not read our books if you would be prepared to murder your child if &quot;God&quot; ordered it, or if you believe in shape-\r\n\r\nshifting lizards. Only seekers of true enlightenment will profit from reading our work.\r\n\r\nMike Hockney, Michael Faust and Adam Weishaupt","torrent":{"xt":"urn:btih:e5d9f1b7a73799221c962da572152d991307111f","amp;dn":"Illuminism+of+the+Illuminati+Hockney%2C+Faust+and+Weishaupt","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5d9f1b7a73799221c962da572152d991307111f","infoHashBuffer":{"type":"Buffer","data":[229,217,241,183,167,55,153,34,28,150,45,165,114,21,45,153,19,7,17,31]},"announce":[],"urlList":[]}}