{"title":"Tutorial Cinema 4D Everything Volume 3 - cmiVFX","uid":8480824,"size":1662185591,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e79bc8f71fcb127e4e8a5e277918fe3b967fb659&amp;dn=Tutorial+Cinema+4D+Everything+Volume+3+-+cmiVFX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1368731241,"description":"cmiVFX has released their THIRD video of the C4D EVERYTHING series. Welcome to the final volume of the &quot;C4D EVERYTHING&quot; series. Pavel Zoch herein offers even more methods of modeling and then proceeds deep into UV mesh editing. Then with the help of Arroway Textures he textures, lights and renders the final product.\n\nWhile the hero of this series is a delightful Early Rider wooden child&quot;s bicycle, this is not the point of the teaching here. The overriding thrust of this series is to take an abject beginner in 3d all the way to production quality readiness within Maxon Cinema 4D. Volume three covers the most common modeling pipeline in production. Box modeling and point-to-point modeling are a staple of studios around the world. BUT WAIT, THERE&quot;S MORE!\n\nThe modeling portions of volume 2 and 3 have a running theme, &quot;Model with UV&quot;s in mind&quot;. Whatever modeling technique is taught, each is tweaked to be optimal for the eventuality of UV mesh creation. The larger portion of this lesson aims at UV mesh editing. No matter how good a modeler you are, if you cannot manipulate the UV&quot;s correctly then your texture maps will never look as good as they could. This is NOT a primer on UV&quot;s, but rather a full, deep course. The hero provides the opportunity to teach the solutions to the majority of UV tribulations. The instruction offered in this single volume will enable the viewer to handle the majority of production tasks.","torrent":{"xt":"urn:btih:e79bc8f71fcb127e4e8a5e277918fe3b967fb659","amp;dn":"Tutorial+Cinema+4D+Everything+Volume+3+-+cmiVFX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e79bc8f71fcb127e4e8a5e277918fe3b967fb659","infoHashBuffer":{"type":"Buffer","data":[231,155,200,247,31,203,18,126,78,138,94,39,121,24,254,59,150,127,182,89]},"announce":[],"urlList":[]}}