{"title":"Red (Warren Ellis Minis and Movie Prequels)","uid":6985522,"size":218448725,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:eba7c604cdce5d0c91e5932d2609e31d0755307b&amp;dn=Red+%28Warren+Ellis+Minis+and+Movie+Prequels%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"DrParasite","files":-1,"time":1327555567,"description":"DOWN\nTells the story of an undercover cop, sent on an unofficial mission to deal with a fellow officer who \\&quot;went native\\&quot; when infiltrating a drugs gang.\n\nMEK\nIs a tale of revenge set in a not-too-distant feature, where robotic enhancement has become the latest trend\n\nRELOAD\nIs an espionage thriller that tells the story of Secret Service Agent Chris Royal and his mad scramble to find the woman who assassinated the U.S. President\n\nRED\nBrings us a stark tale of revenge, as retired CIA killer Paul Moses finds himself forced back into the game to gain revenge on the agency that trained him!\n\nRed by Warren Ellis (later turned into the 2010 film of the same name)\nPaul Moses is a retired Agent of the CIA, formerly working in \\&quot;foreign acquisitions\\&quot;. Living in a secluded area, his human contacts are limited to pleasant phone calls to his handler (who desires what she believes to have been Moses\\' type of work) and letters to a niece who lives in England.\n\nMichael Beesley, the newly politically appointed Director of the CIA, is taken to Room R as part of his initiation, where he learns of Moses\\' existence and the full extent of his activities. Disgusted by what he has seen, and fearing public reaction should any of those secrets leak out, he orders the assassination of Moses.\n\nA three man hit-team is sent to Moses\\' residence, and he kills them, recognizing the pattern of the attack and realizing his death has been sanctioned. He calls his handler only to learn that she has been transferred. He informs the Agency that his status has changed from Green to Red before leaving his house and going on the hunt.\n\nEnjoy and seed\t\n\nI did not create any of the files, I am simply compiling them in one easy to find location","torrent":{"xt":"urn:btih:eba7c604cdce5d0c91e5932d2609e31d0755307b","amp;dn":"Red+%28Warren+Ellis+Minis+and+Movie+Prequels%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eba7c604cdce5d0c91e5932d2609e31d0755307b","infoHashBuffer":{"type":"Buffer","data":[235,167,198,4,205,206,93,12,145,229,147,45,38,9,227,29,7,85,48,123]},"announce":[],"urlList":[]}}