{"title":"TrueCrypt 6.1, VLC Media Player 0.9.6 and other useful FREEWARE","uid":4531001,"size":27967869,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ec48fbd37a9fa37cfadf49fadae222d78f850230&amp;dn=TrueCrypt+6.1%2C+VLC+Media+Player+0.9.6+and+other+useful+FREEWARE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"m1r20","files":1,"time":1227554938,"description":"This virus-scanned and clean package consists of:\n\nTrueCrypt 6.1\n**************\na powerful, open-source encryption tool\n\n\nVLC Media Player 0.9.6\n**********************\na highly portable multimedia player for various audio and video formats (MPEG-1, MPEG-2, MPEG-4, DivX, mp3, ogg, ...) as well as DVDs, VCDs, and various streaming protocols. It can also be used as a server to stream in unicast or multicast in IPv4 or IPv6 on a high-bandwidth network. It doesn't need any external codec or program to work.\n\n\nMedia Player Classic 6.4.9.1\n****************************\nlooks just like Windows Media Player 6.4, but has many additional features. It has a built in DVD player with real-time zoom, support for AVI subtitles, QuickTime and RealVideo support; built-in MPEG2/SVCD/DVD codec\n\n\nPeer Guardian 2\n***************\nPeerGuardian 2 is an IP address blocker that can prevent access to thousands of sites. It uses multiple, categorized lists and you can choose which type of site(s) you want to block, including spyware/malware related, advertising related, P2P file sharing related and more. The lists are maintained and updated by a community and you can automatically have the program download the latests lists, and also create your own based on your personal blocking preference. PeerGuardian 2 keeps track of all blocked sites, and you can easily overwrite blocking rules or add new site directly from the log viewer\n\n\nArachnophilia 5.4\n*****************\na Web page development workshop and general programming tool\n\n\nAudiograbber 1.83\n*****************\none of the best tools to rip your audio CD's; menues in: English, Spanish, Italian, French and German\n\n\nScreamer Radio v0.4.3\n*********************\nlisten to radiostations all over the world\n\n\nTrayColor\n*********\npick the right colour for your website\n\n\n...plus a minigame: if you catch all the bottles with the beer box, the girls will strip for you (it helps if you had a few beers first :-))\n\nn-joy, Cheers!","torrent":{"xt":"urn:btih:ec48fbd37a9fa37cfadf49fadae222d78f850230","amp;dn":"TrueCrypt+6.1%2C+VLC+Media+Player+0.9.6+and+other+useful+FREEWARE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec48fbd37a9fa37cfadf49fadae222d78f850230","infoHashBuffer":{"type":"Buffer","data":[236,72,251,211,122,159,163,124,250,223,73,250,218,226,34,215,143,133,2,48]},"announce":[],"urlList":[]}}