{"title":"Stars and Their Purpose - Werner Gitt","uid":11773237,"size":1584808,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed5c5de47b23d5b412adfa5d281407a271837b6f&amp;dn=Stars+and+Their+Purpose+-+Werner+Gitt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427159625,"description":"\n&quot;To my mind, scientific findings and biblical affirmations are inseparable. It is a tragic fact of history that these two approaches have diverged and become separated.&quot; -From the Introduction\n\nDid you know that there are 200 billion stars in our galaxy alone? And that according to current data, there are at least 100 million galaxies in existence? The sheer number of stars in the universe attests to the awesomeness of God's creation. The purpose and features of stars are discussed in this exciting and fascinating book by Dr. Werner Gitt. Learn about topics such as:\nHow are stars different from each other?\nHow big is the universe?\nWhy did God create the stars?\nSurprising facts about the sun and moon.\nHow and when do solar eclipses happen?\n\n\nAbout the author:\nDr. Gitt is an information specialist based in Germany, and is a very popular creationist lecturer around the world. The retired Dr. Gitt was a director and professor at the German Federal Institute of Physics and Technology (Physikalisch-Technische Bundesanstalt, Braunschweig), and the Head of the Department of Information Technology. He is the author of numerous books, including the recently released If Animals Could Talk and In The Beginning Was Information","torrent":{"xt":"urn:btih:ed5c5de47b23d5b412adfa5d281407a271837b6f","amp;dn":"Stars+and+Their+Purpose+-+Werner+Gitt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed5c5de47b23d5b412adfa5d281407a271837b6f","infoHashBuffer":{"type":"Buffer","data":[237,92,93,228,123,35,213,180,18,173,250,93,40,20,7,162,113,131,123,111]},"announce":[],"urlList":[]}}