{"title":"Touch S02E04 HDTV x264 LOL mp4","uid":8179514,"size":290519215,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:edf72f50e0eac10d3613b9080e202a75148ac7a5&amp;dn=Touch+S02E04+HDTV+x264+LOL+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thhaque","files":1,"time":1361596534,"description":"Touch S02E04 HDTV x264 LOL mp4\n\n\nGenre: Drama\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Tim Kring\nCast: Kiefer Sutherland, Judy Echavez, Karen Shenaz David, David Mazouz, Danny Glover, Samantha Whittaker\n\n.: Plot :.\n&quot;Touch&quot; is a preternatural drama where science and spirituality meet in which we are all interconnected. The show follows a group of unrelated characters. One of these is Martin Bohm (Kiefer Sutherland), a widower and a single father who is haunted by an inability to connect to his mute and severely autistic 10-year-old son, Jake. Martin has tried everything he could do in order to reach his son, but at no success. To spend his time, Jake has cast-off cell phones, disassembling them and manipulating the parts. This allows him to see the world in a different way entirely. Martin is visited by social worker Clea Hopkins. She insists on doing an evaluation of the living situation.\n\nClea sees Martin as a man whose life has become dominated by a child he can no longer control. Martin discovers that Jake possesses a gift of staggering genius. That is, the ability to see things that no one else can, the patterns that connect everything to each other. Martin is guided by Boris Podolsky, an aging professor with a compelling but unorthodox theory about Jake. The theory is to join spirituality and science together in one happy medium. Created by Tim Kring. Francis Lawrence (Water for Elephants), &quot;Touch&quot; is an inspiring journey of a father and his love for his son with an unique talent for the world to see.","torrent":{"xt":"urn:btih:edf72f50e0eac10d3613b9080e202a75148ac7a5","amp;dn":"Touch+S02E04+HDTV+x264+LOL+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edf72f50e0eac10d3613b9080e202a75148ac7a5","infoHashBuffer":{"type":"Buffer","data":[237,247,47,80,224,234,193,13,54,19,185,8,14,32,42,117,20,138,199,165]},"announce":[],"urlList":[]}}