{"title":"Scott Thorson - Behind the Candelabra - My Life with Liberace [9","uid":8786744,"size":393939773,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ee8a1023f55b59ba346cbe8ba647595d6490a40f&amp;dn=Scott+Thorson+-+Behind+the+Candelabra+-+My+Life+with+Liberace+%5B9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1375844836,"description":"Scott Thorson, Alex Thorleifson - Behind the Candelabra: My Life with Liberace\n\n96 kbps, Unabridged, Read by Peter Berkrot\n &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/behind-the-candelabra-scott-thorson/1114675151?ean=9780988349483&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/behind-the-candelabra-scott-thorson/1114675151?ean=9780988349483&lt;/a&gt;\n\nOverview\nIn this unusually frank book Scott Thorson tells all: the good, the bad, and the ugly truths about a legendary entertainer who went to outrageous extremes to prevent public knowledge of his homosexuality. Liberace's unhappy childhood, dominated by a mother determined to force him into a concert career, serves as the prologue for a story that goes on to detail Liberace s early appearances in honky-tonks, his move to New York to seek fame, and, finally, his first booking in Las Vegas, where he was courted by the Mafia. His successes create a bright counterpoint to a darker tale of a man hungry for power, given to every excess. Liberace's credo &quot;too much of a good thing is wonderful&quot; is reflected here in his acquisition of new lovers, luxurious homes, a large collection of pornography, and a total of twenty-six house dogs. Behind the Candelabra also reveals the details of the fundamentally tender love affair between Liberace and Thorson whom Liberace sent to his own plastic surgeon to have his face remodeled in Liberace's own image! This fast-paced story, sprinkled with anecdotes about famous entertainers such as Michael Jackson and Shirley MacLaine, ends with an intimate look at Liberace's final days as he lay dying of AIDS and his deathbed reconciliation with Scott.\n\nEditorial Reviews\nPublishers Weekly - Publisher's Weekly\nIn 1977, the 18-year-old Thorson became ``lover, friend and confidant'' of the 57-year-old Liberace, a relationship that would continue until 1982. Here, with Thorleifson (coauthor of John Wayne) he relates the sorry, seamy tale of his ``callous'' eviction from the performer's Las Vegas penthouse in favor of a teenager and the public brouhaha that followed when he filed a palimony suit. The book is uncomfortably candid with revelations about ``Lee''who was driven to experience sexual variety with younger males, even as he continued to publicly deny his homosexualityand Thorson's protestations that he was unfairly branded a street hustler by the tabloid press. Although the acrimonious suit was ultimately settled (the provisions were kept secret), Thorson notes that he has written this memoir because &quot;I need the money.&quot; His bitterness at Liberace, who died of AIDS in 1987, lessens at the end of the book, and with back-handed gratitude he concludes: &quot;Leaving Lee . . . may have saved my life.&quot;","torrent":{"xt":"urn:btih:ee8a1023f55b59ba346cbe8ba647595d6490a40f","amp;dn":"Scott+Thorson+-+Behind+the+Candelabra+-+My+Life+with+Liberace+%5B9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee8a1023f55b59ba346cbe8ba647595d6490a40f","infoHashBuffer":{"type":"Buffer","data":[238,138,16,35,245,91,89,186,52,108,190,139,166,71,89,93,100,144,164,15]},"announce":[],"urlList":[]}}