{"title":"Eugene Peterson - Take and Read: Spiritual Reading (epub, mobi)","uid":8794164,"size":4257580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f02193eb325bb18675270a7b6177c9b2b4ad8bbd&amp;dn=Eugene+Peterson+-+Take+and+Read%3A+Spiritual+Reading+%28epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1376029390,"description":"Eugene H. Peterson - Take and Read: Spiritual Reading - an Annotated List (Eerdmans, 1995).\n\nEpub and mobi formats; not retail quality, but is quite readable.\n\n\nBasically this is a long book list (with brief discussion) of some of Peterson's favorite books, and he has excellent taste. A great resource for discovering books that will often be new to you.\n\n\ndescription:\n\nSpiritual reading has fallen on bad times. Today, reading is largely a consumer activity, done for information that may fuel ambitions or careers - and the faster the better. Take and Read represents Eugene H. Peterson's attempt to rekindle the activity of spiritual reading, reading that considers any book that comes to hand in a spiritual way, tuned to the Spirit, alert to intimations of God. Take and Read provides an annotated list of the books that have stood the test of time and that, for Peterson, are spiritually formative in the Christian life. The books on this list range from standard spiritual classics to novels, poems, and mysteries, and include an equally broad spectrum of authors - from Augustine and C. S. Lewis to William Faulkner and Fyodor Dostoyevsky. Annotations following each entry offer Peterson's own significant insights into the power of each work.\n","torrent":{"xt":"urn:btih:f02193eb325bb18675270a7b6177c9b2b4ad8bbd","amp;dn":"Eugene+Peterson+-+Take+and+Read%3A+Spiritual+Reading+%28epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f02193eb325bb18675270a7b6177c9b2b4ad8bbd","infoHashBuffer":{"type":"Buffer","data":[240,33,147,235,50,91,177,134,117,39,10,123,97,119,201,178,180,173,139,189]},"announce":[],"urlList":[]}}