{"title":"Londres Distrito Criminal 1x01 HDTV DVB Spanish","uid":5575481,"size":419588592,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f114655005d9b6148d9497df3ea2c12980bbcda2&amp;dn=Londres+Distrito+Criminal+1x01+HDTV+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":1,"time":1274373049,"description":"Un elenco de carismÃƒÂ¡ticos y reconocidos actores britÃƒÂ¡nicos se han reunido en torno a Londres: Distrito Criminal, serie producida por el dos veces ganador de un Globo de Oro Dick Wolf, junto a Kudos Film and TelevisiÃƒÂ³n, WolfFilms y NBC Universal.\n\nLondres: Distrito Criminal sigue el trabajo de un grupo de policÃƒÂ­as y fiscales de Londres: mientras los primeros investigan todo tipo de delitos y tratan de encontrar a los culpables, sus compaÃƒÂ±eros en los tribunales se encargan de procesarlos en el juicio, tratando de someterlos a todo el peso de la justicia.\n\nBradley Walsh es el detective Ronnie Brooks, que vive en el East End londinense, amigo y compaÃƒÂ±ero del encantador detective Matt Devlin (Jamie Bamber, GalÃƒÂ¡ctica: Estrella de combate), quien para su labor como policÃƒÂ­a se sirve tanto de la fuerza como de la seducciÃƒÂ³n. Natalie Chandler, jefa de ambos, interpretada por Harriet Walter (Morris: A Life With Bells On, Broken Lines, ExpiaciÃƒÂ³n) es una madre trabajadora que respalda a su equipo hasta el final.\n\nPor su parte, el equipo de la FiscalÃƒÂ­a General del Estado (el CPS) estÃƒÂ¡ liderado por Ben Daniels (The Passion, Cutting It) como James Steel, el dedicado Fiscal de la Corona cuya misiÃƒÂ³n es honrar a la justicia; Freema Agyeman (Torchwood, Dr Who) interpreta a la joven, voluntariosa y dedicada abogada Alesha Phillips, y Bill Paterson (La pequeÃƒÂ±a Dorrit) como George Castle, el respetado jefe de todos ellos y Director de la Oficina de Procesamiento en Londres, que trata de conciliar sus ideales personales con las distintas situaciones y casos que tiene que resolver.\n\nEsta serie comienza en su primer capÃƒÂ­tulo con un cuerpo encontrado en un hospital de Londres, que los detectives Ronnie Brooks y Matt Devlin deberÃƒÂ¡n investigar. Ã‚Â¿Pero podrÃƒÂ¡n despuÃƒÂ©s los fiscales James Steel y Alesha Phillips someter a los criminales al peso de la justicia?","torrent":{"xt":"urn:btih:f114655005d9b6148d9497df3ea2c12980bbcda2","amp;dn":"Londres+Distrito+Criminal+1x01+HDTV+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f114655005d9b6148d9497df3ea2c12980bbcda2","infoHashBuffer":{"type":"Buffer","data":[241,20,101,80,5,217,182,20,141,148,151,223,62,162,193,41,128,187,205,162]},"announce":[],"urlList":[]}}