{"title":"Led Zeppelin 1975-02-12 Madison Square Garden, New York City","uid":8933171,"size":1016166838,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f2e275de4fe7a923db66b1950e0de6ff87a3a96f&amp;dn=Led+Zeppelin+1975-02-12+Madison+Square+Garden%2C+New+York+City&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TUFF_GONG","files":19,"time":1379499943,"description":" &lt;a href=&quot;http://veryrare.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://veryrare.org&lt;/a&gt;\n\nLed Zeppelin - &quot;Physical Riffiti&quot;\nFebruary, 12th, 1975, New York City, New York, Madison Square Garden\nRemastered Soundboard Recording, (A Group/Personal Project)\nLineage: &quot;Flying Circus&quot;, (EVSD), Silvers &gt; EAC &gt; WAV &gt; Flac &gt; TLH, Decode &gt; WAV &gt; Remaster &gt; Flac (Level.8, Align On SBE'S) &gt; Flac (All Tracks Tested With TLH, No Errors Occured)\nLabel: N/A\nOriginal Taper: N/A\n\nThis is A Group/Personal Project by &quot;The Masters Of The Mix Tape&quot;, The 7th Son, Joel, Mike, and Acapulco Gold.\n\nWe hope that whoever picks this up will enjoy this, and will pass it along, and share it with others, or just pass, the choice is yours.\n\nThis is not meant to be a &quot;Definitive&quot; edition.\n\nCheers and thanks go out to:\n\n- The taper of the soundboard source, and the tapers of the 2 audience recordings of this performance (R.I.P Jerry Moore) for taping and sharing their sources with the community. If you're out there, and happen to pick this up, we hope you'll enjoy the work we've done.\n\n- The original uploader of the soundboard tape used in this project, I apologize for forgetting your name, it is not intentional.\n\n\nDisc One:\n\n1) Introduction (Fades In)\n2) Rock And Roll\n3) Sick Again\n4) Over The Hills And Far Away\n5) In My Time Of Dying\n6) The Song Remains The Same\n7) The Rain Song\n8) Kashmir (Fades Out)\n\nDisc Two:\n\n1) No Quarter (Fades In)\n2) Trampled Underfoot\n3) Moby Dick (Fades Out)\n\nDisc Three:\n\n1) Dazed And Confused (Fades In, Includes: &quot;San Francisco&quot;, and &quot;Walter's Walk&quot;)\n2) Stairway To Heaven\n3) Whole Lotta Love\n4) Black Dog\n5) Heartbreaker (Includes: &quot;That's Alright Mama&quot;)\n\nNotes:\n\nOne of the best, and most popular Led Zeppelin shows of not only the 1975 U.S tour, but of their careers.\n\nThis show is considered to be the &quot;turning point&quot; of the U.S 75 tour, the time when the band shake of their ailments (Plant was suffering from the flu, and Jimmy had injured his finger) and start to play at their best again.\n\nI personally think the band turned themselves around when they hit Philadelphia (2-8-75), but that's just my opinion on that issue. \n\nReview about this performance from Argenteumastrum.com:\n\n&quot;A great show! It may have been a blizzard outside but the Garden was rocking this night! \n&quot;We came four blocks in the snow to get here ... you realise that? People were calling me on the telephone today and saying 'Is it gonna be on?' For a minute I was wondering about my anatomy, then I realised there was some discrepancy about the weather. Isn't it good though that it snows? Doesn't it change the vibe of the city? I think it's great!&quot; \nThe band is in excellent form and delivers a great show. \nRobert sounds good and strong, Jonesy and Bonzo are amazing as always, and Jimmy is incendiary tonight, especially at the end of Sick Again. \nHe extends the solo in Over The Hills And Far Away to an incredible length and soars. No Quarter is dedicated to Jones that &quot;...made Monthy Python's Flying Circus a flop in New York&quot; tonight and his imppecably clean fingernails. \nMoby Dick is like a hurricane and Dazed And Confused just blows everybody out to the cosmic level! A bunch of heavy solid encores with an excellent Heartbreaker with some lyrics of Elvis Presley's That's Alright Mama thrown in closing this amazing eveing. \nThis is definitely a triumph for the entire band and, not only a strong concert but also probably the best from the 1975 US Tour. \n&quot;Ladies and gentlemen of New York ... you're too much ... and we ain't so bad ourselves!&quot; and the show was over.\n\nThe goal of this project:\n\nEver since the discovery of this soundboard tape, numerous releases of it have surfaced.\n\nSoundboard remasters (both boot label and fan made), Soundboard + Audience recording merges, Soundboard + Audience Recording Matrixes (&quot;4 Blocks In The Snow&quot;) were released, some are definate upgrades, and some were quite disappointing, but alot of people threw their hats into the ring and put their spin on this show, trying to cover it from all spectrums and angles, and corner the market on it.\n\nWe thought about this when we decided to work on this recording, and we decided to just try and have fun working on this tape, put our spin on it, and try and breathe some new life into it.\n\nOriginally we thought about working on the audience tapes of this show instead of releasing another soundboard remaster because we actually prefer audience recordings to soundboards most of the time.\n\nA soundboard can be as good, and as different as an audience recording, but alot of them do suffer from being quite flat and stale sounding.\n\nI hate it when a soundboard tape has no traces of an audience being there, sure you can hear all the instruments with clarity, but no presence of an audience really defeats the purpose of a live recording.\n\nThere were traces of the audience on this tape, but they could've been brought out just a little more, so we've tried to bring out the audience for the listener, and give them a sense of the venue and live concert experience.\n\nIn regards to the title:\n\nWe had the title idea &quot;Physical Riffiti&quot; kicking around for sometime, I don't rememeber how we exactly came up with it, but we thought it sounded clever, and we were just waiting for the right show to use it, and this one seemed right because it's very heavy on guitar work and riffing from Jimmy.\n\nHope everyone here will enjoy this.\n\nCheers!\n\n\n  &lt;a href=&quot;\nhttp://veryrare.org/_ld/1/13209188.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://veryrare.org/_ld/1/13209188.png&lt;/a&gt;","torrent":{"xt":"urn:btih:f2e275de4fe7a923db66b1950e0de6ff87a3a96f","amp;dn":"Led+Zeppelin+1975-02-12+Madison+Square+Garden%2C+New+York+City","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2e275de4fe7a923db66b1950e0de6ff87a3a96f","infoHashBuffer":{"type":"Buffer","data":[242,226,117,222,79,231,169,35,219,102,177,149,14,13,230,255,135,163,169,111]},"announce":[],"urlList":[]}}