{"title":"James Foley censored Muammar Gaddafi report (Oct. 20, 2011)","uid":10863412,"size":24982650,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f41137eec80a89939ff72778703cdb025e3542f5&amp;dn=James+Foley+censored+Muammar+Gaddafi+report+%28Oct.+20%2C+2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cockymountainoyster","files":-1,"time":1408899976,"description":"Did you know that the recently beheaded journalist, James Foley, was present during Muammar Gaddafi's last moments after being captured? He is the one who obtained the footage from the rebels, which shows that they sodomized him with a sharp stick or knife, and tortured him to death.\n\nHere are some very odd facts about reporter James Foley, and his alleged death.\n\n- Was taken prisoner in Libya, by Gaddafi forces, in April 2011, a month after the NATO bombing campaign started, and was released 44 days later, only to immediately return, to be present, and report on the capture and subsequent murder of Muammar Gaddafi, for globalpost. \n\n- Was taken prisoner in Syria, by mercenary 'rebel' forces, November 22, 2012, in northwestern Syria, again while working for globalpost. \n\n- A ransom was demanded from James' family in 2013 by e-mail, in which the alleged perpetrators did not accept Â£3 million British pounds that had been raised for his release.\n\n- The 6th e-mail sent to James' family, August 12th, 2014, stated that James would be killed because of American bombings of ISIS positions in Iraq.\n\n- August 19th, 2014, a video purporting to be James' final moments, and execution, is uploaded to YouTube.\n\n- The video is subsequently blocked, with user accounts being deleted, from both YouTube, Twitter. They're hiding something. Hundreds of other ISIS videos showing very graphic beheading of Syrians and Iraqis second by second were never censored like this.\n\n- There are several unnecessary video cuts, including the omission of the beheading itself!\n\n- The video of the alleged corpse on the ground, has a serious anomaly on the back of the body, suggesting that someone is tucking their head in the sand.\n\n- The head alleged to be James Foley's head, looks more like a latex mold, with blood smeared on it, to hide the defects.\n\n- The body of the alleged corpse, has no hair on the arms or legs, and looks like it might \n\nbe someone else, maybe even a woman. And who rolls up the sleeves of their murder-victims before recording the scene?\n\n- The video is being used as a cassus-belli for the planned bombing campaign of Syria.\n\n- UK police suggest that &quot;Merely Watching James Foley Beheading Video May Be an Act of Terrorism&quot;\n\n- The journalist James Foley was a propagandist for the Free Syrian Army. In that he had joined important U.S. politicians. The FSA terrorists were trained by the U.S. and then converted to ISIS which the U.S. now claims to fight. The U.S. is still giving rocket launchers and TOWs to FSA gangs, aka soon-to-be-ISIS followers.\n\nSee for yourself what Hollywood propaganda is made of these days, far beyond nazi shrunken heads, tanned humanskin lampshades, soaps, and a bunch of lice that survived the delousing chambers, only to infest Palestine!\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10830699/James_Foley_beheaded_journalist.mp4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10830699/James_Foley_beheaded_journalist.mp4&lt;/a&gt;\n\n~GR","torrent":{"xt":"urn:btih:f41137eec80a89939ff72778703cdb025e3542f5","amp;dn":"James+Foley+censored+Muammar+Gaddafi+report+%28Oct.+20%2C+2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f41137eec80a89939ff72778703cdb025e3542f5","infoHashBuffer":{"type":"Buffer","data":[244,17,55,238,200,10,137,147,159,247,39,120,112,60,219,2,94,53,66,245]},"announce":[],"urlList":[]}}