{"title":"Cyber Update Mar.2010--------DB-8160  Katie Summers Seda-Isi","uid":5420345,"size":611207103,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f45f7088b721adea3479d85b6fe7286b9f627d43&amp;dn=Cyber+Update+Mar.2010--------DB-8160++Katie+Summers+Seda-Isi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":105,"time":1268066682,"description":"From Kink.com   ( Device Bondage )  + Pics\n\n\n\nLive Show Mondays brings you the conclusion of the January live show that featured Katie Summers, Seda, and co-top Isis Love.\n\nThe first thing that happens during one of these kinds of shoots is someone posts a comment that basically says this: &quot;Why did you put their heads in a box? They are so pretty and now I can't see their facial expressions.&quot; Most aren't this polite but you get the point. Let me answer that question. The fact that they are pretty is one reason. Take a way the girl's &quot;armor,&quot; her looks, and you will suddenly see a change in personality. They are no longer as confident, they are a touch humiliated, and they become more submissive as they have lost their greatest weapon against you. The second reason is simple, it's a great device that takes away the ability to hear and see, in other words they have no idea what is going to happen to them next and this is very unsettling.\n\nSo there they are helpless, legs spread and deprived of most sight and sound. So the cane comes out and the screaming starts, the flogger hits shaved pussy after shaved pussy. Then we attack them sexually, we make them both squirt and we make them cum over and over and over. Isis love FISTS both girls to many hard helpless orgasms. These girls are ravaged like they have never been ravaged before, and they cum out smiling, exhausted and wrecked. The January live show is over and two people need a nap.\n\n\n\nScreens &lt;a href=&quot; http://www.devicebondage.com/site/shoot.jsp?shootId=8160&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.devicebondage.com/site/shoot.jsp?shootId=8160&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:f45f7088b721adea3479d85b6fe7286b9f627d43","amp;dn":"Cyber+Update+Mar.2010--------DB-8160++Katie+Summers+Seda-Isi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f45f7088b721adea3479d85b6fe7286b9f627d43","infoHashBuffer":{"type":"Buffer","data":[244,95,112,136,183,33,173,234,52,121,216,91,111,231,40,107,159,98,125,67]},"announce":[],"urlList":[]}}