{"title":"Brick (2005) DVD9 NTSC (WS)[hjsn1]","uid":5523256,"size":7904217088,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f4bcfd9039b5b2bf91992d50932ce2a62f162493&amp;dn=Brick+%282005%29+DVD9+NTSC+%28WS%29%5Bhjsn1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hjsn1","files":33,"time":1272696579,"description":"                  @@@   @@@@@@    @@@@@@    @@@@@@   @@@  @@@  \n                  @@@  @@@@@@@@  @@@@@@@   @@@@@@@@  @@@@ @@@  \n                  @@!  @@!  @@@  !@@       @@!  @@@  @@!@!@@@  \n                  !@!  !@!  @!@  !@!       !@!  @!@  !@!!@!@!  \n                  !!@  @!@!@!@!  !!@@!!    @!@  !@!  @!@ !!@!  \n                  !!!  !!!@!!!!   !!@!!!   !@!  !!!  !@!  !!!\n                  !!:  !!:  !!!       !:!  !!:  !!!  !!:  !!!  \n             !!:  :!:  :!:  !:!      !:!   :!:  !:!  :!:  !:!  \n             ::: : ::  ::   :::  :::: ::   ::::: ::   ::   ::  \n              : :::     :   : :  :: : :     : :  :   ::    :   \n                                                  \n\n\n                              Movie Information\n                   &lt;a href=&quot; http://www.imdb.com/title/tt0393109/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0393109/&lt;/a&gt;\n\nA tough-talking teen attempts to uncover his ex-girlfriend's killer in director Rian Johnson's hard-boiled high-school noir, told in the style of a Dashiell Hammett mystery. An outsider by nature, Brendan (Joseph Gordon-Levitt) is forced to penetrate the elaborate ranks of the high-school social scene and its more insidious underbelly when the body of his former girlfriend Emily is found lying lifeless in a remote creek. Though the pair had been on the outs, Brendan can't seem to shake the hysterical phone call that he received from Emily the day before her body was discovered, a call in which she rattled off a number of cryptic words: &quot;brick,&quot; &quot;pin,&quot; &quot;tug,&quot; &quot;poor Frisco.&quot; He's determined to find the guilty party, and to do that he'll need to uncover the meaning behind her enigmatic phone call. From the highest-ranking athlete to the lowest-level burnout, no one is above suspicion of leaving her in that creek or putting her in the position to end up there. Brendan's skill for getting the right attention from the right people leads him to a local drug dealer of urban-legendary status (Lukas Haas), who walks with a cane and lives with his mother. As Brendan infiltrates the social and political web more deeply, his theory solidifies and each player's role becomes clear, from the shifty-eyed pot slinger to an upper-crust innocent who may well be a femme fatale. Brendan may soon be ready to make his case, even if it's too late for him to get out.\n\n                                Mpaa Rating++++++++++\n\n                         Rated R for violent and drug content\n\n\n                                Retail Release Date++++++++\n\n                        7 April 2006\n\n                                DVD Content++++++++++\n\n                             \n                 Main Movie+++++++++++++++\n\t              +Video- Untouched\n\t              +Audio-English, English-directors comments\n                          +Subs-English, Spanish, French\n\n\n                 Menu+++++++\n\t              +Yes\t\n              \n                 Extras/Special Features+++++\n\t              +Yes\n\n                 Removed++++++++++++++\n\t              FBI crap and trailers and all of the other annoying and useless stuff.\n\n\n\n                 Chapters++++++++++++++\nN/A\n\nUploader Info ***: Thank you for choosing my release from others that are available on the internet already. I wanted to ask a small favor. After you have completely downloaded my release, please return back where you downloaded the movie and leave a comment. Let me know how the movie quality is &amp; give others who are going to be downloading my release better information about the upload. I actually do check the comments and I try to respond as much as possible.\nAlso DO NOT COMMENT OR PRIVATE MESSAGE asking me to upload a movie that is going to be released on DVD in the upcoming week or month. Feel free to comment and leave requests for older movies or movies that have been out for a while. I am going to upload movies that I feel people will enjoy so if you have a movie you want me to upload that I haven't done yet, comment and i'll check it. Upload information is available to you @ torrentbucket.info. I am helping djfred keep up with you guys. The site is updated almost every week. He has movies listed on the site for up to a month in advance. If you truly love this DVD, do actually buy and support the producers, writers, actors who made this movie possible. Thank You [J]  \n\n\n\n\nLinks ***********: Here are many of djfreds tutorials, Enjoy. \n\n**DVD Ripping (how to: advanced) \n\n**Rip DVD9 to DVD5 with CloneDVD2 \n\n**Rip with DVDShrink \n\n**Burn Video_TS files with NERO \n\n**Watch DVD Files with VLC Player \n\nLet him know how you like his tutorials! &lt;a href=&quot; http://torrentbucket.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://torrentbucket.com/&lt;/a&gt;\n\nDVD Release Dates. &lt;a href=&quot; http://torrentbucket.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://torrentbucket.com/&lt;/a&gt; \n\nFor Mac Users who cant burn &amp; get CSS Error &lt;a href=&quot; http://forum.videohelp.com/topic340322.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://forum.videohelp.com/topic340322.html&lt;/a&gt;\n\n\nPEOPLE WHO DOWNLOAD TORRENTS FROM DJFRED AND MYSELF, PLEASE SEED EVEN AFTER THEY ARE DONE DOWNLOADING. THAT WAY WE WILL BE ABLE TO GET MORE MOVIES UP. WHO KNOWS, THE NEXT ONE WE PUT UP MIGHT BE A REQUEST OF YOURS.\nBrick (1997) DVD-9 NTSC (WS) [hjsn1]\n","torrent":{"xt":"urn:btih:f4bcfd9039b5b2bf91992d50932ce2a62f162493","amp;dn":"Brick+%282005%29+DVD9+NTSC+%28WS%29%5Bhjsn1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4bcfd9039b5b2bf91992d50932ce2a62f162493","infoHashBuffer":{"type":"Buffer","data":[244,188,253,144,57,181,178,191,145,153,45,80,147,44,226,166,47,22,36,147]},"announce":[],"urlList":[]}}