{"title":"Triple Feature 3D IMAX 3D (2010) [To TV USB 1080p]","uid":6060858,"size":12876118033,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:f584bff59ac9d9091d8899c94a41f26a53ad16ac&amp;dn=Triple+Feature+3D+IMAX+3D+%282010%29+%5BTo+TV+USB+1080p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"webchella","files":-1,"time":1293115764,"description":"Triple Feature 3D IMAX 3D (2010) [To TV USB 1080p]\n &lt;a href=&quot;\nhttp://www.blu-ray.com/movies/Samsung-Presents-IMAX-3D-Triple-Feature-Blu-ray/16085/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.blu-ray.com/movies/Samsung-Presents-IMAX-3D-Triple-Feature-Blu-ray/16085/&lt;/a&gt;\n\n===========\n::English::\n===========\nOriginal title: Triple IMAX 3D feature\nLanguage: English, Spanish\nYear: 2010\nLength 120 mins.\nGenre: Documentary\n\nSynopsis:\n-------------\nGalapagos\nFilmed at the famed archipelago and surrounding waters, Galapagos follows marine biologist Dr. Carole Baldwin as the company makes its initial review that the first world to science for 160 years before Charles Darwin. The tools for Baldwin's team Are Far Different Than Darwin Used anything, yet one thing is Unchanged. The tools for the Baldwin team are very different than anything Darwin used, however, one thing has not changed. The Galapagos Islands a stunningly Remain Abundant laboratory for exploration. The Galapagos Islands are still an incredibly rich laboratory for exploration.\n\nIn the background:\nKate Nelligan narrates and renowned marine life filmmaker Howard Hall directs this colorful foray in kelp forests located off the California Channel Islands.\n\nMummies:\nSecret of the Pharaohs: unraveling the human time involved capsules have become a fascinating mystery to most of our time - the mummies of Egypt. Probe to uncover ancient tombs These Carefully hidden phenomena, and experience the dramatic adventure of Their Excavations. Probe to discover ancient tombs these phenomena carefully hidden, and experience the adventure drama of their excavations. Follow top scientists as They Embark on a modern-day forensic investigation of the mummies, extracting clues from Our Past That Could Have an Enormous Impact on medical science in our future. Follow the principal scientists embark on a modern forensic investigation of the mummies, the extraction of tracks from our past that could have a huge impact on medical science in our future.\n\n\nGeneral:\n--------------\nFormat: Matroska\nDuration: 34min.\nTotal bit rate: 17.6 Mbps\nDate code: 18/10/2010 17:42:43 UTC\nCodificiÃƒÂ³n application: mkvmerge v4.1.1 ('Bouncin' Back ')\nEncoding library: libebml libmatroska v1.0.0 + v1.0.0\n===========\n::Spanish::\n===========\nTitulo Original: IMAX Triple feature 3D\nIdioma: Ingles, EspaÃƒÂ±ol\nAÃƒÂ±o: 2010\nDuracion 120 mins.\nGenero: Documental\n\nSipnosis: \n-------------\nGalÃƒÂ¡pagos: \nFilmado en el famoso archipiÃƒÂ©lago y sus aguas circundantes, GalÃƒÂ¡pagos sigue el biÃƒÂ³logo marino Dra. Carole Baldwin como lo hace su empresa inicial en que la crÃƒÂ³nica del primer mundo para la ciencia 160 aÃƒÂ±os antes por Charles Darwin. The tools for Baldwin's team are far different than anything Darwin used, yet one thing is unchanged. Las herramientas para el equipo de Baldwin son muy diferentes que nada Darwin utilizÃƒÂ³, sin embargo, una cosa no ha cambiado. The Galapagos Islands remain a stunningly abundant laboratory for exploration. Las Islas GalÃƒÂ¡pagos siguen siendo un laboratorio increÃƒÂ­blemente abundantes para la exploraciÃƒÂ³n.\n\nEn el fondo: \nKate Nelligan narra y reconocidos de la vida marina cineasta Howard Hall dirige esta incursiÃƒÂ³n de colores en los bosques de algas ubicado a la salida de las Islas del Canal de California. \n\nMomias: \nSecreto de los Faraones: desentraÃƒÂ±ar el tiempo envuelto cÃƒÂ¡psulas humanos que se han convertido en el fascinante misterio de la mayor parte de nuestro tiempo - de las momias de Egipto. Probe ancient tombs to uncover these carefully hidden phenomena, and experience the dramatic adventure of their excavations. Sonda tumbas antiguas para descubrir estos fenÃƒÂ³menos cuidadosamente ocultos, y la experiencia de la aventura dramÃƒÂ¡tica de sus excavaciones. Follow top scientists as they embark on a modern-day forensic investigation of the mummies, extracting clues from our past that could have an enormous impact on medical science in our future. Siga los principales cientÃƒÂ­ficos que se embarcan en una investigaciÃƒÂ³n forense moderna de las momias, la extracciÃƒÂ³n de pistas de nuestro pasado que podrÃƒÂ­a tener un enorme impacto en la ciencia mÃƒÂ©dica en nuestro futuro. \n\n\nGeneral:\n--------------\nFormato: Matroska\nDuraciÃƒÂ³n: 34min.\nTasa de bits total: 17,6Mbps\nFecha de codificaciÃƒÂ³n: UTC 2010-10-18 17:42:43\nAplicaciÃƒÂ³n de codificiÃƒÂ³n: mkvmerge v4.1.1 ('Bouncin' Back')\nLibrerÃƒÂ­a de codificaciÃƒÂ³n: libebml v1.0.0 + libmatroska v1.0.0","torrent":{"xt":"urn:btih:f584bff59ac9d9091d8899c94a41f26a53ad16ac","amp;dn":"Triple+Feature+3D+IMAX+3D+%282010%29+%5BTo+TV+USB+1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f584bff59ac9d9091d8899c94a41f26a53ad16ac","infoHashBuffer":{"type":"Buffer","data":[245,132,191,245,154,201,217,9,29,136,153,201,74,65,242,106,83,173,22,172]},"announce":[],"urlList":[]}}