{"title":"BATMAN-THE BRAVE AND THE BOLD-VOL 1[ANIMATED] XVID BY WINKER","uid":5705016,"size":1054447216,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f5ac74ba417adfc526ef5105bd773d49f7d94056&amp;dn=BATMAN-THE+BRAVE+AND+THE+BOLD-VOL+1%5BANIMATED%5D+XVID+BY+WINKER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alanwatson","files":3,"time":1279660118,"description":"DVD Description\nBatman isn't going at it alone this time! From Warner Bros. Animation comes the latest interpretation of the classic Batman franchise. Our caped crusader is teamed up with heroes from across the DC Universe, delivering nonstop action and adventure with a touch of comic relief. Blue Beetle, Green Arrow, Aquaman and countless others will get a chance to uphold justice alongside Batman. Though still based in Gotham, Batman will frequently find himself outside city limits, facing situations that are both unfamiliar and exhilarating. With formidable foes around every corner, Batman will still rely on his stealth, resourcefulness and limitless supply of cool gadgets to bring justice home.\n\n\n\nSynopsis\nIn this animated spin-off of the BATMAN series, the caped crusader joins forces with a variety of heroes from across the DC Comics universe, in his never-ending quest to keep Gotham City and its surrounding areas free from crime. But with formidable foes around every corner, Batman must rely on his stealth, resourcefulness, and limitless supply of cool gadgets to bring justice home. This first volume comprises four action-packed episodes.","torrent":{"xt":"urn:btih:f5ac74ba417adfc526ef5105bd773d49f7d94056","amp;dn":"BATMAN-THE+BRAVE+AND+THE+BOLD-VOL+1%5BANIMATED%5D+XVID+BY+WINKER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5ac74ba417adfc526ef5105bd773d49f7d94056","infoHashBuffer":{"type":"Buffer","data":[245,172,116,186,65,122,223,197,38,239,81,5,189,119,61,73,247,217,64,86]},"announce":[],"urlList":[]}}