{"title":"The Big Bang Theory Seasons 1-7 iTunes HD","uid":10632499,"size":83767741914,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f683264d0ad3d6bb74713e8513d790de6e2e5892&amp;dn=The+Big+Bang+Theory+Seasons+1-7+iTunes+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"llibtj","files":-1,"time":1406341298,"description":"Title:\nThe Big Bang Theory Season 1-7 (2007-2014)\n \nInfo:\nMeta-data already fixed to look like iTunes-purchased media complete with artwork and description for each episode and all so it will look beautiful on your media viewer.\n\nIn M4V format and compatible with almost all consumer devices including Apple TV, iPhone/iPad/iPod touch, PS3, Xbox 360, Xbox One, and PS4.\n\nSeasons 1-6 are in 720p HD format while Season 7 is in 1080p HD.\n\n\nDescription:\nLeonard Hofstadter and Sheldon Cooper are both brilliant physicists working at Caltech in Pasadena, California. They are colleagues, best friends, and roommates, although in all capacities their relationship is always tested primarily by Sheldon's regimented, deeply eccentric, and non-conventional ways. They are also friends with their Caltech colleagues mechanical engineer Howard Wolowitz and astrophysicist Rajesh Koothrappali. The foursome spend their time working on their individual work projects, playing video games, watching science-fiction movies, or reading comic books. As they are self-professed nerds, all have little or no luck with popular women. When Penny, a pretty woman and an aspiring actress originally from Omaha, moves into the apartment across the hall from Leonard and Sheldon's, Leonard has another aspiration in life, namely to get Penny to be his girlfriend.\n\nTaglines: When beauty meets the brains\n\nTV-14 Rating\n\nMy take:\nThis is a great show! One of the best written TV sitcoms, go download it before Season 8 comes out and catch up!\n\n\nP.S.\nAlso going to be uploading a lot more of these TV shows with metadata patched specifically for iTunes and/or M4V format. These torrents will usually not originally be mine but they will be fixed or re-encoded versions for Apple devices.","torrent":{"xt":"urn:btih:f683264d0ad3d6bb74713e8513d790de6e2e5892","amp;dn":"The+Big+Bang+Theory+Seasons+1-7+iTunes+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f683264d0ad3d6bb74713e8513d790de6e2e5892","infoHashBuffer":{"type":"Buffer","data":[246,131,38,77,10,211,214,187,116,113,62,133,19,215,144,222,110,46,88,146]},"announce":[],"urlList":[]}}