{"title":"Day [in 1967] Israel Attacked America, Killed... - Aljazeera","uid":11574065,"size":300452868,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f69029020a5f5a8cf23a4ccb9564890cb9a34bf6&amp;dn=Day+%5Bin+1967%5D+Israel+Attacked+America%2C+Killed...+-+Aljazeera&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":2,"time":1417058193,"description":"The Day Israel Attacked America\n\nAl Jazeera investigates the shocking truth behind a deadly Israeli attack on a US naval vessel.\n\nSpecial programme Last updated: 30 Oct 2014 20:22\n\nIn 1967, at the height of the Arab-Israeli Six-Day War, the Israeli Air Force launched an unprovoked attack on the USS Liberty, a US Navy spy ship that was monitoring the conflict from the safety of international waters in the Mediterranean.\n\nIsraeli jet fighters hit the vessel with rockets, cannon fire and napalm, before three Israeli torpedo boats moved in to launch a second more devastating attack. Though she did not sink, the Liberty was badly damaged. Thirty-four US servicemen and civilian analysts were killed, another 171 were wounded.\n\nLater Israel apologised for what it claimed to be a tragic case of mistaken identity. It said that it had believed the ship to be hostile Egyptian naval vessel. US President Lyndon Johnson was privately furious but publicly the White House chose not to challenge the word of its closest Middle East ally and accepted that the attack had been a catastrophic accident.\n\nHowever, as this exclusive Al Jazeera investigation reveals, fresh evidence throws new light on exactly what happened that fateful day - and the remarkable cover up that followed.\nFilmmaker's view\n\nBy Richard Belfield\n\nI was first told about the attack on the USS Liberty in 1980 over dinner with a former analyst from the National Security Agency (NSA) in Washington DC.\n\nBack in 1980, I promised my friend that if I ever got the chance I would make a film about it. Over the years, I pitched the idea to numerous broadcasters and always got the same response: eyes rolled upwards, usually followed by the statement, &quot;Are you completely mad?&quot;\n\nFast forward to 2009 and I was a guest speaker at the NSA's biennial conference on historical cryptography, talking about an unsolved code on an 18th century monument in an English stately home.\n\nWhile there, I went to two other sessions - both about attacks on American signal intelligence naval vessels.\n\nThe first was the capture of the US spy ship, the Pueblo (boarded by North Korean forces in 1968 - and never returned). The survivors of that incident were treated like heroes and feted on stage.\n\nThe next day there was a session about the USS Liberty. James Scott, who has written easily the best book on the Liberty attack, was on stage and limited to his allotted 20 minutes. Ranged against him were three Israeli apologists, all of whom were allowed to overrun their time. Survivors from the Liberty affair were allowed to sit in the audience, but they were denied any say in proceedings.\n\nAs an Englishman, I was brought up with a strong sense of fair play and I thought this was a disgrace. It was gruesome to watch. First, the crew had been attacked in broad daylight by a close ally, then they were betrayed by their government and now they were being humiliated by the same agency many had worked for back in 1967.\n\nEarlier this year, I acquired a copy of the audiotape of the attack as it had unfolded, the real time conversations between Isreali Air Force pilots and their controllers back at base. It had never been broadcast before. I went to talk to Al Jazeera and after careful consideration, the network commissioned the film.\n\nOn location, it all started with James Scott (who gets a co-producer credit on this project). When writing his book, he had already interviewed the survivors as well as many of the key people in the Washington political and intelligence machine from that time. The introductions he made would prove invaluable as we began filming interviews.\n\nThe veterans were extraordinary. One after another, they were generous with their time, uniformly eloquent and passionate and above all, honest in their recollections.\n\nThey all felt betrayed by the American government but were keen to exonerate ordinary Jewish people both in Israel and without, for any responsibility for the incident. Their beef was simply with the senior Israeli officers in the control room and their superiors higher up the command chain who had ordered the attack.\n\nAfter a few days filming, I rang Elaine Morris, my producer back in London. She asked how things were going. All I could say was that the quality of the interviews was the best I had ever experienced in many decades in this business.\n\nIn Texas we interviewed Bobby Ray Inman, an intelligence officer with a glittering track record at the CIA, Naval Intelligence and as a former director of the NSA. My contacts in the UK intelligence world had always told me &quot;he is one of the good guys&quot; and I quickly discovered why. He was frank and clear. The top Israeli commanders, he explained, had known exactly what they were doing when they attacked the Liberty and when it came to holding them to account, the US government rolled over for them.\n\nWe filmed an annual memorial ceremony in Washington, D.C. It was emotional, visceral and tense, with survivors, family and friends gathered in the morning sun. Listening to a sole bugler playing the US Navy's lament, 'Taps' is a memory that will never fade.\n\nYears earlier, I had visited the US military graves in Arlington Cemetery but now, following the ceremony, I got to go there again with Dave Lucas, one of the survivors of the attack and a truly wonderful man.\n\nWe filmed as he walked up the hill carrying a wreath from the ceremony. Alongside him was a crew member, a Portuguese language specialist, who had left the Liberty in Spain just a few days before it sailed off up the Mediterranean to take up position off the Egyptian coast. He had been temporarily replaced for the mission by an Arab linguist. He wept openly for the comrades he had said goodbye to, never to see again. As we filmed the pair laying the flowers, an interview with one of the other survivors, Jim Kavanagh came suddenly to mind. &quot;I went through hell,&quot; he had said about his shipmates. &quot;But they left this earth.&quot;\n\nFinally, we filmed on a sister ship to the Liberty, now moored in San Francisco. The crew hauled an outsized US flag up a mast for us. The flag - known as the &quot;holiday colours&quot; - was identical to that which was flown from the Liberty on June 8, 1967. It was huge, clearly visible for miles, and I knew immediately that no one could ever have been in any doubt about the nationality of the ship beneath it.\n\nWatching the Stars and Stripes unfurl into the wind, I realised that I had got to keep the promise I first made to my friend in a Washington restaurant 34 years ago","torrent":{"xt":"urn:btih:f69029020a5f5a8cf23a4ccb9564890cb9a34bf6","amp;dn":"Day+%5Bin+1967%5D+Israel+Attacked+America%2C+Killed...+-+Aljazeera","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f69029020a5f5a8cf23a4ccb9564890cb9a34bf6","infoHashBuffer":{"type":"Buffer","data":[246,144,41,2,10,95,90,140,242,58,76,203,149,100,137,12,185,163,75,246]},"announce":[],"urlList":[]}}