{"title":"BLEEDOUT ","uid":7630903,"size":77681328,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f77e9ae942dbf2e30d87165d4f812519433ba8cd&amp;dn=BLEEDOUT+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mirrormaster82","files":-1,"time":1347533409,"description":"Eight years ago, every oil well on the planet ran dry, utterly dissolving the cornerstone of modern civilization. Global economies withered and nations fell like bone-dry dominoes, including the seemingly impervious United States. Caught in a zenith of chaos, Sunrise City now lies in the hands of a criminal cabal who may or may not hold the key to the future and the secrets behind the planet's tragic ruin. Bleedout tells the frighteningly plausible tale of a world destroyed by its own greed and shortsightedness. Based on the Massively Multiplayer Online Shooter video game from Vogster Entertainment, this deluxe hardcover volume collects chapters drawn by some of the comic industry's hottest superstars, including Nathan Fox, Zach Howard, Sanford Greene, David Williams, Ben Templesmith, Gary Erskine, Howard Chaykin, Glenn Fabry, Vince Proce, and Trevor Hairsine, with cover art by Tim Bradstreet. Written by Mike Kennedy (Aeon Flux, Ghost), this graphic novel presents the world of Bleedout in all of its grim, pulp noir glory, with page after page of supplemental graphic and story material that further explores this tragic future, and the frighteningly familiar current events that led there in the first place.\n\nPUBLISHED BY ARCHAIA ENETERTAINMENT\n\nBY VARIOUS\n\nENJOY AND SEED...","torrent":{"xt":"urn:btih:f77e9ae942dbf2e30d87165d4f812519433ba8cd","amp;dn":"BLEEDOUT+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f77e9ae942dbf2e30d87165d4f812519433ba8cd","infoHashBuffer":{"type":"Buffer","data":[247,126,154,233,66,219,242,227,13,135,22,93,79,129,37,25,67,59,168,205]},"announce":[],"urlList":[]}}