{"title":"BBC - We Who Wait - TV Smith n the Adverts [MP4-AAC](oan)","uid":7331897,"size":621510438,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f82cf4bbe25b17d07e504ef1f5ea16ddd6e8af9c&amp;dn=BBC+-+We+Who+Wait+-+TV+Smith+n+the+Adverts+%5BMP4-AAC%5D%28oan%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oneanight","files":-1,"time":1338932013,"description":"BBC - We Who Wait - TV Smith &amp; the Adverts\n\n &lt;a href=&quot;\nhttp://nimga.com/f/evjxp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nimga.com/f/evjxp.jpg&lt;/a&gt;\n\n\nWe Who Wait tells the story of punk band the Adverts and the continuing music career of their former \nfrontman TV Smith, one of the most talented, literate and passionate - yet curiously overlooked - \nsongwriters to emerge from London's vibrant '77 new wave scene.\n\nSmith formed the Adverts in late '76 with his girlfriend Gaye and press criticism of the band's \nalleged musical ineptitude was answered by a defiant and iconic debut single, One Chord Wonders. \nA couple of months later, they secured their first chart hit with the macabre punk classic, Gary \nGilmore's Eyes. Gaye's status as reluctant punk icon ensured the band received a lot of press \nattention and a promising future beckoned. However, after a well-received but underperforming \ndebut LP and a critically-reviled follow-up, the Adverts suffered an acrimonious collapse.\n\nPushed to the margins of the music industry by shifting musical trends and a stubborn refusal to \ncompromise, Smith nonetheless continued a dogged struggle to make a living as a singer and songwriter \nin the face of critical hostility and industry indifference. After years of bad luck, personal loss \nand failed bands, Smith's persistence is finally paying dividends. He has carved out a career as a \nsolo artist and troubadour and painstakingly built a new audience through constant touring. To this \nday, he remains a fiercely inventive songwriter and an electrifying live performer - an enduring \nembodiment of punk's DIY ethos, passion and power.\n\nThe film is a testament to one of UK music's great outsiders, featuring a wealth of stills and \narchive footage and contributions from former band members, collaborators, critics and friends \nincluding Smith and Gaye Advert, Brian James, Richard Strange, John Robb, Greil Marcus, Miles, \nHenry Rollins, Ian MacKaye and many others.\n\n\n59mn 54s | 592 MiB | 720x400 | 1382 Kbps | 25.000 fps | AAC | 208 Kbps Vbr | 2 ch | QF 0.168\n &lt;a href=&quot;\nhttp://torrent-stats.info/4ef1/91f53014.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://torrent-stats.info/4ef1/91f53014.png&lt;/a&gt;","torrent":{"xt":"urn:btih:f82cf4bbe25b17d07e504ef1f5ea16ddd6e8af9c","amp;dn":"BBC+-+We+Who+Wait+-+TV+Smith+n+the+Adverts+%5BMP4-AAC%5D%28oan%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f82cf4bbe25b17d07e504ef1f5ea16ddd6e8af9c","infoHashBuffer":{"type":"Buffer","data":[248,44,244,187,226,91,23,208,126,80,78,241,245,234,22,221,214,232,175,156]},"announce":[],"urlList":[]}}