{"title":"Pitbull - Calle Ocho (I Know You Want Me) (2009)(HQ)-Wushan.avi","uid":4795193,"size":66173692,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f8b4d868d51f0b70c5fcc52f086e7408cbfa3bc1&amp;dn=Pitbull+-+Calle+Ocho+%28I+Know+You+Want+Me%29+%282009%29%28HQ%29-Wushan.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wushan","files":1,"time":1237851868,"description":"                   Pitbull (rapper)-I Know You Want Me (Calle Ocho)\n\n                                      2009\n\nArmando Christian PÃƒÂ©rez (born January 14, 1981), better known by his stage name Pitbull or his other nicknames, Lil' Chico or Mr. 305, is a Cuban rapper. His first recorded performance was from the Lil Jon album Kings of Crunk in 2002, after which he released his debut album in 2004 titled M.I.A.M.I. (short for Money Is a Major Issue) under TVT Records. Since then, he has released two other albums under the label, El Mariel in 2006 and The Boatlift in 2007.[2] He is also the host of his own Spanish-language program on the cable channel Mun2 titled La Esquina (Spanish for The Corner).\n\n \n           Early life and debut album\nPitbull grew up influenced both by the Cuban poet Jose Marti, whose works his parents made him memorize, and the Miami bass genre of hip hop music. He later expressed interest in the West coast and East coast genres later in life. In 2002, Pitbull was featured on Lil Jon and the East Side Boyz' album Kings of Crunk and the soundtrack to the film 2 Fast 2 Furious the following year. In addition, Pitbull also released several mixtapes, composed of freestyles and remixes of popular rap music. Former 2 Live Crew leader Luther Campbell featured Pitbull in his single &quot;Lollipop&quot;.[2] In 2004, Pitbull released his debut album M.I.A.M.I. (Money Is a Major Issue), with the lead single being &quot;Culo&quot; (&quot;ass&quot; in English) produced by Lil Jon and the Diaz Brothers. In January 2006 he guest-starred in UPN's South Beach. Also in 2006 he recorded &quot;Nuestro Himno&quot; in collaboration with Wyclef Jean, Carlos Ponce, and Olga TaÃƒÂ±ÃƒÂ³n.\n\n\n&quot;I Know You Want Me (Calle Ocho)&quot; is a song by rapper Pitbull released as the second single from his upcoming album, Rebelution. The official music video was released on March 9th, 2009 from Ultra Records on YouTube.\n\n                 Hot N Sexy~~~     Enjoy!!!\n\n","torrent":{"xt":"urn:btih:f8b4d868d51f0b70c5fcc52f086e7408cbfa3bc1","amp;dn":"Pitbull+-+Calle+Ocho+%28I+Know+You+Want+Me%29+%282009%29%28HQ%29-Wushan.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8b4d868d51f0b70c5fcc52f086e7408cbfa3bc1","infoHashBuffer":{"type":"Buffer","data":[248,180,216,104,213,31,11,112,197,252,197,47,8,110,116,8,203,250,59,193]},"announce":[],"urlList":[]}}