{"title":"(BBC) The Death Of Yugoslavia (1of6) Enter Nationalism","uid":4298806,"size":359598080,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fa74657e9c1621e3a5a029ce745454f0415f0fb4&amp;dn=%28BBC%29+The+Death+Of+Yugoslavia+%281of6%29+Enter+Nationalism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":1,"time":1216184640,"description":"(BBC) The Death Of Yugoslavia (1of6) Enter Nationalism\n\nThe Balkans have a history of ethnic conflict that stretches back centuries. When the dictator Josip Broz &quot;Tito&quot; commanded Yugoslavia, his iron-fisted rule kept the inherent ethnic and religious divisions in check. But since his death and the collapse of Communism, war has been a constant of life in the former Yugoslavia.\n\nTHE 20th CENTURY examines the deep roots of the modern conflicts, then plunges into the heat of battle with extensive footage of the wars that have once again brought chilling accusations of &quot;crimes against humanity.&quot; See how a former Communist functionary seized power by recasting himself as a strong-armed nationalist, and trace the fumbling efforts of the UN in this troubled region. Mike Wallace is joined by seasoned journalists who covered the events as they unfolded.\n\nThis is a compelling look at the modern conflict with ancient roots that has claimed over a quarter million lives.\n\nThe Death of Yugoslavia (Serbian or Croatian: Smrt Jugoslavije) is a BBC documentary series first broadcast in 1995. It covers the collapse of the former Yugoslavia. It is notable in its combination of never-before-seen archive footage interspersed with interviews by most of the main players in the conflict, including Slobodan Milo?evi?, then President of Serbia. This format, pioneered by the programme&amp;#039;s production company, Brian Lapping Associates, was very influential and the company produced many others in similar style.\n\nThe five parts were entitled:\n\nEnter Nationalism \nThe Road to War \nWars of Independence \nThe Gates of Hell \nA Safe Area","torrent":{"xt":"urn:btih:fa74657e9c1621e3a5a029ce745454f0415f0fb4","amp;dn":"%28BBC%29+The+Death+Of+Yugoslavia+%281of6%29+Enter+Nationalism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa74657e9c1621e3a5a029ce745454f0415f0fb4","infoHashBuffer":{"type":"Buffer","data":[250,116,101,126,156,22,33,227,165,160,41,206,116,84,84,240,65,95,15,180]},"announce":[],"urlList":[]}}