{"title":"High-Performance Thin-Layer Chromatography for the Analysis of M","uid":15059257,"size":9048374,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:faedd1f917913f3a02e0551b3298fc4da97b17c0&amp;dn=High-Performance+Thin-Layer+Chromatography+for+the+Analysis+of+M&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466748682,"description":"High-Performance Thin-Layer Chromatography for the Analysis of Medicinal Plants - E. Reich, A. Schibli (Thieme, 2007).pdf\r\n\r\nISBN 978-1-58890-409-6\r\n\r\nHigh-Performance Thin-Layer Chromatography for the Analysis of Medicinal Plants presents the theoretical and technical information needed to perform reliable and reproducible high-performance thin-layer chromatography (HPTLC) to establish the identity, purity, quality, and stability of raw materials, extracts, and finished botanical products. The text provides a complete overview of the technique and common applications of HPTLC in herbal analysis. It will help the analyst answer questions such as:\r\nAm I paying for a high-quality material, but getting a cheap adulterant?\r\nIs this raw material worth its price?\r\nDoes this product comply with the claim on its label?\r\nHas the composition of this product changed after being on the shelf for more than a year?\r\nPractical examples provided by renowned experts help the reader gain a firm understanding of HPTLC methodologies. More than 300 full-color illustrations aid comprehension of complex concepts, and easy-to-reference text boxes provide summaries of key information.This book is essential for analysts, quality assurance professionals, and regulators seeking a comprehensive text on how to use HPTLC to determine whether botanicals comply with current, good manufacturing practices. It will also benefit students in pharmacognosy, phytopharmacy, pharmaceutical biology, and analytical chemistry programs","torrent":{"xt":"urn:btih:faedd1f917913f3a02e0551b3298fc4da97b17c0","amp;dn":"High-Performance+Thin-Layer+Chromatography+for+the+Analysis+of+M","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faedd1f917913f3a02e0551b3298fc4da97b17c0","infoHashBuffer":{"type":"Buffer","data":[250,237,209,249,23,145,63,58,2,224,85,27,50,152,252,77,169,123,23,192]},"announce":[],"urlList":[]}}