{"title":"Process Centrifugal Compressors - Klaus H. Ludtke","uid":14638390,"size":29870629,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc2738852b10a200fff7d73158164411aa9b59ce&amp;dn=Process+Centrifugal+Compressors+-+Klaus+H.+Ludtke&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463483297,"description":"Process Centrifugal Compressors - Klaus H. Ludtke (Springer, 2004).pdf\r\n\r\nISBN 978-3-642-07330-4\r\n\r\nThroughout the last decades, centrifugal compressor research and development have been revolutionized. Computational fluid dynamics have provided a better understanding of the flow and physical phenomena, and the design of new cen trifugal compressor components has been transformed from an &quot;art&quot; into a &quot;sci ence&quot;. New materials and manufacturing techniques now create new geometries that could only be dreamed of in the past, and new challenging applications have pushed the limits beyond what was considered the state of the art. This new book presenting a comprehensive look at industrial compressors is therefore very timely. Readers will find a large amount of information based on extensive experience, a clear and well-founded approach to real-gas handling and solutions to many practical problems. It will provide engineering contractors and users of industrial compressors with a better insight into the &quot;how&quot; and &quot;why&quot; of different design features thus allowing a more profound basis for discussions with manufacturers. It will also cast a light on the day-by-day design practice to academia by revealing the limitations and requirements of practical applications and economics. This book combines a strict mathematical approach with practical experience and is illustrated with many examples. It fills in the gap between academic text books and encyclopaedic descriptions of industrial compressors. I have no doubt that this book, based on several decades of experience in the industry, both in the USA and Europe, will be well received by the centrifugal compressor community","torrent":{"xt":"urn:btih:fc2738852b10a200fff7d73158164411aa9b59ce","amp;dn":"Process+Centrifugal+Compressors+-+Klaus+H.+Ludtke","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc2738852b10a200fff7d73158164411aa9b59ce","infoHashBuffer":{"type":"Buffer","data":[252,39,56,133,43,16,162,0,255,247,215,49,88,22,68,17,170,155,89,206]},"announce":[],"urlList":[]}}