{"title":"Batman - Death Mask 1-4 (DC-CMX)","uid":4440633,"size":163060944,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fe0465b83d3983fd52fe1d5eed941872f47878ff&amp;dn=Batman+-+Death+Mask+1-4+%28DC-CMX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mmdsx","files":-1,"time":1223802280,"description":"Batman - Death Mask #1-4\n\nHave you ever wondered what it would be like to see Batman in manga style?\nIf you have, well, wonder no more because there&amp;#039;s this four issue miniseries done in that style by Yoshinori Natsume.\n\n&quot;He&amp;#039;s an American hero, but Bruce Wayne might never have become Batman without a visit to Japan.\n\nAt least according to writer/artist Yoshinori Natsume, whose original manga tale Batman: Death Mask takes a look at Bruce Wayne&amp;#039;s grueling transformation from lonely billionaire seeking vengeance for the death of his parents to skilled and deadly Dark Knight and the training in Japan that helped get him there. A mysterious serial killer with connections to Batman&amp;#039;s past has appeared to threaten Gotham, and the Dark Knight must explore his experiences as a young man across the Pacific to figure out what he knows about the murderer...and what the murderer knows about him.\n\nNatsume brings an eastern flair to the all-new Batman comic premiering this week from DC, which ties the past years of Bruce Wayne&amp;#039;s globe-spanning training with his crime-fighting present. With Death Mask hitting shelves and Batman: Gotham Knight, a collection of original anime shorts, on its way, could more Batman tales from Japan be in store? As anime and manga gains ground every day in mainstream American media, Death Mask may help pave the way for more eastern takes on iconic western heroes.&quot;\n\n(Review by Carolyn Fowlkes from Wizard)\n\n---------------------------------------------------------\n\nWritten and illustrated by Yoshinori Natsume.\nIt is in black and white (as most mangas), each issue has 50 pages.\nThe issues were scanned by different people, all of them members of DCP.\n","torrent":{"xt":"urn:btih:fe0465b83d3983fd52fe1d5eed941872f47878ff","amp;dn":"Batman+-+Death+Mask+1-4+%28DC-CMX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe0465b83d3983fd52fe1d5eed941872f47878ff","infoHashBuffer":{"type":"Buffer","data":[254,4,101,184,61,57,131,253,82,254,29,94,237,148,24,114,244,120,120,255]},"announce":[],"urlList":[]}}