{"title":"Thin_Lizzy-Still_Dangerous-(Advance)-2009-RVP","uid":4731706,"size":76858297,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fe36c49017a45e8c8bfad4904bea2d9cd6bf3c91&amp;dn=Thin_Lizzy-Still_Dangerous-%28Advance%29-2009-RVP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kortleken","files":15,"time":1235066589,"description":"+----------------------------------------------------------------------------+\n|                                                                            |\n| Artist     : Thin Lizzy                                                    |\n| Album      : Still Dangerous                                               |\n| Bitrate    : VBR kbps                                                      |\n| Label      : VH1 Classic                                                   |\n| Year       : 2009                                                          |\n| Genre      : Rock                                                          |\n| Rip date   : Feb-18-2009                                                   |\n| Store date : Mar-03-2009                                                   |\n| Size       : 73,2 MB                                                       |\n|                                                                            |\n+--------------------------------[Track List]--------------------------------+\n|                                                                            |\n|Track Listing:                                                              |\n|                                                                            |\n| 01 - Soldier Of Fortune                        05:23                       |\n| 02 - Jailbreak                                 04:28                       |\n| 03 - Cowboy Song                               05:04                       |\n| 04 - Boys Are Back In Town                     04:45                       |\n| 05 - Cancing In The Moonlight                  04:08                       |\n| 06 - Massacre                                  03:02                       |\n| 07 - Opium Trail                               04:51                       |\n| 08 - Don't Believe A Word                      02:25                       |\n| 09 - Baby Drives Me Crazy                      06:11                       |\n| 10 - Me And The Boys                           06:55                       |\n| 11 - Bad Reputation                            04:19                       |\n| 12 - Emerald                                   04:36                       |\n|                                                                            |\n|                                                                            |\n|                                                56:07 min                   |\n|                                                                            |\n+----------------------------------[Notes]-----------------------------------+\n|                                                                            |\n|  Despite a huge hit single in the mid-'70s (&quot;The Boys Are Back in Town&quot;)   |\n|  and becoming a popular act with hard rock/heavy metal fans, Thin Lizzy    |\n|  are still, in the pantheon of '70s rock bands, underappreciated. Formed   |\n|  in the late '60s by Irish singer/songwriter/bassist Phil Lynott, Lizzy,   |\n|  though not the first band to do so, combined romanticized working-class   |\n|  sentiments with their ferocious, twin-lead guitar attack. As the band's   |\n|  creative force, Lynott was a more insightful and intelligent writer than  |\n|  many of his ilk, preferring slice-of-life working-class dramas of love    |\n|  and hate influenced by Bob Dylan, Bruce Springsteen, and virtually all    |\n|  of the Irish literary tradition. Also, as a black man, Lynott was an      |\n|  anomaly in the nearly all-white world of hard rock, and as such imbued    |\n|  much of his work with a sense of alienation; he was the outsider, the     |\n|  romantic guy from the other side of the tracks, a self-styled poet of     |\n|  the lovelorn and downtrodden. His sweeping vision and writerly impulses   |\n|  at times gave way to pretentious songs aspiring to clichÃƒÂ©d notions of     |\n|  literary significance, but Lynott's limitless charisma made even the      |\n|  most misguided moments worth hearing.                                     |\n|                                                                            |\n|  After a few early records that hinted at the band's potential, Lizzy      |\n|  released Fighting in 1975, and the band (Lynott, guitarists Brian         |\n|  Robertson and Scott Gorham, and drummer Brian Downey) had molded itself   |\n|  into a pretty tight recording and performing unit. Lynott's thick,        |\n|  soulful vocals were the perfect vehicle for his tightly written melodic   |\n|  lines. Gorham and Robertson generally played lead lines in harmonic       |\n|  tandem, while Downey (a great drummer who had equal amounts of power and  |\n|  style) drove the engine. Lizzy's big break came with their next album,    |\n|  Jailbreak, and the record's first single, &quot;The Boys Are Back in Town.&quot; A  |\n|  paean to the joys of working-class guys letting loose, the song           |\n|  resembled similar odes by Bruce Springsteen, with the exception of the    |\n|  Who-like power chords in the chorus. With the support of radio and every  |\n|  frat boy in America, &quot;Boys&quot; became a huge hit, enough of a hit as to      |\n|  ensure record contracts and media attention for the next decade (&quot;Boys&quot;   |\n|  is now used in beer advertising).                                         |\n|                                                                            |\n|  Never the toast of critics (the majority writing in the '70s hated hard   |\n|  rock and heavy metal), Lizzy toured relentlessly, building an             |\n|  unassailable reputation as a terrific live band, despite the lead guitar  |\n|  spot becoming a revolving door (Eric Bell, Gary Moore, Brian Robertson,   |\n|  Snowy White, and John Sykes all stood next to Scott Gorham). The records  |\n|  came fast and furious, and despite attempts to repeat the formula that    |\n|  worked like a charm with &quot;Boys,&quot; Lynott began writing more ambitious      |\n|  songs and wrapping them up in vaguely articulated concept albums. The     |\n|  large fan base the band had built as a result of &quot;Boys&quot; turned into a     |\n|  smaller, yet still enthusiastic bunch of hard rockers. Adding insult to   |\n|  injury was the rise of punk rock, which Lynott vigorously supported, but  |\n|  made Lizzy look too traditional and too much like tired old rock stars.   |\n|                                                                            |\n|  By the mid-'80s, resembling the dinosaur that punk rock wanted to         |\n|  annihilate, Thin Lizzy called it a career. Lynott recorded solo records   |\n|  that more explicitly examined issues of class and race, published a now   |\n|  -out-of-print book of poetry, and sadly, became a victim of his longtime  |\n|  abuse of heroin, cocaine, and alcohol, dying in 1986 at age 35. Since     |\n|  the mega-popular alternative rock bands of the mid-'90s appropriated      |\n|  numerous musical messages from their '70s forebears, the work of Phil     |\n|  Lynott and Thin Lizzy will hopefully continue to be seen for the          |\n|  influential rock &amp; roll it is.                                            |\n|                                                                            |\n|  In 1999, Thin Lizzy reunited with a lineup featuring guitarists Scott     |\n|  Gorman and John Sykes, and keyboardist Darren Wharton, which was rounded  |\n|  out by a journeyman rhythm section of bassist Marco Mendoza and drummer   |\n|  Tommy Aldridge. The quintet's ensuing European tour produced the live     |\n|  album One Night Only, which was released in the summer of 2000 to set     |\n|  the stage for a subsequent American concert tour.                         |\n|                                                                            |\n+----------------------------------------------------------------------------+","torrent":{"xt":"urn:btih:fe36c49017a45e8c8bfad4904bea2d9cd6bf3c91","amp;dn":"Thin_Lizzy-Still_Dangerous-%28Advance%29-2009-RVP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe36c49017a45e8c8bfad4904bea2d9cd6bf3c91","infoHashBuffer":{"type":"Buffer","data":[254,54,196,144,23,164,94,140,139,250,212,144,75,234,45,156,214,191,60,145]},"announce":[],"urlList":[]}}