{"title":"Nanomaterials for Medical Applications - Zoraida P. Aguilar","uid":15430201,"size":8295360,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff11ce9aef6dd3b7374b46dba321c3b029a478a3&amp;dn=Nanomaterials+for+Medical+Applications+-+Zoraida+P.+Aguilar&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469717158,"description":"Nanomaterials for Medical Applications - Zoraida P. Aguilar (Elsevier, 2013).pdf\r\n\r\nThis title covers recent advances in a variety of biomedical applications of nanostructured materials, as the field evolves from prototype device to real-world application. It presents the main types of nanomaterial used in medical application today: semiconductor nanomaterials, Magnetic nanomaterials, metal nanoparticles, Carbon nanomaterials, Hydrogel nanocomposites, Liposomes, Dendrimers, Polymer nanocomposites, and Biodegradable polymers. Structurally the work is demarcated into the six most popular areas of research: (1) biocompatibility of nanomaterials with living organisms in their various manifestations (2) nanobiosensors for clinical diagnostics, detecting biomolecules which are useful in the clinical diagnosis of genetic, metabolically acquired, induced or infectious disease (3) targeted drug delivery for nanomaterials in their various modifications (4) nanomedical devices and structures which are used in the development of implantable medical devices and structures such as nanorobots (5) nanopharmacology, as novel nanoparticles are increasingly engineered to diagnose conditions and recognize pathogens, identify ideal pharmaceutical agents to treat the condition or pathogens,fuel high-yield production of matched pharmaceuticals (potentially in vivo), locate, attach or enter target tissue, structures or pathogens; and dispense the ideal mass of matched biological compound to the target regions (6) nanotoxicology and remediation, which focuses on finished and on-going various toxicity evaluations on various nanomaterials that are used and currently being developed for medical applications\r\n\r\n\r\n\r\nDiscusses the most important biomedical applications and devices of nanomaterials: drug delivery, medical imaging, gene therapy, nanorobots, biosensors and diagnostics\r\nFocuses on current commercialized techniques and applications, ensuring the work is entirely relevant to a rapidly evolving field\r\nReviews the most recent studies on nanomaterial toxicity, thereby responding to the widescale private, policy and public interest in nanoscience","torrent":{"xt":"urn:btih:ff11ce9aef6dd3b7374b46dba321c3b029a478a3","amp;dn":"Nanomaterials+for+Medical+Applications+-+Zoraida+P.+Aguilar","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff11ce9aef6dd3b7374b46dba321c3b029a478a3","infoHashBuffer":{"type":"Buffer","data":[255,17,206,154,239,109,211,183,55,75,70,219,163,33,195,176,41,164,120,163]},"announce":[],"urlList":[]}}